{
    "Chapter 1": "📕WuxiaClick🌙Home/Super God GeneCH 1Novel InfoNovel InfoAll ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayBy a stony creek in a valley, a black-clad young man was holding a black beetle with a metallic sheen that looked like a cross between a crab and a Hercules beetle.Holding a dagger in his other hand, the young man swiftly cut the still-struggling claws off the beetle, revealing white and tender meat.Almost without hesitation, the young man sucked the meat out of the claws as if he were eating a crab, and swallowed it together with larger pieces of tougher meat.\"Black beetle killed. No beast soul gained. Eat the flesh of the black beetle to gain zero to ten geno points randomly.\"\"Black beetle flesh eaten. Zero geno points gained.\"A strange voice sounded in Han Sen's mind, and some data also appeared.Han Sen: Not evolved.Status: None.Life span: 200 years.Required for evolution: 100 geno points.Geno points gained: 79.Beast souls gained: none.\"I have received zero geno points from more than thirty black beetles in a row. I must have eaten too much black-beetle flesh to evolve from it further. Zero points! When will I ever finish the first evolution and gain status.\" Han Sen looked frustrated.Over a hundred years ago, science and technology reached a very high level, and humans finally mastered space teleportation technology. Shockingly, when they tried to be teleported, they found that they were neither sent back to the past nor teleported to the future. They didn’t even travel from one planet to another. A completely different world lay at the other end of the space teleport channel.A world that human beings could not have imagined. In this world, all scientific and technological means lost their function: a machine gun in this world was not even as useful as a steel knife. Missiles and nuclear weapons would not explode, same as a heap of scrap iron. No mechanical or electronic equipment would work either.All kinds of horrible creatures inhabited this world. Human beings, who used to stand on top of the food chain because of their wisdom and technology fell to the bottom.But when people killed certain relatively weak creatures and ate their flesh, they were surprised to find that their own bodies changed considerably and evolved quickly in ways that science could not explain.What made people pleasantly surprised was that in this world, with the evolution of the body, their lifespans also increased, which was amazing news to all mankind.In the following century, more and more people entered this world called \"God's Sanctuary,\" gradually became familiar with the rules of this world, hunted its creatures, and saw their own bodies evolve. The higher the degree of physical evolution, the longer the life. Theoretically, if you could continue evolving, it could be possible to live forever.In this world, science and technology became completely useless. The only things that could help humans were the most primitive fighting skills. Ancient martial arts, which were almost forgotten in modern society, had an unexpected effect here.All kinds of ancient martial arts had been re-developed, and after more than 100 years of development, new martial arts schools were formed and became prominent.In addition to ancient martial arts, God's Sanctuary offered another tool to enhance humans, the beast soul.When killing a creature in God's Sanctuary, a person had a chance to obtain the beast soul of the creature. Beast souls had all kinds of forms and appearances. Some could be summoned to fight for men, and some appeared in the form of armor or weapon.In addition, some beast souls could even help humans transform so they could take the shape of terrifying monsters, magical birds flying between heaven and earth, or insects drilling underground.Neither martial arts nor beast souls had anything to do with Han Sen.Even in modern society, advanced science and technology were in the hands of just a few people.Han Sen completed integrated compulsory education and entered God’s Sanctuary when he turned 16. What he had learned from school was no more than the beginning level new martial arts that everyone knew.As for beast souls, they were so expensive that Han Sen couldn’t afford even the cheapest.Without martial arts and beast souls, or even advanced man-made alloy weapons, Han Sen was only able to kill some low-level creatures to eat their flesh and evolve, and he was having a difficult time in God’s Sanctuary.But the more meat of low-level creatures he ate, the less effect of evolution he gained. Three months in God’s Sanctuary and he still could not complete a physical evolution.Han Sen had tried to kill some of the more powerful creatures, but even the weakest primitive creature, the copper-toothed beast, almost took his life. He had to rest for nearly a month before returning to God's Sanctuary.By this time Han Sen had eaten all kinds of ordinary creatures around him, and it wouldn’t help to eat their flesh any more. If he didn’t risk hunting more advanced creatures, he would never evolve.When he was about to try to kill a copper-toothed beast, Han Sen saw something climbing out from the ripples of the creek.He originally thought it was a black beetle, but immediately noticed something different: all black beetles had black shells, but a bright golden color caught his eye.Han Sen gazed at the creature climbing out of the water. It really was a black beetle, but different from the ordinary ones because of its golden body as big as a basketball. It was like a sculpture carved from gold, and its eyes were crystal clear, like gems. It did not even look like a living thing unless observed carefully.\"Why is this black beetle so strange?\" Han Sen stared at the golden black beetle.Recently he had killed countless black beetles and knew everything about them. Their vision was poor, but their hearing was very sensitive. As long as he remained still, even in close proximity, a black beetle would not notice his presence.Han Sen stared at the strange beetle, and unexpectedly, it climbed toward him.Without hesitation, when the golden black beetle crawled next to Han Sen, he held down the golden black beetle's shell with one hand and swiftly cut into its fragile joints with the dagger in his other hand. He made six clean cuts vertically and horizontally to remove all six claws of the beetle.The golden black beetle struggled and flipped over. Taking this opportunity, Han Sen pierced his dagger into a white mark on its belly and turned it sharply. The golden black beetle suddenly stopped moving.\"Sacred-blood creature black beetle killed. Beast soul of sacred-blood black beetle gained. Eat the flesh of sacred-blood black beetle to gain 0 to 10 geno points randomly.\"Novel InfoNovel InfoAll ChaptersNext Chapter>",
    "Chapter 2": "📕WuxiaClick🌙Home/Super God GeneCH 2Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen was stunned by the sudden voice in his head, and he could hardly believe it was true. Sacred-blood creature and sacred-blood beast soul: were those even real?The creatures of God’s Sanctuary were divided into four parts: ordinary creatures, primitive creatures, mutant creatures and sacred-blood creatures. Different geno points could be gained by eating flesh of creatures of different types.At that time, there were four God’s Sanctuary phases known to men. With each physical evolution completed, access to the next space would be permitted. The more powerful the geno points used in evolution, the higher the likelihood of surviving in the next space.Sacred-blood beast souls were without any doubt the best beast souls. Any sacred-blood beast soul could be sold at an enormous price.When Han Sen finally realized what had really happened, he was almost trembling. Holding the dagger to pick open the shell of the black beetle, he filled his mouth with meat as tender as jelly.\"Flesh of black beetle eaten. One sacred geno point gained.\"Feeling the flesh turn to energy and hearing the voice in his mind almost brought Han Sen to tears.He grabbed a claw and sucked out all meat from it, feeling waves of energy hitting his body and boiling his blood.There was not much difference between eating a sacred-blood black beetle and eating a crab. After sucking the meat clean from all six claws, Han Sen started to cut the meat inside the shell.\"Flesh of black beetle eaten. One sacred geno point gained.\"\"Flesh of black beetle eaten. One sacred geno point gained.\"The strange voice continuously sounded in Han Sen’s mind and made him feel on top of the world.As Han Sen was cutting away, he felt his dagger cut into something hard that made a sound like metal. Han Sen stopped.Black beetles and crabs are alike: They looked tough, but inside their shells there would be nothing but boneless meat, so how could there be metal?He removed the dagger, pulled aside the meat that had been cut, and saw a corner of black metal. Han Sen cut open all the meat surrounding it, and soon the black metal was completely exposed.At first he thought it was metal, but taking it out, he discovered that it was a black crystal the size and shape of a pigeon egg.Han Sen took the crystal in his hand and didn’t feel anything abnormal. The crystal was just like a beautiful, rounded black pebble.But with a closer look, there seemed to be millions of stars shining in it, creating incredible beauty.\"Here is the easiest area in God’s Sanctuary,\" Han Sen thought. \"Even primitive creatures are hard to find here, let alone sacred-blood creatures. How did this sacred-blood black beetle suddenly appear? And I’ve never heard of a sacred-blood black beetle before. Black beetles are such low life after all. And this sacred-blood black beetle is so outrageously weak. Is its appearance related to the crystal?\"There was no clue, so he simply ate all the rest of the black beetle meat and was stuffed. He gained a total of seven sacred geno points.Seven sacred geno points were beyond his wildest dreams. With his background, he needed to risk everything even to kill a primitive creature, let alone a sacred-blood creature.The shell of the sacred-blood black beetle was also precious material, so Han Sen picked up all the claws and stuffed them into his pocket, together with the upper and lower shells.The shell of ordinary black beetles almost had no value, but the shell of a sacred-blood black beetle would probably make a soup that could give him one or two more sacred geno points.It was the first time Han Sen had eaten a sacred-blood creature. Technically he could max out and get ten sacred geno points: he already had seven from the meat, and the other three should be in the shell.If he were to sell the shell, he could probably afford a nice private aircraft in Levo Interstellar Alliance with the money he received.On the way back to Steel Armor Castle, everyone was pointing at him, gloating and laughing, and no one would come near him.Everyone in the Sanctuary was looking at him as if he were a monster.Normally, when an ordinary person went to the Sanctuary, even if he were poor, if his martial skills were not too bad, he could always find some companions and kill a few primitive creatures together, and he would be nowhere near as miserable as Han Sen.However, in the entire Steel Armor Castle, no one was willing or had the courage to have anything to do with Han Sen.More than three months ago, Han Sen had entered God’s Sanctuary for the first time. The moment he stepped outside Steel Armor Shelter, he saw a giant white wolf unicorn standing with its back towards him around the corner of the rampart.Without hesitation, Han Sen grabbed his dagger and fiercely stabbed the unicorn in the ass.This stab turned Han Sen and Qin Xuan together into the biggest laughing stock in Steel Armor Shelter.Yes, the white wolf unicorn was not a beast, but a human like Han Sen himself. She was just transforming using a beast soul.Qin Xuan was also the most powerful woman in Steel Armor Shelter. She was likely to finish her first evolution with sacred geno points and embark on the path of evolution.A new guy stabbing Qin Xuan's rear end became the biggest joke in Steel Armor Shelter. Although no one dared to mention this to Qin Xuan's face, secretly everyone was laughing their asses off.And \"Ass Freak\" became Han Sen’s well-known nickname in Steel Armor Shelter.Then Qin Xuan declared that whoever spent time with Han Sen would become her enemy. In Steel Armor Shelter, few people could afford to be Qin Xuan’s enemy. Even if they could afford it, no one would risk antagonizing Qin Xuan for the sake of a nobody and Ass Freak.That was why Han Sen had such a difficult time, but he didn’t really blame Qin Xuan. It was his fault in the first place: He was too nervous the first time he came to God’s Sanctuary, plus he had never seen creatures in his previous world or transformers before, which all led to the unforgivable mistake.Han Sen was already grateful that Qin Xuan did not kill him in anger.The only lucky thing was that the teleportation into God’s Sanctuary was always random, and there were no familiar faces in Steel Armor Shelter, so no one knew his real name.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 3": "📕WuxiaClick🌙Home/Super God GeneCH 3Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen returned to his room, made a fire, and started boiling the black beetle claws and shells in a pot.Without tools and know-how, he could only use the most primitive methods to process the shells and extract the geno essence.The shell of a sacred-blood creature would take more than an hour or two to cook, so Han Sen covered the lid and took out the black crystal to take a closer look.Still, no clues whatsoever.Suddenly, Han Sen caught a glimpse of the caged green-scaled beast the size of a civet cat in the corner of his room and suddenly had an idea.Like black beetles, this green-scaled beast was an ordinary creature. Han Sen used to prey on them and bring them back to cook and eat to increase his geno points.But later, green-scaled beasts no longer increased his geno points, so Han Sen didn’t eat the last beast and forgot about it. Surprisingly, it was still alive.He grabbed the moribund green-scaled beast from the cage, hesitated for a moment and was about to feed the black crystal to the beast.To his surprise, seeing the black crystal, the dying green-scaled beast gathered all its strength to stretch out its tongue, roll the black crystal back into its mouth and swallow the whole crystal.\"There is indeed something magical about the black crystal!\" Han Sen was stunned and found that the green-scaled beast seemed considerably more lively after swallowing the crystal, its four claws scratching and head moving to bite Han Sen’s hand, which was on its neck.Han Sen threw the green scaled beast back into the cage and carefully watched it. The beast, which hadn’t fed for days, completely recovered its vitality, thrashing and scratching wildly in the cage, just like it had when it was first caught.Han Sen sat across from the cage and watched the movements of the green-scaled beast. He had a guess, and if he was right, he might have obtained something incredible—something more exciting than a sacred-blood creature.But Han Sen was afraid he was wrong, so he could only stare at the green-scaled beast anxiously, hoping to see the change that he desired.Han Sen nervously stared intently and did not realize that he was starving until he smelled bone broth from the pot.Looking at the time, he noticed almost 24 hours had passed. Rising to check the black beetle shell in the pot, he saw the golden color of the shell had been boiled off and the broth had become golden. It smelled so good that the hungry young man’s mouth watered.About to scoop up a bowl of soup, Han Sen suddenly heard iron breaking from the cage of the green-scaled beast. He quickly turned around and saw the green-scaled beast had bitten off an iron bar of the cage and stretched out his head from the inside.Its light green scales had now completely turned a dark green color. Its teeth had become sharp and the tips of its four claws were like iron hooks. The beast was about to come out of the cage.Han Sen was pleasantly surprised and pulled out the dagger from his waist. He rushed to the front of the cage and stabbed the dagger into the lower belly of the green-scaled beast. With a turn of the dagger, the green scaled beast stopped struggling.\"Primitive creature green-scaled beast killed. No beast soul gained. Eat the flesh of the primitive green-scaled beast to gain zero to ten points randomly.\"The strange voice sounded in Han Sen’s mind and left him stunned.\"Primitive green-scaled beast … Primitive creature … So the crystal can really make these creatures evolve … \" Han Sen was overwhelmed with joy and did not know how to react.After a long time, he suddenly cut open the green-scaled beast with the dagger and uncovered the crystal as big as a pigeon egg. Taking no heed of the blood on it, he kissed the crystal twice and then wiped it clean, holding it in his hands like it was a great treasure.\"The crystal was really the reason the black beetle became a sacred-blood creature … If the green-scaled beast had continued to evolve, could it have become a sacred blood creature too? \" Han Sen almost dared not think about it, because it was just too amazing.He was so excited that his hands were trembling while holding the crystal. He bit his tongue and cried out of pain so as to know that it really was not a dream.After remaining excited for quite a while, Han Sen carefully put the crystal away, gobbled up the shell broth, and gained another sacred geno point, bringing his geno point count to eight.Without tools and means, his primitive method couldn’t extract all geno essence from the shell, but it was good enough that he gained one sacred geno point.Han Sen realized that he had gained a sacred-blood beast soul of a black beetle when he killed the golden black beetle, and he quickly accessed his profile.Han Sen: Not evolved.Status: NoneLife span: 200 years.Requirements for evolution: 100 geno points.Geno points gained: 79 geno points; 8 sacred geno points.Beast soul gained: Sacred-blood black beetle.Type of sacred-blood black beetle’s beast soul: Armor.\"What would the armor of sacred-blood black beetle’s beast soul look like?\" Before Han Sen finished the thought, a golden shadow shot out of thin air, looking exactly like the golden black beetle.The golden black beetle flew to Han Sen's chest, turned into a golden liquid and started to cover his whole body. In the blink of an eye, Han Sen's whole body, together with his hair, was all wrapped up.The streamlined gold armor was full of power and impact, and covered his whole body as if it were a suit of gothic Medieval armor instilled with improved aerodynamics—it looked just like a piece of art.The whole suit of armor felt full of power and speed, making Han Sen look slender and majestic, as if his whole body were full of explosive power.With shining metallic luster, the armor was gorgeous and had a solid texture. At first glance, it was even somewhat like the gold cloth worn by Golden Saints.The difference between the gold cloth and the beast soul armor was that the armor covered the head and body completely, with only a few gaps in the joints where different pieces overlapped, just like the black beetle itself, which was the only weakness of the beast soul armor.Han Sen moved around in the armor and there was no feeling of heaviness or clumsiness. Instead he felt that his body had become a little lighter and full of energy.\"Indeed, this was armor from a sacred-blood beast soul. It is way more gorgeous than the ones from primitive beast souls that I often have seen at Steel Armor Shelter.\" Han Sen felt ecstatic. He used to envy people in armor of primitive beast souls and had never thought he would get a suit of a sacred-blood beast soul one day.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 4": "📕WuxiaClick🌙Home/Super God GeneCH 4Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"Yate Group President Zhao Yalong completed the third evolution, entered Fourth God’s Sanctuary, and became the 83rd human in history to enter Fourth God’s Sanctuary. His life span has reached 500 years and he has gained the status of demigod…\"\"The prodigy from Raikot Galaxy, Lange, entered Second God’s Sanctuary with 100 mutation geno points. His life span has reached 300 years and he has gained the status of evolver...\"\"The speaker of the House of Representatives, Hemingway, killed a demigod creature star of the ocean yesterday, and was the first to accomplished this feat... \"\"According to authoritative experts, in ten years someone will complete the fourth evolution for the first time and advance into Fifth God’s Sanctuary...\"\"...\"Han Sen had just teleported from the Steel Armor Shelter and the news was playing on a virtual screen.\"Evolver, surpasser and demigod. With the black crystal, I will be able to do all that, and go even farther.\" Han Sen shook his fist, stepped away from the teleport station, and took the maglev train home.Before he went into the yard, Han Sen heard a harsh female voice.\"Luo Sulan, do you want to take the old house of the Hans? This house was our parents’, and my two elder brothers and I each own a part. Now my eldest brother has passed. We won’t bully you, since you are a widow, and will leave you his share. But if you want to take everything, we will never agree. \"\"That’s right!\" The voice of a middle-aged man chimed in. \"The old house has always been the inheritance of our parents. All of us have rights to it, and you can’t keep it for yourselves. Your family has lived here for more than 20 years, so you have already taken advantage of us in a big way. It is time to divide the inheritance.\"\"My brother has said it,\" a soft-pitched male voice continued. \"You lived in the old house for more than 20 years. We will not collect the rent, but this old house is our inheritance and has to be divided.\"A young woman’s voice could be heard saying, \"We have an estimate from a lawyer, and this old house is now worth more than three million. We are three households, so we should get a million each. You can either give each of us a million and own this old house outright, or sell the house, and then we all split the money. We are okay with either option you choose.\"\"Exactly, now that our eldest brother is gone, we won’t bully his widow and kids. You can give us money or sell the house, as you like,\" the harsh first voice began again.\"Brother and sister, there is no need to force me. You know our situation. We don’t have two million,\" a woman said sadly.\"Then put the house up for sale,\" the harsh woman immediately said.\"Where would we live without a house? Han Sen just graduated and Han Yan is about to go to school,\" the sad woman said.\"Sister-in-law, this is not reasonable. How are you the only one with troubles? Your kids Han Sen and Han Yan are only enrolled in integrated compulsory education, while my Han Hao goes to a private school. His tuition gives me grey hair every year. \"\"Sister, you are right. We are all having a hard time and everyone needs money. Why don’t we just sell the house? We could all take some, and you could afford Han Yan’s education,\" said the effeminate voice.\"Anyway, you either give us money or sell the house. Your choice,\" the young woman said coldly.Outside the house, Han Sen became furious as he listened. He pushed the door open and saw his mother shedding tears while holding his sister, Han Yan. The five-year-old girl curled up in the arms of her mother, her big eyes full of fear. Next to them, two men and two women were all smiling indifferently.\"How dare you come here and ask for the old house?\" Han Sen pointed to the fierce-looking fat woman and exclaimed in anger. \"Aunt, you used to be an accountant in the company and brought about tens of millions in bad debts. Did my dad not help you after you begged him?\"\"Han Sen, what nonsense. Who caused bad debts? Stop lying,\" the skinny guy with the effeminate voice cried, pointing to Han Sen.\"Uncle, you embezzled the company's public funds to invest and lost a few million.\" Han Sen pointed to the skinny guy. \"Did you not come to my home and get on your knees to beg my dad for help?\"\"And you, uncle, you owed so many gambling debts that you were almost forced to commit suicide. Who helped you? When you were almost beaten to death, who saved your life?\" Han Sen pointed to the fat, middle-aged man.\"Starry Group wanted to acquire our family business. If my dad didn’t represent all of you and then had a falling out with Starry Group, would he have died in such a shady way?\" Han Sen clenched his teeth, looking at the four. \"But you, you skipped my dad’s funeral and sold the company to Starry Group upon his death. Did you give us any of the money you got from selling the company? Also, who paid for YOUR houses when you got married? Were those houses any cheaper than this old house? Did you take care of your parents for a single day when they were alive? How dare you come here to ask for a share of the old house?\"\"Stop it! Your father only did what he wanted to do. The company belonged to my father, and we all have shares. He can’t decide for us. And surely, we can spend the money of the company,\" Uncle Han Lei said brazenly.\"That’s true. Your father was a dictator, and we are only getting our own money back. It does not matter what you say. Give the money or sell the house, otherwise we’ll see you in court. You will lose the case wherever we go,\" Aunt Han Yumei shouted.\"It’s all your dad's fault … \" They started to accuse Han Sen’s late father.Han Sen was shaking with anger and felt wronged for his father. When his father took over the company, it was only a small business, worth one or two million. He spent so much effort for the company to bloom and had to look after his family and make up for their mistakes. A few times the company was on the brink of bankruptcy due to liquidity problems. And he even died for the company. After his death, however, his wife and children were bullied by the relatives that he used to help.When Han Sen's father was alive, he always said that they were family and there’s no need to argue. And what an irony it has become now!If they truly needed the money and had difficulties, Han Sen would just agree to give it. But all the private aircrafts they piloted here were worth more than a million. And they at least got ten million from selling the company, which all fell into their pockets, and nothing was given to Han Sen’s family. It was simply impossible that they didn’t even have a million.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 5": "📕WuxiaClick🌙Home/Super God GeneCH 5Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayAfter making a fuss at Han Sen’s home, Han Yumei and Han Lei gave his family an ultimatum—they had to come up with the money or sell the house in one month, otherwise they would file a lawsuit.\"I’m so useless that I can’t even keep the house.\" Luo Sulan held Han Yan, her face covered with tears.Luo Sulan was a gentle lady. When Han Sen's father was still alive, she was treated like a princess. She didn’t even know how to sweep the floor, let alone do other chores. Han Sen knew how difficult it was for her to raise his sister and him after his father passed away.\"Don’t worry, Mom. I am here even though Dad isn’t. I will not let them take away our house. You take a rest and I’ll consult Uncle Zhang on the matter.\" Han Sen called a friend of his father’s, Mr. Zhang. He was the lawyer who used to work in their family business as legal counsel.\"Hi, Uncle Zhang? This is Sen ... Is your back any better? I have a legal matter that I want to ask you about ... so ... \" Han Sen looked a little pale when he hung up.He had confirmed that his relative told the truth—they do have rights to a part of the house. And if they really did go to court, the verdict would be close to what they’ve asked for—to either pay them money or sell the house.\"Sen, what did Mr. Zhang say?\" Luo Sulan asked Han Sen, looking at him nervously.\"Don’t you worry, Mom. I have checked with Uncle Zhang and there is a solution. You just make sure Yan is okay, and I’ll take care of this. The house will not be taken away by anyone,\" Han Sen said with a smile.\"That's good ... that's great … \" Luo Sulan breathed a sigh of relief.Having rested at home for a night, Han Sen took a train to the teleport station and entered God’s Sanctuary in the morning.Han Sen was teleported to his room at the Steel Armor Shelter. When one was teleported into God’s Sanctuary, one would appear in a certain room only accessible to him or her. Unless permitted by the owner, others were not able to enter the room.Before finishing the first evolution and entering Second God’s Sanctuary, this was Han Sen’s home in God’s Sanctuary.Now Han Sen had no power or influence. The only solution was to come up with two million dollars in a month if he wanted to keep the house.Although he felt it was unfair, without power, there was nothing left to do.Two million Levo dollars was an enormous amount for a young man who just finished integrated compulsory education.In the past, Han Sen couldn’t have earned two million in a year, let alone in a month. But now everything was different. In fact, if he had not already cooked the shell of the sacred-blood black beetle, the shell alone would be worth one or two million.Even without the shell, he still had the black crystal that could make creatures evolve. As long as he had that, two million was nothing.Looking at the body of the primitive green-scaled beast on the ground, Han Sen hesitated for a moment before cutting the body into pieces. He then dried the meat, made it into beef jerky and carried it with him in his waist pack.He must first catch a creature before he could use the crystal to make it evolve and trade the flesh of the evolved creature for money. Now that Han Sen owned a suit of sacred-blood-beast soul armor, he could up his game and start to hunt primitive creatures instead of ordinary creatures.Primitive creatures weren’t worth much, and he would waste a day’s time waiting for an ordinary creature to evolve into a primitive one. To come up with two million, Han Sen would need to sell at least a mutant creature.Primitive creatures were usually seen a dozen kilometers from Steel Armor Shelter. Han Sen had not dared to go that far before, but now he his had his armor.This time, his goal was no longer a copper toothed beast, the weakest among all primitive creatures, but the swift mantis often spotted in Zephyr Valley.Although a primitive creature, a swift mantis had a fragile body and could easily be killed by a normal alloy dagger if stabbed in a vulnerable spot. However, a swift mantis was so fast that ordinary people couldn’t keep up with it. And its pair of hacksaw-like forelegs could easily split human bones. Once hit by the forelegs, a person would be crippled, if not killed. So few humans would go to hunt this creature.For Han Sen, however, the swift mantis was the best option. It was in the end only a primitive creature, and there was no way it could cut open his sacred-blood-beast soul armor. If he couldn’t be hurt by the mantis, surely he could kill it.The most important thing was that with claws and wings cut off, a swift mantis could no longer fight back but could still live. This way, Han Sen could easily take it back, keep it in his room, and use the black crystal to make it evolve into a mutant creature before he sold its flesh.Of course, if he were able kill a few swift mantises and got lucky, he might even gain a beast soul.The beast soul of a swift mantis was in the shape of a swift jagged blade, which was a long dagger, a type of weapon Han Sen had mastered.Although the swift jagged blade was only a primitive beast soul weapon, it was the sharpest of all primitive weapons, and could even compare to some mutant beast soul weapons.Because of the danger of hunting swift mantises, few would go to Zephyr Valley, and even fewer had obtained a swift jagged blade. If the rare weapon were to be sold, it would cost more than two million. So, if Han Sen could score a beast soul of a swift mantis, there would be no need to sell mutant creature flesh any more.The closer Han Sen got to Zephyr Valley, the fewer people he could see. Around the valley, there was no human activity at all.Han Sen did not dare to go too deep, so he found a hidden place and summoned the sacred-blood black beetle beast soul to cover himself in the golden armor. Taking a deep breath, he sneaked towards Zephyr Valley.Han Sen did not dare to go too fast. The valley was covered with trees and wild grass as tall as a man. As the trees and grass swung with the wind, it was difficult to spot any swift mantis that might be hiding there. Even momentary carelessness could lead to broken bones from a mantis attack.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 6": "📕WuxiaClick🌙Home/Super God GeneCH 6Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlaySuddenly, Han Sen saw something green, about a foot-long, sticking to the grass like a leaf. If he didn’t look closely, he would’ve thought it was part of the grass and would have never imagined it to be a swift mantis that could split a human skull with a single blow.Its pair of sickle-like, jagged forelegs were even longer than its body. Dark green in color, the forelegs were covered in a metal sheen, and were nothing like its fragile body. The rigidity of the forelegs was definitely comparable to the most advanced alpha alloy.Han Sen was lucky that he found the swift mantis before it saw him. Moving towards it, he calculated the nearest he could get to it before being noticed by the swift mantis.When he was about six feet away from the swift mantis, Han Sen did not dare to go any farther, fearing he might lose the opportunity to attack by stealth.Tightly holding the dagger in his hand, Han Sen rushed out from the grass and cut at the swift mantis’ waist in a fast and ruthless strike.But Han Sen had still underestimated the speed and responsiveness of the swift mantis. It had noticed his presence the moment he rushed out. All of a sudden, it rose into the air, gliding with wings spread towards Han Sen in a truly swift move. Its forelegs had cut him in the head before he could even react.Han Sen subconsciously stepped back in shock, yet the mantis foreleg still hit his head. With a sound of metal clashing, Han Sen felt only slight discomfort, as if his head were hit by a stone. And there was not even a scratch on the sacred-blood-beast soul armor.Filled with ecstasy, Han Sen seized the opportunity to cut into the slim waist of the swift mantis in front of him with a fierce stab. The swift mantis was cut into two halves, green mantis blood splashing him wet all over.Han Sen didn’t care at all and listened to the strange voice in his head blissfully.\"Primitive creature swift mantis killed. No beast soul gained. Eat the swift mantis to gain zero to ten primitive geno points randomly.\"Touching his helmet where the swift mantis cut to feel it was still smooth, Han Sen thought to himself in excitement, \"Ha-ha, the armor is everything! With my armor, I could kill whatever I want to kill and no one could ever hurt me. I wouldn’t even fear mutant creatures.\"Han Sen suddenly gained courage and stopped hiding. He marched to Zephyr Valley and alerted several swift mantises to attack, but they couldn’t hurt him at all by cutting his armor. Han Sen took the opportunity to kill them all, each with one stab.\"Primitive creature swift mantis killed. No beast soul gained. Eat the swift mantis to gain zero to ten points randomly.\"\"Primitive creature swift mantis killed ...\"The voice continuously sounded in his mind, adding to his thrill. He stabbed his way through the valley and killed more 20 mantises in succession....Su Xiaoqiao was on his way to Zephyr Valley as well, quietly mulling over his own bad luck.His parents were the owners of an interstellar conglomerate and were considered both distinguished and aristocrats. He, however, was randomly assigned to Steel Armor Shelter, where he had no friends or even acquaintances.To get an aristocratic title, Su Xiaoqiao could only choose to follow Qin Xuan in order to max out on mutant geno points and become an evolver.There were two types of titles in Levo Interstellar Alliance. One was \"distinguished\"—once one became a surpasser, one could be certified as distinguished. The other was an \"aristocratic.\" If one could evolve with 100 mutant or more advanced geno points, one could be certified as an aristocrat.Either title involved a lot of benefits in the Alliance, and most importantly they were a symbol of social status. Today in the Alliance, people were more and more snobby. People from the upper class wouldn’t even talk to someone without a title, even when doing business.Advanced titles like sacred-blood aristocrat were beyond Su Xiaoqiao’s dreams. All he wanted was to gain the title of ordinary aristocrat by maxing out on mutant geno points and completing an evolution.However, to get 100 mutant geno points was still too difficult for him on his own. He did bring a lot of money to Steel Armor Shelter, but money could only buy ordinary and primitive creature flesh, as very few people would sell mutant creatures. Only people who aimed to max out on sacred geno points like Qin Xuan would sometimes sell the mutant creature flesh they had. However, it wasn’t money that she wanted, but loyalty and service.Su Xiaoqiao was now running errands for Qin Xuan, exploring the places less known to people and looking for traces of sacred-blood and mutant creatures to gather information for her. With the information, she could then gather a team to hunt down these creatures, and the team members would get mutant creature flesh in return.Su Xiaoqiao had been exploring for a month and found no traces of mutant creatures, not to mention sacred-blood ones. Running out of supplies, he had to return to Steel Armor Shelter. When he passed Zephyr Valley, he thought there might be mutant creatures around, as the area was so sparsely populated.After he sneaked in the valley, he felt something strange.He didn’t see any swift mantises, not even one. A mile into the valley, all he saw were some messy traces on the ground.\"Someone must have wiped out the swift mantises. Fist Guy or Son of Heaven? No. Although there are signs of fighting, there should be more damage if it were a group of people ... \"Surprised, Su Xiaoqiao sped into the valley, wondering what had happened.As he expected, there were many green blood stains from swift mantises along the way. He followed the blood stains and turned a corner. What he saw stopped him in his tracks, appalled.Next to the piled bodies of swift mantises stood a golden figure. In the sun, the figure looked like a robot in gold cast armor.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 7": "📕WuxiaClick🌙Home/Super God GeneCH 7Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"Brother, you killed all these swift mantises?\" Su Xiaoqiao saw no one except for the guy in golden armor.The dead mantises were still bleeding, so they couldn’t have been dead for long. Su Xiaoqiao couldn’t believe that someone was able to kill so many mantises in such a short amount of time.Although the swift mantis was only a primitive creature, considering the sharpness of its forelegs and its speed, even those who had maxed out on primitive geno points didn’t dare to provoke it.After all, there were too many weak spots on human body, and no one wanted to risk losing his life or getting severely injured from a mantis cut.There were at least three dozen dead swift mantises on the ground. Even Qin Xuan would need some helping hands to achieve this. Su Xiaoqiao wouldn’t believe that someone could have done it alone.\"Want some? A thousand Levo dollars each.\" Han Sen was just considering what to do with the mantises. He was on a killing spree and forgot the fact that there was no way he could eat so much mantis meat. And even if he could eat them all, only the first few could gain him geno points.\"A thousand each? Are you sure?\" Su Xiaoqiao looked at him, surprised. Although many people were able to hunt primitive creatures, they were in short supply, especially the ones that most people had never eaten, like swift mantis.After all, people's energy was limited, and there was a limit to how many geno points the meat from the same type of creature could offer. Only by eating the flesh of a variety of creatures could one keep collecting geno points.Those who were relatively well-off would all be willing to pay for the creatures they hadn’t eaten yet in order to be able to quickly max out on their primitive geno points.Therefore, the primitive creatures that were easy to kill could bring a few hundred each, while the ones that were difficult to hunt, such as the swift mantis, could sell for two or three thousand each and still be in short supply.Su Xiaoqiao calculated and figured that he could double or triple the price if he could transport these mantis bodies back.\"Yes, a thousand Levo dollars each.\" Han Sen nodded.It wasn’t that Han Sen did not know what the mantises were worth. Without a car or other tools, there was simply no way he could move all these bodies back on his own.And if he left now, the bodies might be stolen when he returned.Moreover, Han Sen did not want to waste his time and energy on this. He had more important things to do, and he could take some loss of the profits—as the wholesaler, he had to leave some profit to the retailer.\"Sure, I’ll take them all. How many are there?\" Su Xiaoqiao was onboard. The swift mantises could bring him more than money.Primitive creatures like the swift mantis that ordinary people couldn’t easily access would make great gifts. No one could refuse such a nice offer, as long as they hadn’t maxed out on primitive geno points.\"A total of forty-three. I’ll give you a discount and charge only forty thousand.\" Han Sen was just casually asking and did not expect this ordinary-looking guy to be so rich that he could buy them all.Su Xiaoqiao took out his wallet and pulled out ten ten-thousand-dollar notes. \"Brother, I’ll give you fifty thousand for these mantises. The other fifty thousand is a down payment for whatever good stuff you may have in the future. I’ll always give you a good price and would pay even higher for mutant creature flesh.\"A hundred thousand was a small amount for Su Xiaoqiao. It would even cost him as much to buy someone a fancy dinner. This person was so bad-ass that he killed all these mantises on his own, so it was highly likely that he could hunt mutant creatures too. If it was possible to purchase mutant creature flesh from him, a few hundred million was nothing.\"Couldn’t tell you were rich,\" Han Sen took the money and said bluntly, looking at Xiaoqiao slightly surprised.\"In all honesty, money is all I have. If you have mutant creature flesh to sell, do let me know. The price is definitely not a problem,\" Su Xiaoqiao boasted, afraid that he might lose this great opportunity.\"Great. What’s your name and address? I will come and find you if I have something.\" Han Sen appreciated Xiaoqiao’s generosity, and thought he might be an ideal buyer for the mutant creature he planned to produce using the black crystal.After all, the black crystal had to remain a secret. Selling the creature to one person was much better than selling it in the market in front of everyone.And he didn’t even need to worry about the price since Xiaoqiao was incredibly rich.\"Brother, my name is Su Xiaoqiao, and that’s my real name. My room number at Steel Armor Shelter is 1046. How about you? What’s your name and where do you live?\" Su Xiaoqiao said.\"Dollar. That’s the only thing I care about. Prepare some money, and I’ll go to room 1046 once I have something.\" Han Sen put the money into his pocket, waved goodbye to Xiaoqiao and left Zephyr Valley.Having been through his father’s death, Han Sen did not want to have too many exchanges with others. He just wanted to take care of his mother and sister and do his own thing. Other people or things didn’t really affect him.\"Brother, I’ll wait for you. You must come! Remember, the price is definitely not a problem...\" Su Xiaoqiao shouted at the back of Han Sen while waving his hand.After Han Sen left, Su Xiaoqiao couldn’t help but call out: \"How could I get these back?\"Su Xiaoqiao thought for a while and decided to carry some back in a bag and ask some friends to help him carry the rest.Fortunately, there were almost no humans in Zeohyr Valley. When Su Xiaoqiao came back with friends, all the bodies were still there.\"Xiaoqiao, is it true that Dollar killed all these swift mantises?\" Su Xiaoqiao’s friends looked wide-eyed at the pile of mantis bodies.\"Of course. Although I did not see him hunting, there was no one else in Zephyr Valley at the time and the mantises had just died. Who else could it be?\" Su Xiaoqiao said.\"I think it must be a gang of people that killed these swift mantises, and others must have left him to deal with the bodies. I don’t believe one person could kill so many mantises. He must be bragging! \"\"He was definitely bragging.\"None of Su Xiaoqiao’s friends believed Han Sen killed the swift mantises alone.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 8": "📕WuxiaClick🌙Home/Super God GeneCH 8Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen didn’t go back to Steel Armor Shelter after leaving Zephyr Valley. In a flash, he killed every swift mantis in a frenzy so that there were none left.\"Well, I’ll just go hunt a copper-toothed beast. There are plenty of them near Steel Armor Shelter and there is a high chance of catching a mutant copper toothed beast, so it wouldn’t seem too suspicious if I were to produce a mutant one using the crystal.\" Han Sen found a habitat of copper-toothed beasts and wanted to catch one that was alone.Only able to find a small group of copper-toothed beasts, Han Sen went ahead and killed all of them but one, taking advantage of his tough armor.\"Primitive creature copper-toothed beast killed. No beast soul gained. Eat the flesh of copper-toothed beast to gain zero to ten primitive geno points randomly.\"\"Primitive creature copper-toothed beast killed. Primitive beast soul of copper-toothed beast gained. Eat the flesh of copper-toothed beast to gain zero to ten primitive geno points randomly.\"Han Sen’s eyes widened in surprise. The forty-three swift mantises and thousands of ordinary creatures he had killed didn’t render a single beast soul. Now he had killed only two copper-toothed beasts and gained a beast soul!\"To get a beast soul requires pure luck.\" Han Sen was filled with joy. Although it was common, the beast soul of a copper-toothed beast was quite nice to have.The copper-toothed beast was one of the weakest among all primitive creatures, but its beast soul was popular. Han Sen summoned the new beast soul, and a porcupine-like shadow with bronze fangs shifted into a bronze crescent spear in his hand.The crescent spear had a bronzy sheen and a menacing look with its crescent-shaped spear head.Type of primitive beast soul of copper-toothed beast: Weapon.Han Sen played with the spear for a while, looking quite fierce. He was taught basic spear skills at school. Han Sen was interested in all kinds of weapons, so he learned well.Han Sen put away his spear before he grabbed the living copper-toothed beast and went back. On his way back, he found a lonely spot to remove his armor. Looking like himself again, Han Sen went back to Steel Armor Shelter, carrying the knocked-out and tied-up copper-toothed beast on his shoulder.At the gate of the shelter, a gang of about a dozen people were marching out, all riding on different tall beast soul mounts, headed by a man wearing steel armor and carrying a blood-red sword on his back. The man was riding a triceratops-like beast soul mount, looking mighty and majestic, attracting envious glances from all around.In Steel Armor Shelter, there are three outstanding persons who aimed to complete evolution by maxing out on sacred geno points. This man, Son of Heaven, was one of them. Han Sen didn’t know his real name and identity, but he was definitely a king in Steel Armor Shelter.Carrying the copper-toothed beast, Han Sen stepped aside to let the gang pass. However, Son of Heaven stopped his mount when passing by him.Crack!Son of Heaven looked at Han Sen and slashed him on the shoulder with a leather whip. The copper-toothed beast fell on the ground, and Han Sen’s clothes were ripped apart. A wound started to swell on his shoulder and back.\"Who had the nerve to sell you this primitive creature?\" Son of Heaven asked in a cold tone, looking down at him condescendingly.In Steel Armor Shelter, everyone knew that Son of Heaven was wooing Qin Xuan. Ass Freak who stabbed Qin Xuan in the rear naturally became his enemy. He was also one of the reasons why Han Sen was miserable.When learning Qin Xuan was stabbed, Son of Heaven not only had Han Sen beaten up but also let everyone know that whoever would dare to do business with Han would become his enemy for life.\"I hunted it myself.\" Han Sen stared back coldly, fist clenched but standing still.Not only had Son of Heaven gained a lot of geno points, but he also had collected many beast souls. Since he had help from his gang, Han Sen wouldn’t be able to touch the guy even with his best effort. Even with his sacred-blood armor, he would be beaten to death before he approached Son of Heaven.God’s Sanctuary was different from the Alliance in that there was no law at all. Power was everything. Han Sen would only die in vain. Plus, Son of Heaven was said to be of prominent origin in the Alliance. Even if Han Sen were killed by him in the Alliance, Son of Heaven might not be subject to legal sanctions.Han Sen was not afraid of death. But if he died, what about his mother and sister?\"If I find out that someone dares to sell to you, I’ll make sure you both die in pain.\" Son of Heaven looked around and rode away.\"Ass Freak, don’t make trouble. Or else I don’t mind teaching you another lesson,\" Luo Tianyang smirked at Han Sen before following the gang on a black wildebeest.Luo Tianyang, a henchman and old acquaintance in the Alliance of Son of Heaven, was one of the those whom he sent to beat Han Sen up.Han Sen watched the gang going away with fire burning in his eyes. He picked up the copper-toothed beast quietly and walked towards Steel Armor Shelter, with everyone watching him with derision.\"Stronger, I need to become stronger.\" With scorching anger in his chest, Han Sen knew he was far too weak to fight the gang on his own.The black crystal, however, was his biggest opportunity.\"Son of Heaven, just get rid of him for good,\" Luo Tianyang said coldly.Son of Heaven smiled and said, \"Qin Xuan is a stubborn girl. She doesn’t like people to intervene in her business. Since she did not kill Han Sen, she might be upset if I did.\"\"What an unwise woman!\" another henchman of Son of Heaven, Peerless Sword, said. \"It’s her honor that you, bro, would chase her, while she just puts on airs. If it weren’t for you, I would have killed her already.\"\"Don’t put Qin Xuan down. She is quite something in both God’s Sanctuary and the Alliance. If she becomes mine, it will be a huge advantage to me.\" Son of Heaven said grimly, \"End of discussion. We need to get to Sunset Slope before Fist Guy’s gang. That sacred-blood creature has to be ours!\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 9": "📕WuxiaClick🌙Home/Super God GeneCH 9Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen returned to his room, tied the copper-toothed beast to a cage and put the black crystal in front of it. The beast gobbled up the black crystal greedily.After an entire day, Han Sen noticed some changes to the copper-toothed beast. Its fur had been gray-black like a wild boar, and its fangs had been bronze. Now its fur also started to show a bit of bronze luster, and the fangs had become brighter in color.However, this was not a true mutant copper-toothed beast, which ought to look like a bronze statue. Although this one did show some show some bronze luster, it was still quite different from a mutant one.\"It seems that the evolution from a primitive creature to a mutant creature is a more complex process than from ordinary to primitive, so it requires more time than one day,\" Han Sen pondered.After more than two days, its bronze color thickened, but the copper-toothed beast still didn’t look like it was going to evolve anytime soon.Han Sen had to let the beast evolve at its own pace, and go kill some primitive creatures for money. Plus, he could also use some primitive geno points.Even if one didn’t choose to use the primitive geno points to complete evolution, the more primitive geno points one gained, the stronger the body would become. And the same went for ordinary and mutant geno points.If one could max out on ordinary, primitive and mutant geno points, one’s physical conditions would still be far beyond the average level, even without evolution.With the black cystal, it wouldn’t be difficult for Han Sen to max out on all four types of geno points. At the moment, he wanted to max out on the other three before he focused on sacred geno points.Han Sen left his room and walked into the shelter, feeling slightly different: today the streets seemed to be a lot less crowded than usual.\"What’s going on?\" Han Sen walked past the plaza and found fewer stalls there than usual as well. People there were all whispering something to each other.Han Sen listened for a while and started to figure out what had happened.A few days ago, someone had spotted a new sacred-blood creature near the Sunset Slope. Somehow the three gangs in Steel Armor Shelter all found out about it and gathered at the slope, but the outcome was terrible: the sacred-blood creature ran free while a lot of men were killed.Today, Qin Xuan, Son of Heaven and Fist Guy had reached an agreement to hunt the sacred-blood creature together. They also recruited a lot of lone wolves and smaller groups, forming the largest campaign in Steel Armor Shelter in recent years. The three gangs were determined to kill this creature.Han Sen suddenly had an idea, so he turned around and ran out of the city. When there was no one around, he summoned the black-beetle beast soul and covered himself in armor. After running for two hours, he came to a stone hill west of Sunset Slope.Having finally climbed to the top of the hill, Han Sen took a look in the direction of Sunset Slope. Among thousands of people fighting and yelling, there was a monster with the head of a cow, the upper body of a human and the lower body of a horse. It was holding a double-edged golden axe and pushing its way through the crowd. No one could withstand the fierce blow of its axe.Han Sen happened to see the monster swinging the axe at Son of Heaven. who even had his blood-red sword, Son of Heaven did not dare to block the axe. He stepped on his own mount and leaped back a few feet.Roar!The monster's double-edged axe hit the triceratops-like beast soul mount and split it in two halves. That broke Son of Heaven’s heart. A mutant beast soul mount was very rare, with the same value as a small interstellar spaceship.\"How is this sacred-blood creature so strong?\" Han Sen was shocked.The sacred-blood creature ran and killed thousands of people in a flash, and no one was able to fight back. Even people as strong as Qin Xuan, Son of Heaven and Fist Guy didn’t dare to engage in a frontal attack. Hit by all sorts of alloy arrows and beast soul arrows, the monster still didn’t even get a scratch. When it swung the axe, no one could get close.Such a mighty creature corresponded to Han Sen’s impression of a sacred-blood creature. The sacred-blood black beetle he killed was way too weak compared to this monster. It was only a little stronger than an ordinary black beetle and didn’t even feel like a sacred-blood creature.People were expecting to trap the sacred-blood creature, but now a key buffer was lost as the mount of Son of Heaven was killed. The sacred-blood creature was charging madly, waving the golden double-edged axe and leaving screams, blood, and limbs behind. It took it only moments to rush out of the siege to the mountain.At the foot of the mountain, it even smugly turned around and stood on its back legs, mooing like a cow before it ran into the mountain.\"F*#k! It wants to escape!\" Son of Heaven furiously summoned a green eagle-shaped beast soul, which turned into a green iron bow in his hand. Then he summoned a fiery beast soul in the shape of a giant six-winged wasp as his arrow.Seeing the arrow, Qin Xuan and Fist Guy exclaimed, \"A sacred-blood beast soul of a six-winged wasp!\"They had joined force with Son of Heaven in hunting the sacred-blood six-winged wasp. Son of Heaven was the one who had launched the final blow. They just didn’t expect him to be so lucky to have gained its beast soul.There were less than ten beast souls known to people in the entire Steel Armor Shelter, and many were left by those who already had evolved and gone to Second God’s Sanctuary.\"Son of Heaven, stop! It’s a beast soul that can only be used once. If you failed to kill it…\" Luo Tianyang wanted to stop him, but it was too late.Son of Heaven had already shot the sacred-blood beast soul arrow with a full draw. The arrow turned into a red lightning bolt flying towards the sacred-blood creature.Bang!The sacred-blood creature felt the imminent danger and turned around. The wasp arrow shot into its chest and exploded, bursting open its flesh. The monster fell to the ground, losing its vitality as its internal organs and blood sprayed out.\"How dare you kill my mount? There is no way I’d let you live after doing that,\" Son of Heaven yelled loftily, standing like a king, leaving everyone in shock.While proud to see the crowd being impressed, including Qin Xuan, Son of Heaven suddenly saw a green shadow shooting down from the sky into the dying sacred-blood creature and ended its life.A golden figure immediately rushed down from the stone hill nearby and approached the sacred-blood creature. Lifting the golden double-edged axe to his shoulder, the mysterious figure ran towards the mountain in a flash.\"Dollar!\" Su Xiaoqiao recognized Han Sen’s unique golden armor in no time and called out loud.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 10": "📕WuxiaClick🌙Home/Super God GeneCH 10Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen was hiding on the stone hill when the sacred-blood creature charged in his direction. As he was deciding whether to retreat, he saw Son of Heaven shoot down the sacred-blood creature.Anger surged and Han Sen rushed down the stone hill while summoning the bronze crescent spear. He shot the spear at the monster and hit it in the wounded chest, killing the dying creature.\"Sacred-blood bloody slayer killed. Sacred-blood beast soul bloody slayer gained. Eat the flesh of bloody slayer to gain zero to ten sacred geno points randomly.\"The voice in the back of his head brought him intense joy. He had just gained another sacred-blood beast soul! His luck was too good to believe.However, Han Sen did not have time to celebrate. The body of the bloody slayer was too large for him to take away, but what he could take away was the giant golden axe.The creatures in God’s Sanctuary could produce certain treasures through special means. People called these treasures \"gears\". Although gears were just like solid items and could not be summoned like beast souls, they could perform as well as beast souls if they were produced by advanced creatures.The bloody slayer was peerless when holding the golden axe, and the axe could easily break normal beast soul weapons and beast soul mounts, so it proved to be an excellent sacred-blood gear.Han Sen's goal was to get the golden axe, and the beast soul of bloody slayer was completely unexpected loot.Watching Han Sen running on the mountain with the golden axe, everyone was stunned.\"Motherf*#ker!\" Son of Heaven let out a raging roar when he realized what had happened. With a black wildebeest summoned as his mount, he rode madly in Han Sen’s direction. Behind him, his gang all raced off on their own mounts to chase Han Sen, roaring and rebuking him.Han Sen did not expect the golden axe to be so terribly heavy. With eight sacred geno points, he was already lot stronger than before, yet he could still barely walk with the axe, not to mention run.\"The bloody slayer made it seem so light! How could I run off with such a heavy weapon?\" Hansen looked back and could already see Son of Heaven and his gang only half a mile from him.Although it was too heavy to carry, Han Sen would never leave behind such an excellent sacred-blood gear. He suddenly thought of his newly gained beast soul of the bloody slayer, took a look at it and suddenly cheered up.Type of sacred-blood bloody slayer’s beast soul: Shapeshifting.Without thinking, Han Sen summoned the beast soul of bloody slayer and a majestic shadow galloped out, looking just like the monster, only missing the giant axe.The beast soul ran towards Han Sen and was instantly integrated with him. His body was transformed into a bloody slayer and the black-beetle armor changed its shape accordingly, still fully covering Han Sen's body as a bloody slayer.After all, beast soul armor was not as rigid as man-made ones and could change according to the shape of the body.After shapeshifting, Han Sen felt so energetic that the golden axe was now nothing to him. Running with four hoofs, he also became incredibly fast.Han Sen surged up the mountain at full speed and disappeared, far outpacing the gang.Everyone was speechless, as everything happened so fast. Many smirked as they watched Son of Heaven and others who were still chasing Han Sen.\"S*#t! Who was that guy? He’s got some nerve jumping into the boiling pot! And what loot! In addition to the golden axe, he gained a sacred-blood beast soul! Can you imagine how much it must be worth?\"\"You think you could buy a sacred-blood beast soul just with money?\"\"Ha-ha, Son of Heaven must be so mad. A sacred-blood beast soul! It would have been his but was taken away.\"\"The arrow he used seemed like a one-off sacred-blood beast soul. And what did he get in return for such investment… LOL…\"\"I’m just afraid Son of Heaven will lose his mind.\"\"Didn’t expect there to be a sacred-blood beast soul! How lucky that guy is! He could never have killed the monster alone. And a dozen sacred-blood creatures may not even render a single beast soul. It just happened that he gained everything with the last hit.\"\"Who was that guy indeed? Is there such a person in Steel Armor Shelter?\"\"I heard someone call him Doll, but not sure.\"\"Doll! Interesting name.\"After less than an hour, Son of Heaven returned gloomily with his gang, but people already knew it was impossible to find someone on the winding mountain trails.Son of Heaven immediately questioned Su Xiaoqiao when he got back. His exclamation \"Dollar\" had been a mistake.Su Xiaoqiao had no choice but to tell him everything about how he met Han Sen, which wasn’t very helpful since all he had was a name, Dollar.Son of Heaven didn’t fully believe him, but couldn’t do much as Su Xiaoqiao was in Qin Xuan’s gang. He bitterly led his gang back to Steel Armor Shelter and locked down the shelter, swearing to find Dollar and cut him into pieces.Most people did not learn the name Dollar, while \"Doll\" became popular. For a while, Doll, Son of Heaven, sacred-blood creature, and sacred-blood beast soul became the most popular topics in Steel Armor Shelter.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 11": "📕WuxiaClick🌙Home/Super God GeneCH 11Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen was digging a pit at the foot of the mountain, planning to bury the giant golden axe there.Although he escaped the manhunt of Son of Heaven by shapeshifting into the blood slayer, there was a limit to how long he could shapeshift.As one of the most powerful beast soul types, shapeshifting beast souls could directly impart significant changes to a human body, which could be unbearable for those with weak genes.The stronger the creature one wanted to shapeshift into, the more geno points and bodies were needed.In general, for primitive beast souls, the number of minutes the body could withstand the shapeshifting was equal to the number of primitive geno points gained. In addition, one mutant geno point could support ten minutes of shapeshifting with primitive beast souls; and in turn, ten primitive geno points could support one minute of shapeshifting with mutant beast souls.Now Han Sen had eight sacred geno points, which could last him only eight minutes for shapeshifting as a blood slayer. Even counting the ordinary, primitive and mutant genes he had gained altogether, he could shapeshift for less than ten minutes.It was enough for escaping, but if he were to fight a gang of people, he could only kill one or two before his time was up.No one could see a sacred-blood beast soul if it wasn’t summoned, yet the golden axe could not be turned invisible. The person he mainly had offended was Son of Heaven, yet the campaign was a joint one, and the axe should’ve been the mutual gain of all three gangs. Hence, Han Sen had pissed off all of them and could only bury the axe in that spot for the time being.\"If I could sell the giant golden axe, it should easily bring at least two million.\" Han Sen was still excited after burying the axe.A sacred-blood gear was not as valuable as a sacred-blood beast soul, but still considered almost priceless. If he could sell it, two million would be a small amount.As for the sacred-blood beast soul, Han Sen had not even thought of selling. This was the bedrock of his survival and success in God’s Sanctuary, and it would be like kiling the goose that lays the golden egg if he were to sell it.Returning to Steel Armor Shelter, he saw Luo Tianyang guarding the gate with others. Everyone who tried to enter the shelter was interrogated.\"Can you even see what beast souls I have?\" Han Sen had no fear as he had already buried the golden axe.A young man at the gate stopped him and wanted to do a body search on him, while Luo Tianyang said, \"Why waste any time on that scumbag. How is it even possible that he would be Dollar?\"F*#k off.\" The young man pushed Han Sen away and turned to search other people.Han Sen looked at Luo Tianyang with a sneer and went into the shelter.Everyone in the street was talking about what had happened at Sunset Slope. Listening to people calling him Doll, Han Sen thought, \"Damn Su Xiaoqiao. Who told you to call me Doll?\" He was happy to know that Son of Heaven was furious and strode back to his room.In another room, Su Xiaoqiao stood in front of Qin Xuan, almost in tears. \"Xuan, you need to believe me. I’ve told you everything I know. I really did not know Dollar, but only saw him once in Zephyr Valley and bought some swift mantises from him, which I gave to my bros as gifts. Just ask around if you don’t believe me. They even helped carry the mantises back from the valley.\"I am not blaming you. I just want you to contact Dollar, tell him I am willing to buy his sacred-blood beast soul and gear, and ask him how much he wants,\" Qin Xuan said quietly.\"But I really do not know where he is!\" Su Xiaoqiao said sadly.\"Then go find him. Don’t let anyone know about this and go look for him secretly. If you manage the task, I’ll reward you.\" Qin Xuan showed Su Xiaoqiao out after she gave the order, not waiting for his reply.After he left, Qin Xuan frowned to herself, \"Who could Dollar be? Is he someone in Fist Guy’s gang? Or was the whole thing orchestrated by Son of Heaven? If he really is on his own, can I get him on my side? If I can’t, it would also be nice to purchase the sacred-blood beast soul and gear.\"Almost at the same time, Fist Guy sent his men to look for Dollar in secret, trying to buy the sacred-blood beast soul and gear from him.Although it was a joint action, the only one who suffered a loss was Son of Heaven.If it had not been for his sacred-blood wasp arrow, the bloody slayer would have run away and there would have been nothing for Qin Xuan and Fist Guy. Now they could share some flesh of the bloody slayer, so it had gone well for them.However, Son of Heaven lost a mutant beast soul mount and a sacred-blood wasp arrow, while being robbed of the sacred-blood beast soul and gear. Anyone in his place would have been exasperated.The entire Steel Armor Shelter was looking for Dollar, yet no one connected him to Ass Freak.Son of Heaven also put a price on his head, and even offered to pay a reward for any substantive information. The price was so good that even Han Sen wanted to offer himself for the reward.\"Primitive green-scaled beast flesh eaten. One primitive geno point gained.\"Han Sen squatted in the bushes, watching a deep pond near him while chewing meat jerky made from the green-scaled beast.Up until this point, he had gained 91 ordinary geno points, 26 primitive geno points, zero mutant geno points and eight sacred geno points.The copper-toothed beast was still slowly evolving, so Han Sen could only go out to hunt some primitive creatures, hoping to gain more primitive geno points.Because the black beetle armor would draw too much attention, he could only go deep into the mountains where nobody goes, fearing that Son of Heaven would know where he was.Fortunately, God’s Sanctuary was so vast that there were many places where humans had never set foot, so it was rather easy for Han Sen to disappear.While staring at the deep pond, Han Sen suddenly heard a distant voice of a man and immediately tensed up.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 12": "📕WuxiaClick🌙Home/Super God GeneCH 12Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlaySoon, Han Sen saw a young man walking towards the pond in ragged clothes. He was covered with cuts and bruises all over and looked extremely tired.\"Friend, there are iron-toothed crocodiles in the pool,\" Han Sen came out of the bushes and cried from afar. He meant well in warning the young man, but was also afraid that he might alert the crocodiles that he wanted to hunt.This young man looked very tired and seriously injured. If he drank from the pond without knowing the crocodiles were there, he could have gotten killed by the iron-toothed crocodiles hiding under the water.The young man saw Han Sen and became ecstatic. \"What is this place? And how do I get to Glory Shelter?\" he asked, staring at Han Sen.\"Glory Shelter?\" Han Sen hesitated, looking at the young man strangely. \"We are in Tekees Mountains north of Steel Armor Shelter, and I do not know where the Glory Shelter you mentioned is.\"\"I have come so far that I’m now in the territory of another shelter?\" the young man whispered to himself, looked up at Han Sen, and said with an almost commanding tone. \"Take me to the shelter.\"Han Sen frowned, as the tone of the young man wasn’t very polite. Quietly he said, \"You go south from here. If you don’t walk too slowly, you can reach the shelter before dark. I have to hunt, so I can’t accompany you. \"Han Sen was preparing to go back into the grass, not expecting the young man to suddenly hit him in the back. Losing balance and falling to the ground, Han Sen knocked his head on a rock and started to bleed.\"What are you doing?\" Han Sen covered his wound and stood up, glaring at the young man.\"All I want is obedience, not bulls*#t. Take me to the shelter.\" The young man looked at Han Sen coldly.\"F*#k you.\" Han Sen summoned his bronze crescent spear and poked it at him.\"Rubbish basic spear skills taught in integrated compulsory education! Even though my beast souls were all ruined on the way here, scum like you can’t compare to me.\" The young man looked at Han Sen contemptuously, raised one palm and slashed it at Han Sen’s spear.The young man's hands looked nothing like hands of a man, but rather like they were sculpted out of a whole piece of white jade, giving off an incredible sheen.Crack!The beast soul spear was cut in half by his palm as easily as a steel knife cutting through wood.\"Hyper geno art!\" With only half of the spear in his hand, Han Sen was horrified.Science and technology were of no use in God’s Sanctuary, but ancient martial arts played an unexpectedly important role. With all the geno points gained, humans were able to perform some mythical ancient martial arts in the real world. Nonetheless, it wasn’t the so-called qi but the power of genes that powered the ancient martial arts. So, the more geno points gained, the more effective ancient martial arts would be.The research showed that ancient martial arts could stimulate and bring out the potential of genes, offering extraordinary power to mankind. A new type of martial arts was developed called \"hyper geno arts.\"Hyper geno arts were deeply rooted in ancient martial arts, full of mysteries that couldn’t be explained by science. Their practice methods were mostly monopolized by the upper class. The most advanced hyper geno arts were the least accessible.For those who graduated from a public school of integrated compulsory education like Han Sen, hyper geno arts were never an option. Only the advanced schools would teach basic hyper geno arts.If the process of gaining geno points was compared to turning mud into steel, then hyper geno arts could decide whether the steel was to be made into knives and guns or simply left as a piece of metal. Acquiring genes to make the body evolve was merely acquiring the material, while hyper geno arts taught one to use the material effectively.\"You know a lot for the scum you are.\" The young man looked at Han Sen indifferently. \"This is your last chance. Lead the way or die.\"Again, he raised the jade-like palm as if he was an executioner about to perform his duty. If Han Sen didn’t comply, he would cut his head off.\"Kiss my ass!\" Han Sen summoned the black beetle armor and covered himself, kicking the young man with a leg sweep.\"You asked for it.\" The young man’s face darkened, his jade-like palm chopping towards Han Sen’s leg.Clank!Han Sen’s leg was knocked away, and there was a white mark on the golden armor.The young man was also forced to step back from Han Sen’s kick. Surprised, he looked greedily at Han Sen’s armor. \"It didn’t break under my Jadeskin! Must be sacred-blood beast soul armor then! A scum like you having such a nice thing is just a gift sent from heaven. Hand over your armor and I’ll spare your life.\"Han Sen turned around and launched another kick in rage.The young man grabbed Han Sen’s leg and twisted it, wrestled him down and came down hard on his back with a knee.\"Ah!\" Han Sen uttered a scream, feeling his spine about to break.\"Scum is always scum, even with a sacred-blood beast soul.\" The young man (named Xue Longyan) continuously hit Han Sen on the back of head, knocking his head into a rock. He cried ferociously, \"Surrender the sacred-blood beast soul. It’s not meant for scum like you.\"\"Asshole!\" Han Sen’s blood was burning. He suddenly raised his head and butted Xue Longyan’s face with his helmet. Blood splashed from Xue Longyan’s nose. He covered his nose and backed off.Han Sen regained freedom and immediately summoned the bloody slayer. The moment he turned into the monstrous figure, he threw himself at Xue Longyan.Xue Longyan kept chopping at Han Sen, while Han Sen ignored all the attacks from his tough hands and held him down tightly, the cow-shaped head knocking on his head.\"Who is scum… who the f*#k is scum…\" Han Sen knocked madly on Xue Longyan’s head over and over again.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 13": "📕WuxiaClick🌙Home/Super God GeneCH 13Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayWhile Xue Longyan was struggling to kick Han Sen, the latter ignored him and rammed his face with the cow head. It didn’t take long before Xue Longyan’s body went limp. When Han Sen finally calmed down, he was already dead, with his face smashed in like a hunk of meat.With the body of a bloody slayer and sacred-blood beast soul armor, even those who practiced hyper geno arts couldn’t resist such brutal impact.Han Sen let go of the body, and Xue Longyan fell to the floor like a pool of mud.Having dismissed the beast souls, Han Sen felt a severe pain. It was hurting so much in a few spots that it felt like his bones were broken.Han Sen dreaded to think what could have happened. He was injured so badly, even with the shapeshifting and armor. Xue Longyan’s hyper geno art was really quite something.If he had the same beast souls, Han Sen wouldn’t be a match for him.Looking at the dead body, Han Sen hesitated and then searched the body. There was a wallet, with no cash but several crystal credit cards in it—deluxe ones with high credit lines. He also found a memory chip. After some thought, Han Sen destroyed the wallet and credit cards and threw them, along with the dead body, into the deep pond, while keeping the memory chip.Several iron-toothed crocodiles emerged from the water and snapped at the dead body. Soon even the bones were gone. Han Sen was relieved and turned away.Too injured to keep hunting, Han Sen returned to Steel Armor Shelter, enduring the pain.The gang of Son of Heaven were still looking for Dollar, and the bounty had been raised. Unfortunately, no one had any interaction with Han Sen, so no one would know Dollar was actually Ass Freak. People were still talking about Dollar on the streets.Han Sen went all the way back to his room and checked out the copper-toothed beast, which had turned bronze in most parts, although the shade was still lighter than a true mutant copper-toothed beast. It probably would take more time for the evolution to complete.Teleporting out of God’s Sanctuary, Han Sen went to see a doctor. Multiple fractures of the bone were diagnosed, and it took the doctor a long time to fix all of them.Fortunately, Han Sen still had the ten thousand he earned from Su Xiaoqiao, or else he wouldn’t even have been able to afford the medical bills.Back home from the hospital, Han Sen closed the door and inserted the memory chip into a smart gadget, trying to find out Xue Longyan’s identity.Able to cross the mountains and swamps to reach Steel Armor Shelter and having practiced a hyper geno art that looked very advanced, Xue Longyan would be very a formidable opponent if he still had his beast souls with him and had not been injured.The smart gadget displayed the contents of the memory chip and Han Sen only had to look for a while before he became wild with joy.\"Hyper geno arts… it’s a tutorial for hyper geno arts...\" Han Sen almost laughed out loud.The hologram stored in the chip was a naked woman making odd movements while reciting arcane incantations. With each movement, she would also give some explanation.Although the woman was extremely beautiful, Han Sen was completely attracted to what she was talking about and had no other thoughts.\"Jadeskin! Isn’t this the hypo geno art used by Xue Longyan?\" Han Sen had seen the power of jadeskin when Xue Longyan used it, and became even more happy.Having locked himself in the room for 48 hours, Han Sen finally memorized everything in the chip and destroyed it, as it could become a pitfall in the future. After watching the jadeskin tutorial, Han Sen had a stronger sense that Xue Longyan must have been somebody significant.Han Sen began to practice jadeskin as he was recovering. He had thought before about buying a tutorial of a hyper geno art, after he had earned some money. However, the ones that could be bought were all cheap, unlike jadeskin, which he could tell was premium.Knowing that practicing jadeskin might eventually expose him, Han Sen still decided to begin. If he missed jadeskin, he might never have the opportunity to practice a premium hyper geno art.Having practiced for several days, Han Sen felt his body had become cooler. And his body temperature was indeed 35 degrees Fahrenheit lower than normal. It was not a discomfort, but rather a refreshing feeling. Han Sen felt more fit, as if his body cells were full of energy.His body temperature didn’t change further as he kept on practicing. Han Sen became more and more fit and his skin more and more smooth.\"Han Sen, what have you been up to lately? It’s been awhile since we met. Let’s hang out sometime!\" The hologram of a smiling handsome long-haired man about Han Sen’s age popped out from the comlink.\"Where are we going?\" Han Sen was delighted to see Zhang Danfeng, the long-haired guy. They grew up together, and he was son of Mr. Zhang, the lawyer.\"Come out first! Han Hao and Xue Xi are also with me, and we are almost there,\" Zhang Danfeng said.\"Sure.\" Han Sen nodded and went out the door. There was a small private jet parked outside, and Zhang Danfeng was waving to him from the driver’s seat.Han Sen got in and saw a girl and a guy talking in the back seats. The girl named Xue Xi was very pretty and gentle. And the guy was Han Hao, son of Han Sen’s fat aunt.Han Sen's aunt was an aggressive woman, so Han Hao inherited her family name.The four young people had all grown up together. However, after Han Sen’s father’s accident, he could only go to integrated compulsory education, while the rest were in private schools.Han Sen nodded to Han Hao and Xue Xi and sat in the co-pilot seat. Han Hao took a look at him and continued to talk to Xue Xi, ignoring Han Sen.\"Xue Xi, you should see it! Dollar just waved his hand and turned into a monster with horse legs, a human upper body and a cow head in golden armor. Son of Heaven and his gang could do nothing but watch him gallop away...\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 14": "📕WuxiaClick🌙Home/Super God GeneCH 14Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen was somewhat surprised to see Han Hao sputtering on. He did not know Han Hao was also randomly sent to the Steel Armor Shelter.Han Hao was three months younger than him, so he should’ve just had his birthday and gained access to God’s Sanctuary.For unknown reasons, if those under 16 were teleported, their bodies would suffer irreversible damage. So according to the Alliance laws, one must be 16 years old to be teleported to God’s Sanctuary, regardless of social status.\"Hey Frenzy, where are we going?\" Han Sen asked Zhang Danfeng. Although Zhang Danfeng was a good-looking man, he became crazy whenever he was in a fight, hence the nickname.Zhang Danfeng’s face lit up, \"Starlight Martial Hall. My idol Tang Zhenliu’s going to be in an exhibition fight held there! He was the Chosen last year, and his broadsword skills are so fierce!\"Zhang Danfeng was full of yearning. In this era where everyone was focused on evolution, stars no longer came from acting, singing, sports and E-sports, but from fighting.In God’s Sanctuary, once every year the martial hall of each shelter would open at the same time, and those in the top 100 could have their names on the martial stele in the martial hall. The champions from each shelter would be eligible to compete among themselves. And the same happened in all four phases of God’s Sanctuary. The top 10 from each phase could have their names on the Sacred Stele, which was public to everyone in the same phase, and gain the title \"the Chosen.\"And the ten Chosen would become the hottest stars of the year.In recent years, Qin Xuan had always been the champion of Steel Armor Shelter, but her name was never on the Sacred Stele, so she was never among the top 10 of First God’s Sanctuary.Ranking number 5 last year, Tang Zhenliu was known for his fierce broadsword skills. He was very popular among young people and even more well-liked than the top 4. He was paid as high as ten million Levo dollars for any exhibition match.Knowing his popularity, Han Sen was nevertheless shocked when he saw a full house at Starlight Martial Hall, which could accommodate more than a hundred thousand people.Many crazy fans were holding signs and calling out Tang Zhenliu’s name. When he appeared, a girl was so excited that she fainted.\"If I could have my name on the Sacred Stele like Tang Zhenliu once in my life, then I’d know I’ve lived.\" Zhang Danfeng said admiringly.\"You will Frenzy.\" Han Sen smiled and said, watching the young people around him going crazy for Tang Zhenliu’s appearance.\"It’s so hard. I have entered God’s Sanctuary for three months already. Although I bought some primitive flesh and a primitive beast soul, it’s still difficult for me hunt any mutant creatures. If I could buy a mutant beast soul, it would be much easier. But even if I had the money, people wouldn’t necessarily sell their mutant beast souls.\" Zhang Danfeng shook his head with a wry smile.Han Sen thought to himself regretfully, \"The only thing that could be brought from God’s Sanctuary to the real world was a beast soul, while it can only be used but not traded there. Otherwise I could produce mutant creatures and would gain some mutant beast souls eventually, which could be really helpful to Frenzy.\"\"Ha-ha, then I have better luck then you, Danfeng. I just entered God’s Sanctuary and have already gained a mutant beast soul. Such a pity you are not in Steel Armor Shelter, or else we could hunt together and I could help you,\" Han Hao said proudly.\"You’ve gained a mutant beast soul already? Tell the truth, did you hunt it or pay for it? \" Zhang Danfeng cried, staring at Han Hao.\"Of course I hunted it myself,\" Han Hao said loudly.Han Sen laughed to himself. Since he was a kid, Han Hao had always raised his voice when he lied. His parents probably bought him the mutant beast soul with an enormous amount of money.The cheapest mutant beast soul would cost millions, and good ones tens of millions. So that’s why his relatives were after the old house. It was a huge expense for them. Although the company had earned a lot of money, they had probably spent it all by now.Tang Zhenliu was indeed awesome. Although it was just an exhibition fight, his broadsword skills were so swift and fierce that his broadsword almost became invisible.After watching for a while, Han Sen knew that Tang Zhenliu must have practiced premium hyper geno arts and learned his weapon skills from masters, and he was no competition to Tang Zhenliu.Tang Zhenliu won the fight and summoned a beast soul to perform, shapeshifting into a three-meter-tall tyrannosaurus creature and smashing a huge stone with its head, arousing a burst of screaming.\"Sacred-blood beast soul of raging dementor! I would do anything for a beast soul like this.\" Zhang Danfeng stared at Tang Zhenliu, who turned into a monster with a watering mouth.\"This is nothing! This beat soul is nothing like the one Dollar has...\" Han Hao sputtered about Dollar as if it were himself.\"It would take a showdown to tell.\" Tang Zhenliu was Danfeng’s idol, so he was upset to hear that. \"I don’t know how good Dollar was, but his sacred-blood beast soul was robbed from others, and it was not a chivalric act. Even if he had a great beast soul, he would not be comparable to Zhenliu.\"Han Sen blushed with shame and thought, \"Oh Frenzy, you didn’t know what a hard time I was having! How could I let go of an opportunity like that! Not to mention Son of Heaven was my enemy.\"Han Sen was hesitating whether or not to tell them that Dollar was himself but decided not to. It wouldn’t do them any good, after all.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 15": "Chapter 15 - Selling FleshHan Sen kept practicing Jadeskin and recovering after he returned home. Every two days he went to God’s Sanctuary to check on the copper-toothed beast.It took the beast half a month from the time it swallowed the black crystal to become a mutant creature, but it was still the size of an ordinary copper-toothed beast, while the mutant copper-toothed beasts Han Sen had seen were twice that size. In addition to the size, the one he evolved into wasn’t much stronger either, not even close to a true mutant one.Han Sen took out his alloy dagger and slashed the beast on the neck, but caused no damage at all. It was his dagger that chipped.\"So it is somewhat different from an ordinary one.\" Han Sen shapeshifted into a bloody slayer and snapped its neck by force.\"Mutant copper-toothed beast killed. No beast soul gained. Eat its flesh to gain zero to ten mutant geno points.\"The sound in his mind overjoyed Han Sen. It might look different than a wild mutant copper-toothed beast, but it was fine as long as it was indeed a mutant creature.Now what was troubling him was how to sell this mutant copper-toothed beast. He really needed the money, or else he could just eat it to gain mutant geno points.\"It is too dangerous for me to sell it showing up as Dollar, now that the entire shelter is looking for him. But it would also be troublesome if I were to sell it using my own true identity.\" Han Sen still decided to use Dollar’s name after some hesitation.Su Xiaoqiao was depressed these days. Qin Xuan asked him to find Dollar, but he didn’t know Dollar any more than she did, so what was he supposed to do?Early in the morning, Su Xiaoqiao was tripped by something and fell flat on his face.\"Who is this f*#ker that placed a stone in front of my room? He’s dead if I find out.\" Even more depressed than before, Xiaoqiao saw that there was something under the stone.He took a closer look and found a note and a bundle. The note said, \"Goods worth fifty thousand delivered. We are square. If you want more, come to Zephyr Valley tomorrow. Cash only.\"Although there was no signature, a coin was drawn at the lower left corner, making clear who it was from.\"Dollar!\" Su Xiaoqiao was thrilled but didn’t make a sound this time. Looking around and seeing no one, he took the bundle and note and closed the door.Su Xiaoqiao carefully opened the bundle and saw a long strip of meat jerky the size of two or three bites.Su Xiaoqiao chewed up the meat jerky and swallowed.\"Mutant copper-toothed beast flesh eaten. One mutant geno point gained.\"The voice in his mind surprised Xiaoqiao, \"Mutant copper-toothed beast flesh! So it was hunted by Dollar? He must have more now that he asked me to bring cash to Zephyr Valley.\"Thinking of this, he got even more excited that he could bring Qin Xuan’s message to Dollar and buy mutant flesh from him at the same time.Early in the morning, Su Xiaoqiao set off to Zephyr Valley. He waited from early morning to noon but didn’t see Dollar coming.\"S*#t, he must have fooled me!\" Su Xiaoqiao was so upset that he was preparing to leave, but then heard someone say, \"You brought cash?\"Shocked, Su Xiaoqiao turned around and saw Dollar in golden armor emerging from below the ground.\"Brother, did you hide there all morning?\" Su Xiaoqiao said, staring at Han Sen.\"I've been hiding here since last night. You know what’s going on right now, and I have to be careful,\" Han Sen said casually.\"I admire you Dollar, but you really have nothing to worry about. I’m so grateful you would sell me mutant flesh and would never betray you.\"Su Xiaoqiao gave Han Sen the thumbs-up. It was incredible that he could stay underground for the whole night and the entire morning. It must have been so uncomfortable.\"Cut the crap. Did you bring the money?\" Han Sen pulled out another bundle from the pit where he was hiding and placed it in front of Xiaoqiao.Su Xiaoqiao looked inside the bundle, which was full of the same meat jerky he had eaten yesterday. There must have been more than five pounds of it. He excitedly asked, \"Dollar, did you make all this from the mutant copper-toothed beast?\"\"Yep. An entire mutant copper-toothed beast is right here. Two million, and no bargaining,\" Han Sen said.\"Well, two million is fine.\" Su Xiaoqiao handed two stacks of ten-thousand notes to Han Sen, but doubted whether the entire beast was really there, as there should have been more meat.Han Sen noticed his doubt, took the money and said, \"This meat jerky is made in traditional ways, so it shrank a bit. Rest assured that the whole beast is here.\"Han Sen made the copper-toothed beast into meat jerky so that no one would wonder why the beast was so tiny..\"Of course I trust you!\" Su Xiaoqiao paused and said, \"Dollar, you should know that I work for Qin Xuan. She has a message for you: she wants to buy the sacred-blood beast soul and golden axe you gained the other day, and she could offer you a good price.\"\"Oh, what is the price?\" Han Sen was interested in selling the golden axe, as it was not that portable. He hadn’t found a chance to use it, so it was still buried.\"You will have to figure this out yourselves. I’m just the messenger,\" Su Xiaoqiao shrugged and said.\"If you meet with Qin Xuan, tell her if she really wants to buy it, she can name a price and you can bring it to me,\" Han Sen said lightly. It was too risky for her to meet Qin Xuan.Previous Chapter<All ChaptersNext Chapter",
    "Chapter 16": "📕WuxiaClick🌙Home/Super God GeneCH 16Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen took back the beast soul armor and returned to Steel Armor Shelter. When he was entering the gate, he met an acquaintance.\"Sen?\" Han Hao was surprised to see him.\"Han Hao, you know Ass Freak?\" Han Hao’s companions all recognized Han Sen and looked at Han Hao strangely.\"No, wrong guy. Let’s go!\" Han Hao paused and looked embarrassed. Without saying hello, he walked past Han Sen.Han Hao hadn’t expected Han Sen to be in the same shelter, nor that he was also the infamous Ass Freak. If word got out that he was Han Sen’s cousin, Han Hao couldn’t imagine what Son of Heaven and Qin Xuan would do to him.Han Sen smiled wryly and did not expose Han Hao’s lie. Since Han Hao didn’t want anything to do with him, why would he do his cousin any harm?With two million on him, Han Sen left God’s Sanctuary and went back home. He asked Mr. Zhang to help with the legal procedures regarding the old house to avoid any further disputes with his relatives. After that, Han Sen felt a lot more relaxed. Everything would be taken care of and life would only get better. When he earned more money, Han Yan could go to a private school, where she could get a much better education than he did. In some elite schools, she could even learn hyper geno arts and have a much better start.To enter an elite school, however, her family must be aristocratic. So Han Sen must complete one evolution and gain the title.\"That would be a piece of cake for me. I could even have the title of sacred-blood aristocrat if I want.\" Han Sen’s spirits were high.\"Brother, you here?\" Han Yan, in floral pajamas and holding a doll in her arms, poked her head through the door and searched for Han Sen.Seeing Han Sen sitting on the bed, she ran over and leaned against him with the doll.\"Naughty girl, why are you still up?\" Han Sen pinched her little nose.\"Yan wants to listen to a story! It’s been forever since you told me stories, and I’ve missed you so much since you’ve been gone.\" Han Yan looked at Han Sen with watery eyes.Han Sen sighed secretly. Since he graduated and entered God’s Sanctuary, he had almost no time for his little sister, which he felt so guilty about.\"I’ll tell Yan a story right now.\" Han Sen sat Han Yan on his lap, opened a story book and read softly, \"Once upon a time ...\"After Han Sen returned to God’s Sanctuary, he decided to catch a primitive creature to feed, which, incredibly, would turn to a mutant one in half a month.But Han Sen was more curious to know how long it would take for it to become a sacred-blood creature, which is what he needed most.It was still relatively easy to hunt a wild mutant creature, but almost impossible to hunt a sacred-blood one. Take the bloody slayer for example: he could never have killed it if it weren’t already severely injured by Son of Heaven.The moment Han Sen left his room, he was pulled away by someone.Han Sen turned and saw Han Hao, who pulled him to a remote spot. After confirming there was no one nearby, Han Hao said, \"How did you cause such trouble! You haven’t even been here long, and you’ve managed to piss off gangs of both Qin Xuan and Son of Heaven.\"I didn’t mean to,\" Han Sen said casually.\"I do not care. You are on your own for the stupid things you did. You are not allowed to say that I am your cousin or that you know me in front of others. I just started here and have a bright future, and will not be destroyed like you were,\" Han Hao said, glaring at Han Sen.\"Sure, I won’t tell.\" Han Sen knew his cousin had been looking down on him since he went to integrated compulsory education, and there was no way he would support him under these circumstances. Of course, he was not obligated to either.\"That's settled then. Don’t say you know me,\" Han Hao told Hen Sen once again before leaving, fearing that someone might see them together.Han Sen left Steel Armor Shelter and went all the way into the mountains. He didn’t plan to hunt copper-toothed beasts anymore, as he had had enough of their meat and would no longer gain primitive geno points from it. It was another primitive creature that he was going after. He could eat several and also bring back a living one to evolve.Han Sen had chosen a place called Barathrum Cave for hunting this time. It was a remote cave in the mountains, where primitive creatures, quartz scorpions, lived.Because it was so dark and narrow in Barathrum Cave, even with lighting equipment, sometimes it was still difficult to see quartz scorpions hidden in rock tunnels.If stung by these scorpions, it would take a mere three to five minutes before someone who had maxed out on primitive geno points would be poisoned to death.Therefore, few people would choose quartz scorpions as their targets. With black beetle armor, however, Han Sen wasn’t risking much, as it was not likely that quartz scorpions could get to him.His chose quartz scorpions because, first, it was easy to hide himself from the public in the cave. And second, a quartz scorpion was only the size of a fist, so it would be easy for him to carry their bodies back, unlike the large prey which were hard to transport. Third, if he happened to gain the beast soul of a quartz scorpion, he would also make a fortune, as it was a weapon like a military knife which was poisoned and incredibly sharp. As a primitive beast soul, its price was almost as high as a mutant one.At the mouth of the cave, Han Sen made sure he was alone and summoned his armor, entering Barathrum Cave prepared.As modern lighting equipment didn’t work in God’s Sanctuary, Han Sen brought a self-made torch, with which he could only see several feet in front of him. With mica in the rocks reflecting the light, he could hardly see the hidden scorpions.Clank!Han Sen soon felt a hit on his foot. He looked down and saw a deep blue scorpion the size of his fist stinging him on the feet with its tail.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 17": "📕WuxiaClick🌙Home/Super God GeneCH 17Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayFortunately, Han Sen's feet were also wrapped in armor, and the scorpion tail couldn’t hurt him at all.Han Sen stepped on the quartz scorpion and crushed it.\"Primitive creature quartz scorpion killed. No beast soul gain. Eat the flesh of quartz scorpion to gain zero to ten primitive geno points.\"Han Sen picked up the dead scorpion, put it into a prepared bag, and walked further into the cave with the bag on his back.Protected by the black beetle armor, Han Sen killed all quartz scorpions he saw on the way, and there were nearly a hundred scorpions in his bag after he had walked for an hour.\"Georgie Porgie, Pudding and Pie, kissed the girls and made them cry. When the boys came out to play, Georgie Porgie ran away.\" Han Sen collected the dead scorpions as he was humming a nursery rhyme.His mother had to work to support their family, and he was the one who took care of Han Yan. That’s why he was used to humming nursery rhymes.\"Dollar?\" Han Sen heard the other name he had given himself when he was on a spree. Shocked, he peered in the direction where the voice came from.In the cave sat a woman in her twenties leaning against stalagmites, looking at him surprised.\"Qin Xuan!\" Han Sen exclaimed. Not expecting to see this woman here, Han Sen turned around to run.Since he had stabbed her in the rear, he had had nightmares about it.\"Don’t go. I don’t care about the grudge between you and Son of Heaven. And even if I wanted to look for trouble, I wouldn’t be able to,\" Qin Xuan quickly said.Hen Sen paused and looked back at Qin Xuan, whose ankle was swollen and badly bruised. Clearly, she had been stung by a quartz scorpion.It suddenly hit Han Sen that Qin Xuan must have so many treasures on her since she had been in Steel Armor Shelter for years and wished to evolve with the maximum sacred geno points. She must have sacred-blood beast souls and very many mutant beast souls.At this point she was injured, and it looked quite serious. She had so many geno points that the scorpion poison might not kill her, but her ability to fight surely had suffered, or at least she couldn’t move her injured leg.\"Although I was the one who stabbed her, she hit me back right away and has been ruthless to me ever since. If I could blackmail her right now, that would be some compensation for my suffering these months,\" Han Sen thought, leering at Qin Xuan.As if she could see through him, Qin Xuan summoned a beast soul in the shape of a purple butterfly, which turned into a purple dagger in her hand.\"You know the name of this dagger?\" Qin Xuan asked him with a smile.\"I don’t.\" Han Sen noticed the gleam of the dagger, but she couldn’t have summoned it for its beauty. It must be at least a mutant beast soul and even possibly a sacred-blood beast soul.\"This dagger is the beast soul of a malicious butterfly, and it is envenomed with strong poison. You decide if your armor could block my dagger.\" Qin Xuan was still smiling.Qin Xuan couldn’t see Han Sen blushing because his armor blocked his face. \"You worry too much. We just met and have no hard feelings between us whatsoever. Why would I try to hurt you?\"The sacred-blood armor might not have been able to block the sacred-blood dagger. Han Sen would not take the chance. Besides, they weren’t really enemies either, as Qin Xuan didn’t do anything more than make a few threats. It was Son of Heaven and his gang that really bullied him.Qin Xuan smiled and took back her dagger. \"I can’t move. If you can take me out of the cave safely, I will pay you a generous reward.\"\"How come you came here alone?\" Han Sen asked, not agreeing straight away. He was curious how Qin Xuan was able to come this far when there was no trace of quartz scorpions being hunted on the way.\"Originally I wanted to kill a mutant quartz scorpion, but it was more cunning than I thought. It started to attack me, leading other scorpions when my incense was about to burn out, so that I couldn’t leave the cave. The primitive scorpions no longer feared me when the incense was gone. I was able to fight them off but was stung by a mutant quartz scorpion. So now it’s even less likely that I can leave here.\"Qin Xuan looked at Han Sen and said, \"Didn’t you barter with Su Xiaoqiao for money? Take me out and I’ll offer you that.\"\"You were stung by a mutant quartz scorpion?\" Han Sen looked at her, horrified.\"If it was just a sting by a primitive quartz scorpion, I wouldn’t have asked for help,\" Qin Xuan said casually.Han Sen now knew it was incense that kept the quartz scorpions sway from Qin Xuan, and she thought that he must have used the same method. What she didn’t know was that he had killed all quartz scorpions on the way out. If she had known, she would have walked away herself.\"Did you not kill the mutant scorpion?\" Han Sen asked again.\"Yes, but I did not get a beast soul. No one could get the flesh either, as it’s full of scorpions out there,\" Qin Xuan said.\"I’ll take you, not for money but for a mutant beast soul.\"\"You are too greedy.\" Qin Xuan glanced at him.\"Miss Qin, for you, a mutant beast soul is nothing. Is your life not worth it?\" Han Sen said.\"Alright then.\" Qin Xuan looked at Han Sen earnestly.\"Amazing. You have a deal Miss.\" Han Sen walked farther into the cave.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 18": "📕WuxiaClick🌙Home/Super God GeneCH 18Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"What are you doing?\" Qin Xuan frowned.\"I’ll take you out after picking up the corpse of the mutant quartz scorpion you killed.\" Han Sen continued to go inside.\"There are so many scorpions there. Don’t you need incense?\" Qin Xuan looked at Han Sen, puzzled.\"Why do men need incense?\" Han Sen came back with a giant blue scorpion about a foot long in his hand.Qin Xuan sighed after looking him up and down, \"I was tricked by you. You have already killed all the quartz scorpions out there, haven’t you?\"\"Smart girl.\" Han Sen poured the dead scorpions from his bag, which soon piled into a heap.Although Qin Xuan had guessed it, she was still surprised to see that Han Sen had killed so many scorpions.Han Sen put the corpse of the mutant scorpion in his bag first before he started to fill it with primitive scorpions. There were still a few that wouldn’t fit in there, and he didn’t waste those but ate all the flesh until he had cleaned them up.\"Primitive quartz scorpion flesh eaten. Four primitive geno points gained.\"\"I haven’t seen anyone quite like you, willing to eat such disgusting things.\" Qin Xuan had never met someone who had such nice equipment but remained so stingy.\"Come on.\" Han Sen squatted next to Qin Xuan, wanting to carry her out on his back.\"Since there are no scorpions anymore, I could just walk out,\" Qin Xuan said.\"You have promised me a mutant beast soul and couldn’t take that back anyway. Why not enjoy my service with your injured leg?\" Han Sen said.\"You are right. Why not?\" She bit her bottom lip, got up and carefully climbed onto the back of Han Sen.With the armor, Han Sen couldn’t really enjoy the feeling of her body against his. He walked out, carrying Qin Xuan, with his bag in one hand.She only weighed about 100 pounds, which was nothing for Han Sen, who had already gained quite a lot geno points. They emerged from the cave in no time.\"Where are you going?\" asked Han Sen.\"Back to the shelter,.\" Qin Xuan said.Han Sen no longer spoke and carried her towards Steel Armor Shelter. After an hour, he let her down.\"It is not too far away from the shelter now, and people pass by here all the time. Wait for a while, and then ask them to bring you back.\" Han Sen extended an empty hand to Qin Xuan: \"Now, my mutant beast soul.\"\"I have asked Su Xiaoqiao to send a message. Would you sell me the sacred-blood beast soul and gear?\" Qin Xuan didn’t hesitate before she handed over a mutant beast soul in the shape of a black cat to Han Sen.\"What is your offer for the golden double-edged axe?\" Han Sen asked.\"Two million.\"\"That is a piece of sacred-blood gear, while two million won’t even get you a mutant beast soul.\" Han Sen frowned.\"Sacred-blood gear is very nice, but you can’t take it to the real world, while beast souls could be used outside God’s Sanctuary. That explains the price. If you would sell a sacred-blood beast soul, I’d give you twenty million,\" explained Qin Xuan.\"A mutant beast soul, plus two million,\" Han Sen said.\"A mutant beast soul is out of the question. I’ll give you five million.\"\"Flesh of two mutant creatures and two million.\"\"You are asking too much. Final offer, six million. After all, you can’t take it outside,\" Qin Xuan said.\"Okay, get the money ready. I will tell Xiaoqiao when and where we trade,\" Han Sen said and left with his bag.\"You really would not consider selling the sacred-blood beast soul? Twenty million is just a tentative offer. We could discuss further,\" Qin Xuan said to his back.\"No way.\" Han Sen left without pausing.Qin Xuan looked at him leaving and thought, \"His armor was tougher than the quartz scorpion sting. It must also be a sacred-blood beast soul.\"\"Who was he? He doesn’t look like a soldier.\" She had no clue.Han Sen went back to his original look and returned to the shelter with his bag.There was no one guarding the gate anymore: they had searched for Dollar for so long and found nothing, so they had to give up.Coincidentally, Han Sen ran into Han Hao and his friends again.\"Nice to see you again, Ass Freak! You have a full bag with you. How many mutant creatures did you hunt?\" A young man ridiculed him.\"One.\" Han Sen replied calmly.\"Ha-ha, you are funny. Could you even hunt primitive creatures? It must be full of black beetles there,\" laughed the young man, leading everyone to burst into laughter. No one believed Han Sen could get a mutant creature.\"Han Hao, don’t mistake him for anyone. If you knew him, you’d forever have bad luck.\" A young man patted Han Hao on the shoulder.\"No way I’d know Ass Freak!\" Han Hao looked embarrassed.Han Sen ignored them and carried his bag back to his room.He saved the mutant quartz scorpion and was going to sell Xiaoqiao all the rest. Although he could evolve a creature into a mutant one in half a month with the black crystal, he’d rather use the crystal to get sacred-blood creatures.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 19": "📕WuxiaClick🌙Home/Super God GeneCH 19Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayIn the middle of the night, Han Sen placed a bag of dead quartz scorpions and a note at the door of Su Xiaoqiao’s room before knocking a few times. Then he hid in an alley close by and made sure Xiaoqiao took the bag and note inside.It turned out to be a nice collaboration, and Han Sen got the six million promised by Qin Xuan and another eighty thousand for the scorpions. He went back to his room with boxes of cash and almost jumped with joy.Even when his father was still alive, he had never seen so much money at once.Han Sen left God’s Sanctuary with the money, since the only thing he wanted to do right now was to share the joy with his mother and sister. Their adversity had finally ended.The two million he earned before was all used on solving the issue of the old house, and he could eventually have the six million to himself, which was a totally different feeling.Although the money was not even enough for the rich to buy a luxury airplane, for Han Sen it was already the most money he had seen in his life.\"Mom, Yan, I have something to show you.\" Han Sen pulled them into his room and poured the cash onto his bed.\"Where did you get so much money?\" Luo Sulan was first frightened instead of being surprised, fearing that her son might have done something dangerous.\"Mom, I was lucky to have killed a mutant creature and gained the beast soul, so I traded it for this money.\" Han Sen did not dare to tell the truth, afraid that Luo Sulan might get worried.He didn’t dare to leak anything about the black crystal, as the precious stone may land its innocent possessor in jail. His whole family could be wiped out if word got out.Luo Sulan said ruefully, \"Sen, you should not have sold it. It could be of great help to you, and we could always get by... \"\"Mom, no worries. I will have another chance. I’ve eaten the mutant flesh and gained mutant geno points. In the future, it’ll be much easier for me to hunt, and everything will get better.\"\"But...\" Luo Sulan still felt bad, as it was not that easy to kill a mutant creature. For ordinary people, it would be great luck to hunt one, just like winning the lottery, so there may never be a second time.\"Yan is about to start school, and I’m not letting her to go to a public one like I did,\" Han Sen said.Luo Sulan looked at her children with tears in her eyes, \"It’s all my fault. I didn’t take good care of you.\"\"Mom, you are a great woman, and you were the one who raised us. Let me contribute a little as well!\" Han Sen picked up Han Yan: \"Yan, let’s go out to eat. You can have whatever you want today.\"Han Yan’s face lit up: \"I want to eat Sapphire ice cream.\"\"Sure, let’s go have Sapphire ice cream!\" Han Sen pinched Han Yan's small nose.\"Sapphire ice cream is too expensive. You don’t need to splurge with the money. Save it to buy some meat...\"\"Just once!\" Han Sen went out, holding Luo Sulan’s hand.\"Don’t tell others you have hunted a mutant creature or you sold a mutant beast soul… I don’t want anything bad to happen to you…\" Luo Sulan urged her son. Since Han Sen's father had the accident, Luo Sulan had changed. She no longer wanted Han Sen to be in charge but just to be safe.\"Mom, relax. I will not say a thing. You keep the money and decide what to do with it.\" Han Sen went out of the house holding his sister with one hand and his mother with the other.Sapphire ice cream was famous throughout the Alliance and was also very expensive. Even the cheapest type cost more than ten thousand.Their neighbors’ kids were always having Sapphire ice cream. And Han Sen also had tried it a few times when he was younger. However, when Han Yan was born, they were already bankrupt, so they couldn’t afford such luxuries any more.Having the impression that the ice cream was delicious, Han Sen could no longer remember what it tasted like.When the three came to Sapphire, all the seats were taken, and there was a long line to buy ice cream.\"Let’s go upstairs.\" Before Han Sen entered the store, he saw through the window that the second floor was almost empty, so he thought the ladies could go upstairs and have a seat while he would stand in line alone.At the stairs, he was stopped by a waiter.\"I am sorry, you cannot go up,\" the waiter said.\"Why? Aren’t there any seats upstairs?\" Han Sen frowned.Contemptuous and impatient, the waiter pointed to a notice on the wall, \"You should have heard about our rule even if you have never had our ice cream before.\"Han Sen looked at the notice, which said, \"The Distinguished and Aristocrats Only\" and understood what he was referring to. So the second floor was an area exclusively for people with privileges, and ordinary people weren’t even allowed to enter.No wonder the second floor had much better decorations yet was so empty.\"We don’t need to sit down. We’ll just wait here, and you go get Yan ice cream,\" said Luo Sulan, trying to spare Han Sen.\"I'm going.\" Han Sen smiled and went to the back of the line. He seemed to be indifferent, but was suddenly possessed by an aspiration.\"What’s so special about the distinguished and aristocrats? Soon I shall have it all and more. The stupid notice will never get in my way again.\"There still were no empty seats when it was his turn to buy the ice cream, so Han Sen had to order takeout. Before leaving, he took another look at the notice—\"The Distinguished and Aristocrats Only!\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 20": "📕WuxiaClick🌙Home/Super God GeneCH 20Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayThe next morning, Han Sen was on the train going to the teleport station, with many passengers sharing his destination.Most people could not afford a teleport device, so they had to enter God’s Sanctuary using a public teleport station.Today, the conductor seemed to be in a bad mood. While Han Sen was deep in thought about what to do in God’s Sanctuary, a violent shake of the train left everyone who was standing falling to the sides.Since he wasn’t paying attention, Han Sen also involuntarily staggered a few steps forward and fell on something soft.Subconsciously wanting to seize something to regain his balance, he felt strange because what he was holding on to was even more soft and tender.Then he found that he had bumped into a woman in military uniform, and his hands were on her chest.\"Bastard!\" The woman scowled and elbowed him fast and hard. If she were to succeed, Han Sen would have lost half his face. He subconsciously raised an arm to block the hit, felt a strong hit on his arm and involuntarily stepped back several steps.The woman turned around and viciously stared at Han Sen. She exclaimed with just one look: \"You! Ass...\"\"Qin Xuan!\" She didn’t finish her sentence, but Han Sen cried in fear. This woman in uniform happened to be the woman from whom he had gotten the nickname Ass Freak.Han Sen did not expect Qin Xuan also to be on Roca Planet, and it seemed that she had enlisted in the army.Being in the military was nothing uncommon in the Alliance, as all legitimate residents of the Alliance needed to serve at least five years when they turned twenty. When Han Sen turned twenty, he would also become a soldier, if there were no special reason for him not to serve.Qin Xuan recognized Han Sen, but didn’t initiate a fight. She just looked at him with a cold and slightly disgusted look.Han Sen thought ruefully, \"She must think I’m a pervert now. I don’t even blame her. I did stab her in the bottom and now… If I were her, I’d assume the same. \"\"There are so many planets in the Alliance, how is Qin Xuan here as well? And what are the chances that I would meet her and did this to her,\" Han Sen thought plaintively. There was no way around it; he would have to let the situation play itself out.In the Alliance, wounding others was not allowed. Qin Xuan did not want to make a scene, so she just glowered at him and didn’t move further.Han Sen had goosebumps from her staring and immediately got off the train once he reached the teleport station. To his surprise, Qin Xuan followed behind him.\"Dogs can't help from eating sh*t. I thought you were just innocent, while you are by nature a disgusting person,\" Qin Xuan said fiercely.\"You saw what happened. It was the train, and so many others also fell. It was just a coincidence,\" Han Sen said with a wry smile.\"Would you believe that if you were me?\" Qin Xuan said coldly.\"What do you want?\" Qin Xuan had identified him as a bastard, so there was no need to explain.\"You really are brazen, showing no remorse for what you did. It must not be the first time you have done something like this.\" Seeing that Han Sen wasn’t going to apologize, Qin Xuan raged, \"You think I’ll just send you to the police? It’s not that easy. I can’t beat you up here, but in God’s Sanctuary, it will be a different story. You are going there right? I’ll wait for you.\"Qin Xuan immediately left and the soldiers saluted her, \"Good morning, Stationmaster.\"Han Sen stumbled and couldn’t believe what he saw. He almost wanted to cry.All teleport stations belonged to the military system. A garrison was assigned to each station, and the stationmaster was the garrison's chief executive.Han Sen had heard that the old stationmaster was to be transferred, and he couldn’t believe that Qin Xuan would be the new stationmaster, not even in his wildest dreams.Han Sen had a bad feeling about the whole thing. As the stationmaster, Qin Xuan would know his whereabouts very well.And it wasn’t even possible for him to use a different teleport station. There are three public teleport stations on Planet Roca, but the other two were too far away, and he couldn’t waste two days on travelling.Han Sen entered God’s Sanctuary when Qin Xuan went to her office. He decided to wait until she left the shelter before he teleported back home.Han Sen gave Qin Xuan no chance to intercept him. Taking some meat jerky made from the mutant scorpion, Han Sen left Steel Armor Shelter.\"Did I use up my luck when I found the black crystal?\" Han Sen thought, depressed.He did not go far before seeing Son of Heaven and his gang standing outside the shelter chatting.Han Sen wasn’t interested in meeting up with them and went the other way. However, Luo Tianyang called him from behind: \"Ass Freak, come here!\"Reluctantly, Han Sen had to turn around toward Luo Tianyang, perplexed.\"I’m calling you. Come here and you’ll get lucky.\" Luo Tianyang waved to him, smiling maliciously.\"There is no need. I’m not strong. I can only deal with ordinary creatures and can’t even fight primitive creatures. I am afraid I cannot help you.\" Han Sen knew it was never good when Luo Tianyang called him.\"Cut the crap! Do you want a beating? I said come!\" Luo Tianyang gazed at Han Sen with his face dark.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 21": "📕WuxiaClick🌙Home/Super God GeneCH 21Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayIn addition to Han Sen, Son of Heaven and his gang were also joined by a few thugs they paid to come along. The group left Steel Armor Shelter and marched into the mountains.Although they expected nothing good to happen, they still wanted to take the chance for the sake of the generous reward.In the past, if Han Sen had not been blocked by Qin Xuan and Son of Heaven, he might also have risked his life for the bounty.Now Han Sen had no reason to take such risks, but it was clear that Son of Heaven and Luo Tianyang wanted to use him as a stepping stone, which made him want to kill them both.Han Sen quietly followed them, guessing what they were about to do. When recruiting people, the gang had said they were hunting a mutant creature, and it was only because there were also many ordinary and primitive creatures that they needed more hands.Han Sen of course couldn’t take this seriously. To kill a mutant creature, the regular gang was more than enough. The dozen people around Son of Heaven could all kill a mutant creature on their own, let alone Son of Heaven himself. The extra hands were completely unnecessary, according to their story.Luo Tianyang and others casually killed the creatures they encountered along the way, and gave the meat to the hired people casually, which made everyone quite happy.The group had been going for six or seven days, and the gang still had no intention of stopping. On the eighth day, they halted at a mountain pass.Very far from the shelter, there was no human activity. They encountered many different creatures. Son of Heaven and his gang had killed a lot of primitive animals on the way and kept some of the flesh as food.\"It seems that we are almost there. What on earth are they up to?\" Han Sen had not heard anything, but judging from the grave look on their faces, this couldn’t be a simple operation.They rested for a day at the campsite and crossed the mountain pass the next morning. After hiking a dozen miles, they saw a gap in the canyon so deep and dark that no one could see the bottom.Everyone lit a torch. The gang sent the hired people as the vanguard and followed them into the gap.The hired ones all knew it was time to put their life on the line, so they were dawdling.\"Why are you going so slowly, bitches? Do you still want the rest of the money?\" Luo Tianyang whipped a few people in the back and shouted.The thugs could only speed up going down.Han Sen was among them. It was not too difficult to walk down, and nothing happened along the way until they reached the bottom. The thugs were relieved and started to talk and laugh again.It was very dark at the bottom of the gap, and the group had to rely on the torches. There was an underground river running through the huge space.\"Cross the river and go into the cave on the other side.\" Luo Tianyang pointed his whip to the other side.\"Luo, I cannot swim. This river is too wide,\" said a young man who had been recruited.\"Who told you to swim? We have inflatable boats. Just row across.\" Luo Tianyang opened the parcel on the back of his mount, and there were indeed inflatable boats in there. After they inflated the boats, each one could sit four to five people.The group started to row the boats across. The speed of the water was not fast, and there was no risk of being rushed downstream. Two boats soon reached the center of the river.All of a sudden, with a splash, a dark creature emerged from the water with half of its python-like body exposed. Its body was wider than a bucket and covered with shiny black fine scales. Its mouth was so large that it could fit a cow.But it wasn’t a cow that was swallowed, rather someone on the boat. The giant body then put its full weight on the boat, which exploded with everyone on it falling into the water.Everyone was shocked and trying to row the boats back. Those who hadn’t gone on the boat just dropped their boat and started to run back.With a glint of cold steel, the two running the fastest were beheaded by Luo Tianyang and another gang member. Luo Tianyang pointed the knife with blood on it at the rest and cried ruthlessly, \"There is but one monster, so whoever reaches the other side can live. And I’ll kill anyone who took the money and tries to run away. To live or to die, it is up to you.\"Everyone was intimidated by Luo Tianyang's vicious act and started to row towards the other side.\"Assholes, you just want to feed the monster with humans,\" Han Sen cursed in his heart. Those who fell into the water before were trying to swim to the other side but were suddenly pulled into the water by something.It was so dark that no one saw what happened to them, but their fate could be imagined from the thick scent of blood.The hired boys dared not move forward, and Luo Tianyang used his knife again to force them. They didn’t want to stay in the river, so they had to row hard.Han Sen lit the surroundings with his torch while rowing the boat. In case the monster came out of the water, he had to summon sacred-blood beast soul armor at once to save his life.The monster again collapsed a boat, and everyone on it was screaming. Then what could be heard was only the waves rolling.\"Row harder if you want to live!\" Han Sen yelled at the two on the boat with him who were petrified as he was rowing his heart out.\"F*#king heartless bastards!\" He swore quietly.The two men were revived by Han Sen’s shout, and started to row desperately. From time to time there were screams and splashes. Countless men must have been buried in the snake belly.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 22": "📕WuxiaClick🌙Home/Super God GeneCH 22Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayThere was no doubt that this giant snake was a sacred-blood creature. Aquatic creatures were hard enough to kill, let alone a sacred-blood creature.With his normal gang, Son of Heaven didn’t even dare to hunt it, but was only trying to fill out the group, so that they could safely reach the other side.Han Sen took a look at the other side as he was rowing. After they passed the middle of the river, the torch could light up the other side a little bit.Since Han Sen had started to practice Jadeskin, his body function seemed to get a lot better. vision was also a lot stronger than before and he seemed to have gained night vision as well. Now he could clearly see a cave six to nine feet wide on a cliff. Although there was no path, the cave must have been the gang’s destination.Han Sen was looking at the cave when he heard a loud splash. His heart sank as he saw the giant snake popping out of water less than six feet from their boat, its mouth moving towards the boat and its fangs showing.Without thinking, Han Sen jumped into the water and summoned his armor underwater. Like a fish, he struggled to swim across the river.The whole process of crossing the river was tragic. It wasn’t clear whether the black snake was insatiable or just determined to kill humans, but only two boats reached the other side, and only seven people lived. All the others were in the water and most likely dead.The snake didn’t show up again.\"Son of Heaven, although the snake was a sacred-blood creature, it was not intelligent. Now it is full, we should not have too much risk crossing,\" said Luo Tianyang, smiling.\"Go over.\" Son of Heaven gave the order, and the gang went over in three boats. As expected, the snake didn’t attack anymore and they all landed safely.\"Continue.\" Luo Tianyang whipped the seven survivors, who were forced to walk inside the cave, trembling. They regretted so much that they had coveted the bounty. What was money good for if they died here?But they did not encounter any other creatures along the way. In half an hour, they reached the end of the cave.At the end of the cave there was a pool, and next to the pool was a gravel nest 30 feet wide. In the middle of the nest there lay two eggs the size of ostrich eggs with black patterns.Son of Heaven was overjoyed.\"Ha-ha, awesome! Eggs of sacred-blood creatures, and there are two of them. Now my sacred geno points could go over 80.\"Even so, he did not lose his caution and winked at Luo Tianyang, who was equally excited. The latter understood immediately and forced the survivors to fetch the eggs.Trembling, they walked into the gravel nest and carried out the two eggs.However, before they were able to leave the nest, the pool started to bubble, and BANG! A huge snake head stuck out, the dark-red snake eyes staring at the egg thieves.\"Damn! Throw the eggs over,\" Son of Heaven shouted to them, but they were dumbfounded by the snake up close and did not reply him.\"Useless motherf*#kers!\" Son of Heaven scolded and summoned his red sword, running forward.The gang all summoned their weapons and followed him. Rushing in front of the survivors, Son of Heaven grabbed the eggs and ran towards the mouth of the cave. The snake was originally concerned about its eggs and didn’t move. Seeing Son of Heaven running away with them, it went into a rage and left the pool, chasing the gang madly.\"Block it,\" cried Son of Heaven, while he kept running without pause.Luo Tianyang was even more ruthless. He grabbed two shivering survivors and threw them at the snake. Catching one in the mouth, the snake swallowed him without chewing.The rest of the gang all followed suit, using the survivors as human shields, which temporarily resisted the snake's attack. They took advantage of it and retreated.Son of Heaven ran fast, holding the two snake eggs. It took him no time to arrive at the mouth of the cave. When he was excited, a golden fist appeared in front of him and hit him on the face.He hadn’t expected someone hiding behind the cave mouth and was unprepared for the attack. Blood spilling and nose crooked, he fell back with his hand covering his face.The two snake eggs suddenly flew out from his arms. A golden figure jumped up, caught one egg with each hand, and ran toward the river.\"Dollar!\" Son of Heaven fell to the ground, clutching his face. He immediately managed to climb up, saw the unique golden armor and recognized who it was.After jumping in the water, Han Sen had swiftly swum to the shore in the chaos, and instead of going into the cave, he hid behind a boulder and waited until the gang entered the cave. He then followed them and watched. When he saw Son of Heaven running with the eggs, Han Sen gave him a hard punch and captured the eggs.Han Sen just regretted that his bronze crescent spear had been ruined by Xue Longyan, or he might have been able to kill Son of Heaven with this secret attack.Han Sen reached the river and suddenly saw waves roaring. A huge black-scaled snake appeared from the river.\"F*#k! There is another one?\" Han Sen looked back and saw the other snake chasing the gang.\"Dollar, you are so f*#ked!\" Son of Heaven hated Dollar’s guts and gloated that he was stopped by the snake.Han Sen quickly had an idea as the snake in the river glared at him. He pushed hard with his right hand secretly, and then threw the snake egg at Son of Heaven. \"Catch. We will each keep one egg, and let’s deal with the snakes together first. \"\"Who agreed to that? I will get both eggs and kill you!\" Thinking Han Sen was terrified, Son of Heaven sneered and caught the egg, but the egg broke when it hit him and the egg was all over him.Son of Heaven was stunned.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 23": "📕WuxiaClick🌙Home/Super God GeneCH 23Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayRoar!The giant snake shrieked and rushed madly toward Son of Heaven, who was covered in egg, leaving Han Sen alone.Han Sen turned and ran with the remaining snake egg. Jumping on an inflatable boat, he desperately rowed to the other side without looking back.He still had an egg with him, and if both snakes decided to go for him, it would be no fun at all.\"Dollar, f*#k your…\" Han Sen heard cursing from behind, followed by all sorts of human voices and the beast’s roar.Han Sen went to the other side, jumped onto the shore and ran out of the big gap. Without a pause, he ran toward the shelter.After running for a while, Han Sen started to get uneasy. In case Son of Heaven and his gang escaped, they would definitely go for him, and he could by no means outrun their mounts.Han Sen decided to go into the forest and take a detour so that he didn’t risk being caught by them.They had been in the shelter for years, and everyone was fit and had plenty of beast souls. Even though they were no match for the snakes, surely some of them could get away. It was best to be careful.That night, Han Sen found a corner to take shelter from the wind and got some firewood. Sealing the snake egg with a layer of mud, he put it on the fire and barbecued it.While cooking, Han Sen murmured, \"Pure life, before you see this dirty world, let me handle the sin and send you back to heaven.\"\"Young obsidian dragon killed. No beast soul gained. Eat it to gain zero to ten sacred geno points randomly.\" Having barbecued it for a while, Han Sen heard the voice.\"So it was not a snake… unfortunately I didn’t gain the beast soul,\" Han Sen thought greedily.Soon the egg was cooked and Han Sen used a stick to get the egg out of the fire. Breaking the burnt mud crust on the outside, he saw the delicious egg white.Han Sen took a bite, and the egg was so much better than a chicken egg.\"Young obsidian dragon eaten. One sacred geno point gained...\"Han Sen ate the whole egg and was so full he couldn’t move. He had gained five sacred geno points. Adding the eight points he already had, Han Sen now had thirteen sacred geno points.It took Han Sen eight or nine days to reach Steel Armor Shelter. Son of Heaven and his gang had been back for two days already when he arrived.There were only eight in the gang that returned alive, and everyone was injured. Even some of Son of Heaven’s henchmen had died. Son of Heaven wouldn’t say what they had done, and Qin Xuan and Fist Guy failed to find out.Several hired thugs, however, had come back alive after they had fallen into the water. And through them, Qin Xuan and Fist Guy eventually learned what had happened. They still had no idea what had happened after the hired men fell into the water, so just took for granted that the gang was hurt by the obsidian dragons.Their guess was only half right, because the egg thrown by Han Sen also contributed a lot the gang’s predicament. After all, they wouldn’t have had to fight the dragons if he hadn’t done that.Son of Heaven was afraid of being ridiculed, and did not tell what happened later, while secretly he launched a new search for Dollar.\"It is a pity that Son of Heaven and Luo Tianyang didn’t die.\" Han Sen learned what had happened and felt relieved.He was afraid that Son of Heaven might suspect something, seeing he had returned alone.Now that there were other survivors, Han Sen naturally had nothing to worry about, and caught a primitive copper-toothed beast on his way back to the shelter. If Son of Heaven and his gang came to interrogate him, he could just say he was rushed downstream and got lucky.Han Sen was thinking too much, because Son of Heaven did not have the time to ask him and didn’t make the connection at all.More than half a month was spent on the expedition. Han Sen teleported out of God’s Sanctuary to see his mother and sister. However, at the gate of the transport station, Qin Xuan was standing at the exit, looking at him coldly.\"You sure can hide. It’s been more than half a month since I saw you. Do you think I’ll spare you from the punishment you deserve?\"\"Miss Qin, what do you want?\" Han Sen looked at her, depressed. Qin Xuan was now the stationmaster, and there was no way to bypass her.\"Easy, take this and come with me.\" Qin Xuan threw a combat suit at Han Sen.\"You would not kill me anyway,\" Han Sen thought, taking the combat suit and following her back to the station. They didn’t teleport to God’s Sanctuary but to the combat room in the station.Han Sen put on the combat suit and entered the room, where Qin Xuan stood in a red combat suit with black stripes.A combat suit was not just clothing, but a high-tech product that could function as armor, with in-built sensors which recorded all data during fighting, including heart rate, breathing, punch speed and the impact taken. This allowed the users to understand their physical status and determine their future practice methods.\"If you win, I will leave you alone for good.\" Qin Xuan curled her finger, indicating Han Sen should attack.\"You are about to max out on sacred geno points and have so many beast souls. I just graduated, and you have trained in the army for so long. Why don’t you just say you want to kill me?\" Even if Han Sen could win, he didn’t want to expose the fact that he was Dollar. And he wasn’t confident about the fight.\"No beast soul allowed. And we are clear if you can still stand after 50 movements,\" Qin Xuan said casually.\"Deal.\" Han Sen believed he could endure 50 movements if he focused on defense.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 24": "📕WuxiaClick🌙Home/Super God GeneCH 24Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayQin Xuan had made up her mind to kick Han Sen’s ass. The first time, when Han Sen stabbed her in the rear, she could attribute it to his ignorance, while the harassment on the train couldn’t be a coincidence.Having identified Han Sen as a freak and bastard, Qin Xuan walked up to him with anger in her eyes and said, \"You start.\"Bang!Han Sen punched her in the face. Clutching her nose and stepping back, Qin Xuan stared at him, not believing what had happened.Han Sen was not like any man she had seen. She let him start and he just immediately punched her, which was completely beyond her expectations. That’s why she was not prepared for it. They were standing close to each other, so she was hit on the nose.In her understanding, in a showdown, the two opponents should go to the middle and take their positions. And men always acted as gentlemen in front of her. Even if they were weaker, they’d still want to show their masculinity. No one was like Han Sen, who threw a punch without a sign, hitting her face, where she wasn’t even covered by protective gear.\"I'm sorry ... so sorry … have we not started?\" Hansen repeatedly apologized. He thought he’d let her beat him to let out the anger, and wanted it to end sooner. He didn’t expect that he could hit her nose, which soon turned red.\"We had started, and we’ll continue, you ... bang!\" Qin Xuan had more to say, but he acted hearing \"continue\" and hit her on the nose again. She was in so much pain she had to squat on the floor.\"You said continue, so I thought ...\" Han Sen quickly explained.\"I’ll kill you...\" Qin Xuan jumped from the ground. Not caring about the rules any more, she moved forward and started to beat Han Sen up.Resisting Qin Xuan’s beating, Han Sen found his fighting skills were much weaker than Qin Xuan’s, and he couldn’t even play defense. He barely got through a dozen punches and was beaten down.\"Way less than 50. See you next time.\" Qin Xuan turned away, leaving behind Han Sen, who was wounded all over.Han Sen stood up with a wry smile on his face. Wearing a combat suit, he wasn’t injured seriously. It was just some pain he would have to put up with. The worst part was he seemed to have enraged Qin Xuan even more.After Han Sen left the station to return home, Qin Xuan took a shower and was about to delete the video and data of the fight right away.She was the stationmaster and the strongest woman in Steel Armor Sanctuary. There was no way she’d let people see the video of herself being punched in the nose by Ass Freak.Before deletion, Qin Xuan watched it again, and she was momentarily shocked. She thought that the reason she was hit was that Han Sen took advantage when she wasn’t prepared.After carefully reviewing it several times, Qin Xuan suddenly found that although this was a very important reason, it couldn’t fully explain her being hit.\"Was it…,\" thought Qin Xuan, and repeatedly watched the part when he hit her and compared the data collected by the combat suit.\"So, his fist fighting skills are really poor, just about the normal level of a compulsory education graduate, but his movements were explosive and unexpected,\" Qin Xuan mumbled as she was checking the data. \"And there was something about him… like a killer… Before he made a move, I could not predict his intention, and that had left me unguarded. When he threw a punch, there wasn’t even the slightest change in his emotions, not even when he was hitting hard. The separation of behaviors and emotions should belong to a good assassin—a fatal blow under ordinary cover.\"\"No, he just graduated, and there is no way he is an assassin. Also, his movements were too bad for him to be one. So, this separation was just his innate talent?\" Qin Xuan could only think of this one possibility.What she didn’t know was that Han Sen was really poor when he entered God’s Sanctuary, at the time he offended both Qin Xuan and Son of Heaven.No one dared to be with him, and no one dared to trade with him. The new graduate started to hunt creatures using an ordinary alloy dagger, without any experience.Even just ordinary creatures posed great threats to a beginner, not to mention that they often came in groups, so Han Sen must have taken an individual creature by surprise and killed it. Once surrounded by a group, he could only wait to die.To minimize the danger, he had to ambush and attack, and the most important part was not to alert the creatures, who had more acute senses than men. In the first month, Han Sen was honing this skills.In failure after failure, he learned to hide his emotions and intentions, so that the creatures sensed no danger even when he approached.It was like playing dirty, but it was also the only way for him to survive at that pointLater, he had to keep practicing and improve his skills in order to kill primitive creatures, and gradually they became part of his instinct.Although Han Sen's fighting skills were not even close to advanced, he was no worse than a great assassin in his explosiveness and timing. Like an assassin, he skills were also honed between life and death, and the only difference was that it was the creatures instead of men that he killed.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 25": "📕WuxiaClick🌙Home/Super God GeneCH 25Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"He seems to have great strength, speed and explosiveness, which indicates that he has fairly high geno points, unless he is practicing hyper geno arts.\" Qin Xuan looked at some data, but didn’t worry too much about it.Han Sen's data was indeed better than average, but data like this can be seen anywhere in the shelter. It was only a bit unexpected that it belonged to Han Sen.\"Talented but vulgar and despicable. I’ll just teach him a lesson next time,\" thought Qin Xuan bitterly.Because of Han Sen's sneak attacks, she labelled him as despicable again. It was indeed hard for most people to imagine that Han Sen had integrated the sneak attack skills into his practice and instinct.The reason why Han Sen could hit Son of Heaven in the face was his sneak attack skills. Or else someone like him could never hit Son of Heaven, who had great geno points and hyper geno arts.Sneak attack didn’t sound good, but it was practical.When he got home, Han Sen had dinner with his mother and Han Yan. The next day, he did not go to God’s Sanctuary but took the train to a martial hall.Han Sen had only learned basic martial arts in the past, and those were designed for people who had no geno points.As one started to gain geno points in God’s Sanctuary, one became stronger in general. With the practice of hyper geno arts, the body had become even more unique, and this difference allowed people like him to practice certain martial arts that normal people could not practice.These martial arts can be learned at martial halls as well as at advanced colleges. And martial masters who worked at martial halls taught these for a living.Unlike in ancient times, these martial masters did not rely on their inherited fame, nor did they want to leave legacies. Their only goal was to make profit. So, the more money a student spent, the better martial arts were taught.Martial arts all had certain requirements for physical conditioning. If the requirements were not met, it wouldn’t be possible to practice.In the past, Han Sen had no money and no significant enhancement in his physical conditioning. Now with thirteen sacred geno points and lots of other geno points, he had become stronger. The practice of Jadeskin had also helped. Now his physical condition was among the best in his peer group..Ares Martial Hall was famous on Roca planet. The tuition there was very expensive, but the martial arts taught were very good. The owner of the martial hall was a veteran and was famous back in the days when he was serving. After getting severely injured in a battle, he went back to Roca to open Ares Martial Hall.Everyone called the veteran \"Old Devil.\" As long as you paid enough, he would teach you anything, and you could indeed learn some really good skills.\"Young man, want to learn something? We have elementary classes, intermediate classes, advanced classes and special classes here. You can learn fist fighting, weapon skills, and even hyper geno arts here. For an elementary class, you could choose to learn a martial art that I define as elementary for ten thousand dollars. For an intermediate class, you could choose a martial art that I define as intermediate for a hundred thousand. Advanced classes are each for a million, and special classes are each for ten million. At these prices, I could guarantee a good learning outcome. Fellow, you look like you have a bright future ahead of you. Do you want to sign up for all special classes? All twelve martial arts for only fifty million.\" Old Devil looked at Han Sen with a greedy smile, like a dragon looking at gold.\"I would like to sign up for an advanced class to learn Ghosthaunt.\" Han Sen came here for a reason. His Dad had learned from Old Devil and told him Old Devil has a great martial art called \"Ghosthaunt.\" Unfortunately, his Dad’s physical condition hadn’t reached the required level for Ghosthaunt, so he couldn’t learn it. He always had regretted that and asked Han Sen to learn Ghosthaunt when he grew up.Han Sen also heard from his father that Ghosthaunt was especially effective on women. Han Sen had once again offended Qin Xuan, and it didn’t look like she would let it go easily. Not willing to be bullied by her, he thought of his father’s words about Old Devil and Ghosthaunt and wanted to take the opportunity. After all, a million was a piece of cake for him right now.\"Although Ghosthaunt is among the most advanced, its requirements were even higher than those of special classes. You must at least max out on mutant geno points to stand a chance. How fit are you?\" Old Devil looked at Han Sen in surprise. No one had chosen Ghosthaunt in a while because of its high entry barrier.\"You can test me to see if I can meet the standards.\" Han Sen was not sure whether he would pass either. Technically, with 13 sacred geno points, he should be more fit than those who had maxed out on mutant geno points.\"Ten thousand test fee for a physical fitness test.\" Old Devil placed a card reader in front of Han Sen.Han Sen took out his credit card and paid ten thousand, and Old Devil was quite pleased by his generosity.After scanning and testing in a dozen instruments, the test result was out, which slightly surprised Old Devil, \"your physical fitness is very good. You must have almost maxed out on ordinary, primitive and mutant geno points.\"\"Can I learn Ghosthaunt? \" Han Sen gave no reply, as his mutant geno points were less than ten, and sacred geno points and Jadeskin would explain his fitness.\"Yes. One million.\" Old Devil did not ask further, placing the card reader once again in front of Han Sen.While a bit upset about spending his hard-earned money, Han Sen paid for it.\"Young man, you have great things lined up for you. Come with me. You’ll have to memorize Ghosthaunt first.\" Old Devil showed Han Sen into a screening room, turned on the hologram and left him alone in the room. It was Old Devil himself practicing Ghosthaunt in the hologram.Han Sen looked for a while, and his eyes widened. He thought to himself, \"Wow, so that’s what you mean by ‘especially effective on women,’ Dad!\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 26": "📕WuxiaClick🌙Home/Super God GeneCH 26Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayGhosthaunt should really be called skin-to-skin, as all movements were aimed at one thing, which was to stick on the opponent.Wrapping, blocking and winding, all sorts of movements allowed the body to act like a snake to tightly trap the limbs of the opponent, so that there was no way for the opponent to attack.If the opponent was a woman, with the practice of Ghosthaunt, one would be able to feel her up. If it was a normal woman, she would feel overwhelmed in just a few movements.\"If I were to use Ghosthaunt to fight Qin Xuan, she would consider me even more of a pervert. Han Sen suddenly regretted picking this martial art to learn. However, the tuition was non-refundable.\"Well, I’ll just learn it first and see.\" Han Sen calmed down and started to carefully watch and memorize Ghosthaunt.With a closer look, Han Sen found that the martial art was not so nasty as it had seemed at first. There were indeed a lot of advanced skills, especially in wrestling and close combat. Many were very practical and could save a life at critical moments.It did indeed have high requirements for fitness, especially for flexibility. Even for those who had maxed out on mutant geno points, it would be somewhat difficult to meet the requirements.The reason Han Sen was able to pass, in addition to his sacred geno points, was Jadeskin training, which had greatly enhanced his flexibility.The teaching method of Old Devil was straightforward. You could learn the movements from his pre-recorded hologram, and then he would correct you where you made mistakes and remind you where you should be more careful. He could be reached via comlink, and his replies were detailed. Although he charged a lot, he was very engaged in teaching. With a strong body, Han Sen was able to start practicing Ghosthaunt in half a month.But only to get started was not enough. Martial arts that required close combat like this were the most dangerous. If not a master, one could be easily killed in the actual battle. Han Sen would never hunt creatures or fight with others in God’s Sanctuary using Ghosthaunt before he mastered it.\"Qin Xuan, if you leave me alone, I’ll let it go. If you insist on giving me a hard time, I will have to use you to practice Ghosthaunt,\" thought Han Sen.When he came to the teleport station, Han Sen still did not want to see Qin Xuan. Looking around from time to time, he didn’t see her until he entered God’s Sanctuary.In his room at Steel Armor Shelter, the primitive copper-toothed beast had become a mutant creature.Han Sen decided to let it keep evolving into a sacred-blood creature.At the gate of the shelter, the gang of Son of Heaven was gone. It had been half a month since Han Sen left God’s Sanctuary, so Dollar was never spotted. They weren’t very patient, so they just left.In fact, Son of Heaven had been aware that it was useless to guard the gate, as they didn’t know what Dollar really looked like. So even if he did walk in front of them, they wouldn’t be able to recognize him.Han Sen left the shelter and went into the mountains, ready to find a remote place to hunt.After entering the deep forests, human footprints became scarce. Han Sen summoned his armor when he was alone and went further into the mountains.Han Sen no longer bothered to hunt ordinary creatures. He would just chase them away or ignore them. And was only interested in hunting rare primitive creatures for food.Now Han Sen had maxed out on ordinary geno points and had over 80 primitive geno points, so he didn’t really need commonly-seen primitive creatures.Now what he really needed was mutant and sacred-blood geno points. Han Sen wanted to complete his evolution with all four types of geno points maxed out. It would be really slow if he used only the black crystal to do this.\"For primitive creatures, I don’t even need to do the hunting. The mutant beast soul I got from Qin Xuan was a pet. It should be able to kill some primitive creatures if summoned.\" Hen Sen looked at the beast soul in the shape of a black cat that he got from blackmail.Type of beast soul of mutant three-eyed cat: pet.Han Sen summoned the mutant three-eyed cat, and a little black kitty the size of his palm appeared. It was rubbing at the foot of Han Sen, looking just like a normal pet cat with its tiny body and wide eyes.\"Could such a little thing kill those creatures?\" Han Sen picked it up to take a look, not convinced that a cute thing like this possessed great strength.But then he thought, size didn’t necessarily matter. Since it was a mutant beast soul, it must be able to hunt primitive creatures.Seeing some primitive triangular-scaled beast wandering nearby, he ordered the cat, \"Go kill the triangular-scaled beast.\"The little guy meowed and got up its nerve to streak toward the triangular-scaled beast, biting it on the tail.The triangular-scaled beast hesitated and looked back at the cat. Throwing up its tail, the triangular-scaled beast then whipped the cat away like a basketball.The mutant three-eyed cat screamed and ran behind Han Sen's feet, shivering.\"She tricked me! No wonder she didn’t even blink when she gave me this. It’s a useless beast soul.\" Han Sen stared at the cat hidden behind him with widened eyes.Han Sen tried a few times more, and the cat was indeed of no use, not even able to beat the weakest primitive creature, a copper-toothed beast. Chased around and running, it was not like a mutant beast soul at all.Suddenly, Han Sen thought of the type of beast soul. According to his knowledge, the beast souls that can be summoned to fight on their own were normally either fighters or mounts, while he knew nothing about pet beast souls.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 27": "📕WuxiaClick🌙Home/Super God GeneCH 27Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"What the heck is a pet beast soul? It’s not just for fun, right? I was really tricked by Qin Xuan. What am I going to do with it?\" Han Sen’s heart sank, and he killed the copper-toothed beast that was chasing the cat. When he was about to take the cat back, it started to meow around the body of the copper-toothed beast with its mouth watering.\"Go ahead.\" Han Sen looked at the mutant three-eyed cat curiously. Normal fighter beast souls and mount beast souls didn’t have to eat, and they could just recover in a vacuum once injured.Receiving the approval from Han Sen, the cat rushed to the corpse and started gnawing, but it was clear that its teeth and claws were not sharp enough to break down the skin.Depressed, Han Sen peeled the skin off, sliced the meat with a dagger and fed it to the cat. And this little thing sure could eat. The copper-toothed beast was at least twice its size and it managed to eat all the flesh. Lying on the ground with a full belly, the cat could barely move and Han Sen was almost worried about it.Helplessly shaking his head, Han Sen took the cat back and decided to research the use of a pet beast soul on Skynet when he got back home.Mutant creatures were not so easy to find. Han Sen had been in the mountains for more than half a month, and did not encounter any mutant creatures. He did find quite a few primitive creatures new to him and now had more than 90 primitive geno points.Hunting alone in the mountains was quite boring, so Han Sen would summon the cat to play with and feed for fun when he was resting.The protection from the black beetle armor allowed him to practice Ghosthaunt even when hunting primitive creatures.Although he was still not skilled at it, he noticed the strengths of this martial art, especially in wrestling. It was very easy to use, and would incapacitate the creatures in a short time. However, close combat can be dangerous, and there were a few times when he used the wrong movement and could have been killed by the creatures.For over a month in the mountains, he had not found a single mutant creature, while he made a lot of progress in using Ghosthaunt.Later, Han Sen no longer needed to rely on his armor when hunting primitive creatures.One of his biggest gains was that he finally maxed out on primitive geno points.Thinking of the fact that he was struggling for ordinary geno points just a few months ago, he was suddenly in a great mood and started to make a fire and barbeque some meat.\"Help ... Help...\" Han Sen was sharing the barbeque with the mutant three-eyed cat he named \"Meowth\" when he saw a guy in ragged clothes running toward him, crying for help.He quickly got up and looked over there. With just one look, Han Sen abandoned the meat on the ground, took back Meowth and started to run.\"Buddy, please help me! I’ll give you money, however much you want,\" cried the man while running.\"You can keep your money.\" Han Sen did not turn his head and ran desperately.You first needed to be alive to spend money, and there were at least a hundred mommo beasts chasing him. Although mommo beasts were only primitive creatures, they each weighed more than a dozen tons and had the toughest skin. If hit or trampled by one, his internal organs would probably be shattered even with his armor on, not to mention there were so many of them.Even if Qin Xuan, Son of Heaven and Fist Guy were all here, they’d have run under such circumstances.\"Buddy, not so fast! Give me a hand and I will thank you!\" Behind Han Sen, the man was out of breath.\"I’m in danger as well. Just pray!\" After running for a while, Han Sen saw a cliff ahead of him with green vines hanging, grabbed a vine and started climbing up.The benefits of the gained geno points and practice of Ghosthaunt were showing. Han Sen was in the air with just a bit of climbing and jumped on a large stone platform extending from the cliff.Seeing Han Sen climbing up, the man also ran over and wanted to follow him.The man was either too weak or too tired, so he slipped down after a few tries.\"Buddy, help!\" With the mammo beast less than 30 feet from him, the man was about to cry out.\"Hang on!\" Han Sen grabbed the vine the man was holding on to and started pulling hard. Overjoyed, the man climbed with all fours, leveraging Han Sen’s strength. When he was 30 feet from the ground, he heard mammo beasts running into the cliff.Han Sen and the man felt as if even the mountains were trembling. With pulling and climbing, the man was finally on the platform.Once on the platform, the man lied down as if he were paralyzed, while breathing heavily, unable to speak.\"Friend, what on earth did you do to them?\" Han Sen looked down at the mammo beasts running into one another. They wouldn’t even leave after they got up, roaring at the platform.But they couldn’t climb up as they were even bulkier than elephants.\"Do not mention it. Worst luck ever.\" The man calmed down, fished out a packet of cigarettes from his pocket, lit one and offered one to Han Sen, \"You saved my life and I, Lin Beifeng, will always remember. I will show my gratitude after returning to the shelter.\"\"Best with cash.\" Han Sen looked at the cigarette and knew the man must be rich. A packet of Schwarzwald cigarettes cost more than ten thousand, and there was no need to be modest with such a wealthy guy.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 28": "📕WuxiaClick🌙Home/Super God GeneCH 28Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"Buddy, what’s your name?\" Lin Beifeng threw a lighter at Han Sen.\"Han Sen.\" Han Sen caught the lighter and lit the cigarette. Made from the tobacco produced from Schwarzwald, the cigarettes were harmless to the body and especially refreshing.For those who were risking their lives in God’s Sanctuary, the Schwarzwald cigarettes were definitely heaven-sent.\"Sen, trust me, when we are back at the shelter, you can have as much money as you want. Problems that can be solved by money are no problems for me...\"They chatted for awhile, and Han Sen understood what had happened. Lin Beifeng was not only rich, but super rich. He was also lucky to be assigned to a shelter where he had very close acquaintances. So he bought a whole lot of mutant beast souls: armor, weapons, mounts, fighters, etc. He also hired a group of people to hunt with him, wanting to hunt a sacred-blood creature. With his great luck, they indeed caught a sacred-blood creature, but what happened after was not so lucky. The people he hired either died or escaped, and he just went running into the mountains. After all sorts of danger, he had managed to survive, but lost almost all the beast souls he bought. If it was not for Han Sen, he would have been killed by the mammo beasts.\"Sen, how far is our Glory Shelter from here?\" asked Lin Beifeng.\"It’s your Glory Shelter.\" Han Sen laughed.Lin Beifeng was shocked. \"Sen, are you joking?\"\"I came from Steel Armor Shelter, and it takes two weeks to return there.\"\"S#*t! I’m really in the range of another shelter.\" Lin Beifeng was very depressed.He had friends in Glory Shelter, and it was easy for him to buy flesh and beast souls. But it was likely that no one knew him at a different shelter, so even with money it would be hard to buy advanced flesh and beast souls.\"Hey, what did you do to the mammo beasts? They are being so persistent.\" Han Sen looked down again and the mammo beasts were still there, roaring and standing on their hind legs, trying to climb onto the stone platform.\"Uh, I was walking and got hungry. So I saw a young mammo beast grazing, and...\" said Lin Beifeng bitterly.\"It was unfortunate. It seems that we are trapped here for some time, so before they leave, let’s be nice to each other.\" Han Sen laughed.\"Right, let’s do that.\" Lin Beifeng smiled agreeably and approached Han Sen, \"Sen, I’m so thirsty. Can I drink from your water bag?\"\"Ten thousand per cup,\" Han Sen said, narrowing his eyes.\"S#*t! What happened to being nice?\" cried Lin Beifeng.\"You are paying, I’m selling. Isn’t that nice?\"\"But your water is too expensive. It is even more expensive than water from Planet Snowspring. And ten thousand can buy a few bottles of that. It can’t be water from Planet Snowspring that you have,\" Lin Beifeng glanced at Han Sen's water bag and said.\"Although this is only water from a pool, we do not know how long we’ll be trapped here. Water is life at this point, and we’ll die within a week without water. And you think it’s not worth it? \" Han Sen smiled.\"It’s worth it... but my wallet was lost on the way. Could you give it to me on credit and I’ll pay you double when we arrive at the shelter,\" Lin Beifeng said.\"We don’t know each other, and you still owe me the life-saving fee. And now you want to get water on credit. You are making this so hard for me.\" Han Sen looked indecisive.\"Triple... no... quadruple...\"\"Deal.\"Han Sen took out his own cup and poured Lin Beifeng a cup of water. Lin Beifeng drank the water in a gulp and gave the empty cup back three times for more water.\"That’s it for today. I don’t have much water and need to save. We still don’t know when the mammo beasts will leave.\" Hansen put the water bag away when Lin Beifeng asked the fourth time.\"Sen, you are so strong, so brave and so impressive that you are able to hunt alone deep in the mountains.\"\"What do you want?\" Han Sen rolled his eyes.Lin Beifeng approached Han Sen and said, \"Sen, my beast soul was completely destroyed on the way here. Now I feel so insecure with no beast soul on me. Do you have extra beast souls to sell?\"Speaking of beast souls, Han Sen had killed quite a few primitive beasts in recent days and had gained no beast soul. He might have used up his luck on the two sacred-blood beast souls he got.\"No beast soul. Would you like some primitive meat jerky?\"\"Yes, of course.\"\"Ten thousand per piece.\"\"Sen, this is such a small piece!\"Trapped on the stone platform for eight days, they still didn’t feel like the mammo beasts would ever leave.\"We cannot wait any longer. We must find a way out,\" Han Sen told Lin Beifeng solemnly.\"We still have some food and water. Let’s wait. And maybe the herd is about to retreat.\" Lin Beifeng had a lingering fear about the mammo beasts.\"We still have water and food, as well as physical strength. When we have used up everything, we would stand no chance,\" Han Sen said.\"But how is it even possible with such a herd?\" Lin Beifeng said bitterly.\"So we will have to climb up.\" Han Sen pointed to the cliff above.Lin Beifeng looked at the cliff standing straight into the clouds and suddenly shuddered, \"Are we capable of doing this?\"\"We have to. It beats waiting to die, and we don’t have to climb over. If we could climb up a bit and find somewhere to stand, we could just walk around and go down on the other side of the cliff,\" Han Sen said.\"Sen, I agree,\" Lin Beifeng quickly said.\"Great. We will start to climb now using the vines.\" Han Sen grabbed a vine, made sure it was tough enough and began climbing.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 29": "📕WuxiaClick🌙Home/Super God GeneCH 29Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"Sen, you are so fit! You must have maxed out on mutant geno points. \" Lin Beifeng stopped climbing as he felt his arms hurting too much, while Han Sen was still climbing briskly.\"Hang in there. There is a rock sticking out up there, and we can go there and rest.\" Han Sen looked down at Lin Beifeng.\"Sen, I can’t. Shall we just go back down?\"\"You stay here. I will go up first and then pull you up with the vine.\" Han Sen started to climb with all fours, and he was so fast it looked like he was walking on the ground, which stunned Lin Beifeng.It took a little while for Han Sen to reach the rock and use the vine to pull Lin Beifeng up. The rock was the size of a table. The two huddled on the rock and looked around. The cliff was so steep and there was no way to climb if it wasn’t for the vines, which only covered a part of the cliff.\"Sen, let’s stay here for two days and maybe the mammo beasts will leave if they don’t see us. The cliff is so steep and I’m not as fit as you. I really can’t go up,\" Lin Beifeng said anxiously.\"Well, you just rest here, and I’ll go see if there is a way out. If there is, I’ll come back for you. If not then we could just wait for the mammo beasts to leave,\" Han Sen said and got up to climb.\"Sen, you will not abandon me?\" Lin Beifeng grabbed Han Sen's clothes like a little girl.\"Don’t worry. How can I abandon you when you owe me so much money?\" Han Sen patted Lin Beifeng on the shoulder and climbed away.Because he had practiced Ghosthaunt, Han Sen was particularly good at climbing. As he was much stronger now, it wasn’t too hard for him either.Han Sen climbed for a few hundred feet and still saw nothing but the cliff. The vines continued to go up, and he was wondering where their roots were.Han Sen felt a little tired and was thinking about going down. But with another look, he felt like there was a rock sticking out above him.\"I’ll climb up to the rock above and have a look. If there is no way out, I’ll just go down to eat and drink. Maybe we could outrun the mammo beasts,\" Han Sen decided, and kept climbing.The stone was farther and larger than Han Sen had imagined. It was half the size of a basketball court. When he got on the stone, Han Sen’s eyes suddenly widened.On the stone was a nest made with tree limbs and vines. It looked like a huge swallow’s nest, almost taking up a better half of the stone. An egg at least three feet tall lay in the nest.\"Wow, such a big egg! How big would the creature that laid it be?\" Han Sen shuddered. The creature was not here now, but he dared not think what would happen if it came back.Being big did not necessarily means it was advanced. Mammo beasts were huge but merely primitive creatures.However, the ability to make a nest and lay an egg on the cliff proved the creature was no average creature. It could very likely be a sacred-blood creature.If the egg belonged to a sacred-blood creature, Han Sen would not want to miss it.After some hesitation, Han Sen approached the egg and cut a hole in the egg shell with the tip of his dagger. Fishing out a straw from his pocket, he stuck it in the hole and started sucking.Suddenly the sweet juice filled Han Sen’s mouth.\"Sacred-blood creature stormbird’s egg eaten. No sacred geno point gained.Although no sacred-blood geno point was gained, the fact that the egg was indeed a sacred-blood creature left Han Sen in joy.It was such a huge egg, with at most only ten sacred geno points, that he was not surprised that he hadn’t gained a point with just a mouthful. And he already had some sacred geno points and couldn’t have all ten points, so he could only get six or seven if he was lucky.But sacred geno points were so hard to get that even just a few more would help.Han Sen was desperately sucking the liquid with the straw that he used to drink from his water bag when he was hiding from the creatures that he didn’t have to move. It was unexpectedly handy as well for sucking the egg juice.The egg was so big that when Han Sen finally heard the cue that he was gaining one sacred geno point, he was so full that he could drink no more. Han Sen pulled out the straw, and then sealed the hole with mud. Putting the straw back, he descended using the vine.\"Sen, what took you so long? Is there a way out?\" Seeing Han Sen coming from above, Lin Beifeng, who had been worried sick, asked immediately in a low voice so as not to alert the mammo beasts below.\"No. It is as steep as a mirror, and we have nowhere to go.\" Han Sen shook his head.\"Then we have no option but to wait for the herd to leave,\" Lin Beifeng said disappointedly.\"It’s alright. We still have some food and water left.\" Han Sen was really taking his time now as he couldn’t finish drinking the raw egg any time soon, and he wouldn’t leave before that.They huddled on the stone to spend the night, and the next morning Han Sen climbed up to eat more egg. He made sure there was no creature in the nest before he went up and broke the seal to drink from the egg.\"Sen, why are you climbing up again?\" Lin Beifeng wondered when Han Sen came down.\"There are sacred-blood creatures above, and I was having a feast up there. Do you want to go together?\" Han Sen laughed.\"You can keep it.\" Lin Beifeng glanced at him and didn’t believe a word he said. Even if there really were sacred-blood creatures, Han Sen was more likely to be their food.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 30": "📕WuxiaClick🌙Home/Super God GeneCH 30Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen climbed up every day to steal some egg juice and never met a sacred-blood creature returning to the nest. Han Sen thought the egg’s parents might have been hunted already. But to be safe, every time he finished drinking from the egg, he would return to where Lin Beifeng was instead of staying inside the nest.Lin Beifeng just assumed that Han Sen was going up to find a way. When they had waited for two or three days, Lin Beifeng looked down, and with the fog he wasn’t sure if the mammo beasts had left.\"Sen, how about we go down a bit and check if they have left?\" Lin Beifeng couldn’t handle the heat during the day and coldness at night on the cliff anymore.\"Let’s wait for two more days to be safe. If they see us now and guard the place for another week, we will run out of food.\" Han Sen's geno points were higher, so he had heard the mammo beasts leaving the previous night. But he didn’t want to go now, as he hadn’t finished the egg.Lin Beifeng felt that made sense, so he held on.However, after two days, Lin Beifeng still saw Han Sen making his daily climb. The vines only covered a small part, and if Han Sen was just exploring the way, he should have done that already, so why did he keep climbing?\"What is it?\" Lin Beifeng wondered, yet he still did not believe there could be sacred-blood creatures.\"Sen, why is it that you climb every day?\" Lin Beifeng could not help but ask.\"I told you, there are sacred-blood creatures, and I’m going up to eat,\" replied Han Sen.\"Would you take me with you?\" Lin Beifeng did not believe Han Sen's words but was very curious.\"OK!\" Hanson smiled, grabbed a vine and started climbing.Lin Beifeng followed him up, but he was so weak that he stopped halfway and asked, \"Sen, I’ve gotta stop. Where are you going?\"\"We are almost there. Wait here and I’ll pull you up.\" Han Sen climbed up like a gecko.In a short while, Lin Beifeng saw a vine thrown from above. Tying himself to the vine, he borrowed Han Sen’s strength and climbed.When he reached the stone, Lin Beifeng was stunned by the size of the egg. \"My God, such a big egg. Is it sacred-blood?\"\"Yes, this is a sacred-blood creature’s egg.\" Han Sen nodded.\"Gee, it really is a sacred-blood egg. Sen, you are amazing.\" Lin Beifeng was pleasantly surprised. He smashed the egg with a fist and wanted to drink.Stretching his tongue out and waiting, Lin Beifeng saw no egg juice flowing out and smashed a few times more, making a big hole in the eggshell.\"Where is the egg juice?\" Lin Beifeng looked blankly inside the hollow eggshell.\"I drank it.\" Han Sen blinked.\"You drank it?\" Lin Beifeng looked at Han Sen.\"A few days ago, I told you that and invited you to join me. I thought you didn’t want to come.\" Han Sen spread out his hands.Lin Beifeng regretted so much that he was ready to kill himself right then. \"Sen, I had no way of knowing you were telling the truth. Who could have imagined a sacred-blood egg on the cliff? If I knew, I would have come, even if I had broken all my limbs.\"\"Beifeng, don’t worry. I’ll inform you next time I find a sacred-blood egg.\" Han Sen smiled and patted him on the shoulder.\"Sen, next time such good things happen, you must remember to let me know. Money is not a problem, and I promise I will never say no to you again.\" Lin Beifeng was upset.\"I promise.\" Han Sen made such an effort to bring him up just to hear these words from him. People like Lin Beifeng made great customers.Lin Beifeng sighed for a while, smashed the eggshell and carried it with him. He wanted to see if he could boil some sacred geno points from it.\"Not in a hundred years,\" Han Sen chuckled to himself.When they got to the bottom of the cliff, the mammo beasts had left already, so the two went back to Steel Armor Shelter.When they were about to arrive, Hen Sen smiled and said to Lin Beifeng, \"Beifeng, my reputation is not that great here, so I won’t go in with you. I’ll see you around.\"Lin Beifeng quickly said, \"Sen, what do you take me for? We have been through death together, and I’ll kill whoever is disrespectful to you.\"\"It’s fine. I have to go and want no trouble. Just enter alone.\" Han Sen would not believe someone as glib as him, so he waved goodbye and entered the shelter first.The stormbird egg added five more sacred geno points to Han Sen, which were fewer than he had expected, but it was a surprise in itself, so it was still great. Now Han Sen had 18 sacred geno points.It was a shame that he didn’t get a beast soul from it, but it was quite normal, since killing ten creatures wouldn’t even guarantee a beast soul. Han Sen just got lucky previously.Han Sen happily returned to his room, and was teleported out of God’s Sanctuary. Before he left the station, a slim figure blocked his way.\"Stationmaster! Such a coincidence.\" Han Sen groaned inwardly. He had totally forgot about his discord with Qin Xuan.\"Come with me,\" Qin Xuan said coldly, walking toward the combat room. She was upset that Han Sen had been able to hit her last time and wanted to kick his ass before she could let it go.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 31": "📕WuxiaClick🌙Home/Super God GeneCH 31Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"I’ll just fight her. She’s just a woman after all,\" Han Sen whispered to himself.Han Sen knew that Qin Xuan would not leave him alone no matter how he restrained himself. So he would no longer do that. He had almost mastered Ghosthaunt, and it would be great for him to practice it on her.When Han Sen stood in front of Qin Xuan in a combat suit, she didn’t spare any effort and kicked him with a leg sweep.For Han Sen, who was good at sneak attacks, as long as he had no chance to sneak up, he was doomed to lose. Hence Qin Xuan hit first and didn’t give Han Sen any chance.But she had still committed a great mistake: she still didn’t take Han Sen seriously enough and did not regard him as an opponent. All she wanted to do was to kick his ass. That’s why she didn’t use even half her strength.In her mind, he was still the ignorant Ass Freak, a rookie who could be bullied by anyone in the shelter.Qin Xuan did not really want to harm Han Sen, so she wasn’t hitting hard.But what she didn’t know was that Han Sen now had 18 sacred geno points and was practicing Jadeskin. Although not as fit as her, the gap between them was not so big either.Seeing her leg sweep, Han Sen moved to a spot where Qin Xuan couldn’t reach and twisted her leg with his arms. She immediately lost balance and fell to the ground.Han Sen immediately pressed himself against her and locked her limbs down.Qin Xuan hadn’t expected such nifty moves from him, and when she realized her mistake, she was trapped and couldn’t wriggle free.Feeling anger and shame, she struggled and failed because of the clever techniques of Ghosthaunt. If she struggled with all her strength, her arms would be dislocated or even broken. Trapped by Han Sen, she blushed and still couldn’t believe Han Sen had taken her with the first move. She wanted to teach him a lesson, and everything went wrong.\"Stationmaster, did I win?\" Han Sen was secretly pleased. \"I did not expect Old Devil’s teaching to work. I even beat Qin Xuan.\"\"You will never win.\" Qin Xuan raged and refused to throw in the towel.If it was anyone else, it might be fine. But for this despicable Ass Freak, she would not bow her head.Qin Xuan roared and shapeshifted into a golden lion taller than a man. Han Sen was thrown off her instantaneously, and the lion swooped down at him.\"Foul! We have agreed not to use any beast souls,\" Han Sen quickly shouted.Qin Xuan paused as her lion paw was about to hit him. She did promise last time that she wouldn’t use beast souls. But under the circumstances, she had completely forgotten about it.\"Alright, no beast souls.\" Qin Xuan secretly blushed, took back her beast soul and launched an attack with her fist.Han Sen still hadn’t completely mastered Ghosthaunt, and his fitness and experience fell short compared to Qin Xuan. Although he resisted over 20 movements from her, he was still beat.Qin Xuan did not say anything and turned away. In fact, she felt ashamed because if she hadn’t used her beast soul, she couldn’t have gotten rid of Han Sen. So, she had already lost at that moment.\"I’m still not strong enough. My geno points and fighting skills were not even close to hers.\" Han Sen knew that he couldn’t have caught up with the best in Steel Armor Shelter in such a short amount of time, while he was still a little disappointed that he couldn’t even take 30 movements from her.Qin Xuan was still blushing after a shower. She was truly abashed that she was put in such a tough situation by Ass Freak.\"Something is wrong. Although his wrestling skills were not bad, he couldn’t have locked me down without great fitness. How did he gain so many geno points?\" thought Qin Xuan suddenly. She quickly called out the data collected in Han Sen’s combat suit.Qin Xuan clenched her lips and cursed bitterly, \"That bastard, he must have maxed out on his mutant geno points already. He was just playing weak to make me underestimate him. Ass Freak, I’ll never make peace with you.\"From then on, every time Han Sen passed the teleport station, Qin Xuan would always call him into the combat room.Han Sen was glad to oblige. Wrestling skills such as Ghosthaunt really need much practice, and with a training partner as good as Qin Xuan, he could not really hone his techniques. Some pain was nothing compared to his gain.If it was not for Qin Xuan, Han Sen could only practice when risking his life, which was far more dangerous than his fights with her.Of course, Han Sen was careful so that she didn’t notice he was using her. Each time he would get on her nerves on purpose so that she would keep calling him to the combat room.Qin Xuan picked on Han Sen many times but still didn’t get over it. Every time she saw his smiling face, she would get mad and have an urge to beat him up. It almost became a habit of hers.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 32": "📕WuxiaClick🌙Home/Super God GeneCH 32Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayThe copper-toothed beast fed by Han Sen had become purple in color and bigger in size two months after it had become a mutant creature.\"Whether I could keep rising in the world all depends on you. Please become a sacred creature soon.\" Han Sen looked at the purple color of its skin and thought it was about time.Judging from the situation, it would take about three months for a mutant creature to evolve into a sacred-blood creature. This period was neither too long nor too short. It was almost impossible for most people to hunt a sacred-blood creature in just three months. Even Qin Xuan might not have been able to hunt a sacred-blood creature for a year.Now with this black crystal, Han Sen could have an entire sacred-blood creature to his own every three months, which was simply incredible.\"Just give me enough time, and I could easily evolve with all four types of geno points maxed out. By then I will gain the title of sacred-blood aristocrat for sure.\" Han Sen was getting excited.He did not see Qin Xuan at the teleport station on his way home. She could be either tired of this game or simply busy.Outside the station, he saw a girl standing at the roadside and stopped walking.It was Xue Xi, the girl who grew up with Zhang Danfeng and him.Xue Xi was from a single-parent family, and her mother had raised her by working at Han Sen’s father’s company. With no one to babysit her, her mother had often brought her to work, and she had always played with Zhang Danfeng and Han Sen.Later, Han Sen heard that Xue Xi’s father was still alive and found her mother and her. After his Dad’s incident, Han Sen didn’t have the energy to learn more about her family. But he did hear that she was an illegitimate daughter and her father only took her back after his wife passed away.\"Sen!\" Xue Xi also saw Han Sen and exclaimed.\"Why are you here?\" asked Han Sen, puzzled.\"Sen, I’m over 16 and can enter God’s Sanctuary now,\" Xue Xi chuckled and said.\"So fast?\" Han Sen was startled. In his mind, Xue Xi was a little girl, and now she could even enter God’s Sanctuary.\"I'm only a few months younger than you. Don’t think of me as a child,\" Xue Xi said discontentedly.\"Indeed. How time flies!\" Han Sen looked at her well-developed body and smiled. She was no longer a little girl.Xue Xi blushed as Han Xin looked at her. When she was about to say something, there was a roar of an engine, and they saw a well-dressed young man coming down from a private aircraft parked on the roadside.The young man was about 20 years old, and that private aircraft alone was worth more than ten million.\"Sister, I said earlier to use our private teleport equipment. It’s just inevitable that we should meet some annoying people at a teleport station.\" The young people did not even look at Han Sen and went straight to Xue Xi.\"Brother, he is my childhood friend,\" Xue Xi quickly explained.\"Well, we should go back.\" The young man ignored her explanation, took her hand and led her on the aircraft.\"Sen, I’ll come back,\" Xue Xi said to Han Sen softly before she went.The young people returned to warn Han Sen: \"People like you aren’t worthy to be her friend. Leave her alone or you’ll be sorry.\"\"Are you talking to me?\" Han Sen glanced at him.\"You don’t believe what I said?\" The young man suddenly stepped forward, and quickly hit Han Sen’s lower abdomen with a knee.He was very close to Han Sen, and he was incredibly fast. His knee suddenly came toward Han Sen.Han Sen looked calm, but secretly sneered. \"Nothing is better for wrestling than Ghosthaunt. Even Qin Xuan dares not let me get close now.\"Leaning to one side, Han Sen avoided his knee and stuck a leg behind his leg on the ground. Han Sen’s also clamped the young man’s neck and pulled hard.Bang!The young man suddenly lost his balance and fell to the floor.Lying on the ground, he looked at Han Sen in shock and forgot to get up. He didn’t expect his hit would be in vain, and couldn’t believe he was pulled down by Han Sen.\"Sen, what happened?\" Seeing things going wrong, Xue Xi ran down from the aircraft and quickly helped the young man up.\"Nothing, just a ritual between men. It is late and I need to go. Let’s eat together sometime.\" Han Sen smiled, waved goodbye and went to the train station.\"Brother, you alright?\" Xue Xi asked the young man.\"Interesting... really interesting...\" The young man watched Han Sen leaving with a strange smile.Seeing the young man smiling, Xue Xi was suddenly anxious. \"Brother, don’t pick on him. He didn’t mean it.\"\"He could make me fall even when he didn’t mean it. If he meant it, then would I, Fang Jingqi, be killed?\" he said with his eyes narrowed.\"Brother... that’s not what I meant...\" Xue Xi panicked and did not know how to explain.\"No worries sister. As he said, it was a ritual between men and I shall return the favor.\" Fang Jingqi stared frantically in the direction where Han Sen went. \"In a few days, please invite him to dinner at home.\"\"What?\" Xue Xi looked at Fang Jingqi and could not believe her own ears.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 33": "📕WuxiaClick🌙Home/Super God GeneCH 33Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen didn’t go far to hunt these days. He was on his own, so unless he went somewhere no one would go, it wasn’t likely he could find mutant or sacred-blood creatures before the gangs of Qin Xuan, Son of Heaven or Fist Guy did.Han Sen went on the Skynet and logged into a forum called \"Polar Night\" whose members were people from different planets currently struggling in God’s Sanctuary. Here, people from the same shelter could exchange information and needs. Although the Alliance had a similar official site, it was much easier for people to go on Polar Night because all you needed was a username. On the official site, you’d need to register with your real identity.Not wanting anyone to know his identity, Han Sen went to the section of Steel Armor Shelter, where there were a lot of posts—roughly a 1,000 or more per day.He went through the postings, most of which were buying or selling information, and then there was some recruiting information. For example, the rich would spend money to hire some people from the same shelter to protect or help the child.Recently, Han Sen's luck had been poor. Not only couldn’t he find any mutual creatures or sacred-blood creatures, he also failed to gain any beast souls. So, he decided to work for money.Han Sen browsed for a while and saw a job posting that paid well. He was surprised to see it was Lin Beifeng who posted it. Han Sen hadn’t seen him since the last time they met. It was unexpected that he had also posted in Steel Armor Shelter.Lin Beifeng was not only recruiting good men, but also making offers for beast souls and mutant creature flesh. He wanted all the good things, and was willing to pay for them. People who answered his thread were mainly just onlookers. After all, the demands for mutant creature flesh and beast souls were so high that no one would sell easily.Han Sen browsed a while and turned to other threads, and soon he found a satisfactory job.There were several young people who had just entered God’s Sanctuary hiring a skilled hunter to help them kill primitive creatures. The requirement was to be able to deal with ten primitive creatures and protect them at the same time, alone.In a word, this was a babysitting job: Watching these rookies fight primitive creatures and save them when they encountered danger.This job was not difficult, but quite troublesome. Generally speaking, the experienced would not take such a job. But these young men were paying well, ten thousand to protect them each day, and one contract was for at least half a month.Han Sen sent a text message to the number they had left and didn’t leave voicemail or send an image of himself. He didn’t want his personal information to leak out, and that was why he had chosen Polar Night. He could’ve gone to the official site, where everything was regulated and protected by law, but he would need to sign the contract with his real identity.After a while, he received a reply, which said they had to see how well he could fight before deciding to hire him. Han Sen had no problem with that and agreed to meet at a certain time and place in Steel Armor Shelter.After agreeing to meet, Han Sen did not close the window but continued to browse the trading section. After his bronze crescent spear was destroyed, he had wanted to hunt himself a weapon beast soul, but he had had no luck with a beast soul at all.Han Sen wasn’t trying to buy a weapon beast soul but a man-made alloy bow and arrow.Alpha alloy weapons could now easily kill primitive beasts, but not mutant creatures. They were not cheap either, and normally even more expensive than primitive beast souls.Han Sen could use most of the weapons, but he had worked hard on archery since he had planned to hunt alone at a distance before he entered God’s Sanctuary. But he overlooked something. He couldn’t afford any good bow and arrows, and without those, he couldn’t even pierce the skin of any creature.Now he had earned some money and it would be possible for him to purchase an alloy bow and arrows. And he wanted to start hunting with archery. It was, after all, both a safe and powerful way of hunting.The most important thing was that, in God’s Sanctuary, only the one who launched the last hit had the chance to gain the beast soul. And archery must be among the top three methods when it came to the potential windfall.Archery required special training, so most people preferred swords and knives. There weren’t many posts about selling a bow and arrows.Han Sen was trying to save money, so he wanted to buy some second-hand goods. The alpha alloy bows all cost more than a million, which was too expensive for him.The silver lining was that due to the unpopularity of archery, there were not many competing buyers either. Han Sen noticed a post from seven days ago written by someone who was about to go to the Second God’s Sanctuary and planned to sell all his belongings. All the stuff was sold except for an alloy bow and six alloy arrows.\"A bow from the Black Vader series and arrows from the Saber series!\" Han Sen had practiced archery for a while and carefully studied all types of bows and arrows.To make weapons, the alloy didn’t necessarily need to be the stiffest, because if it was too stiff, the edge could chip. However, stiff alloy didn’t wear out easily.Bows and arrows were no exceptions. There were three types alloy used in a Black Vader bow. Two were mixed to make the bow itself in order to guarantee its flexibility and stiffness at the same time. And the alloy used in making the string was even more special, its manufacturing methods monopolized by a few interstellar metal production companies.The Black Vader series was a classic series of alloy bows, and the prices were overwhelming. The cheapest one, Wanderer’s Bow, cost two million, with no arrows or quiver included in the price.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 34": "📕WuxiaClick🌙Home/Super God GeneCH 34Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayThe bow for sale in the post was \"Doomsday\" in the Black Vader series, which cost 6,680,000 dollars in the store. Its farthest range could reach 2,400 feet. Using this bow, Saber arrows could pierce steel armor and the skin of most primitive creatures from more than 900 feet away. However, one would need to have a 7.0 strength rating to draw the string of Doomsday.Normally only those who had maxed out on mutant geno points could reach a 7.0 strength rating, and this requirement was only to draw the string. Unless you could kill with only one shot every time, so that you didn’t need a second draw, you would need a rating of more than 8.0 to use the bow.Generally, if one had maxed out on original, primitive and mutant geno points, one’s strength rating would reach 10.0, but many would choose to complete evolution and go to Second God’s Sanctuary before their rating reached 8.0.\"No wonder no one would buy this bow, those with the ability to use the bow wouldn’t care about such a small amount of money and try to save with a second-hand weapon. Those who couldn’t use it wouldn’t bother to buy it either.\" Han Sen sent the poster a message and offered one million for the bow and arrows, which altogether would probably cost more than seven million at a store.He had only kept two out of the six million he earned from selling the golden axe and gave the rest to his mother. Having spent a million learning Ghosthaunt, he wasn’t sure if he could purchase the bow and arrows with just one million.The poster didn’t reply. He was either offline or didn’t want to dignify his offer with a response. Han Sen waited for more than half an hour and almost lost hope. He checked other posts and found nothing.\"Well, some cheap stuff will have to do for now. Maybe I can get an arrow beast soul in a few days,\" Hansen comforted himself and went into the shower.When he was back in front of the screen, he found the poster had sent a message to him, which only contained a webpage of a well-known trading site, where the price was marked as one million.Han Sen almost jumped with joy and paid for the items after confirmation.Soon the item was shipped, and would reach Planet Roca the next day.God’s Sanctuary could be used as a transfer station for transporting goods produced in the Alliance, so many transactions between different planets were completed this way, and it was also much faster than interstellar spaceship.The next morning, Han Sen got a package from a robot postman. After signing for it, he couldn’t wait to open it.The black and purple metal bow had a bow string like a silver line. Holding the bow in his hands, Han Sen immediately felt powerful. The bow was also carefully kept and looked almost like new except for a small scratch.Six brand new Saber alloy arrows were gleaming with a cold shine. To Han Sen's surprise, they even came with a matching quiver. It was used, but there was no damage.\"A bow in my hand, the world is mine. I won’t have to risk approaching it the next time I steal a sacred-blood creature from Son of Heaven.\" Han Sen stroked the bow and laughed.With no shooting range nearby, Han Sen could only try to draw the string a few times. It was indeed quite heavy. Even with his strength, he could only draw a dozen times before his arms started to ache.\"Not bad.\" Han Sen was pleasantly surprised. He hadn’t tested his strength recently, but his rating must be more than 8.0 now, or else he couldn’t have used this bow so well.Han Sen went to a weapon shop nearby and bought 20 Thunder arrows and 20 Skyfall arrows. The quiver that could hold 50 arrows still looked a little empty, even with the arrows in it.Although these arrows had impressive names, they were in fact cheap. Each Thunder arrow only cost a thousand, and only the arrowhead was made of alloy. It was too stiff and would chip easily on bones or shells.Skyfall arrows were even cheaper, a hundred each. They looked like Saber arrows but didn’t function that well. Han Sen only bought Skyfall arrows to practice with, as Thunder arrows were too easy to break and the six Saber arrows were too expensive to be used for practicing.Han Sen played with his new bow, Doomsday, for quite a while and fell in love with it. When it was almost time for him to meet his young clients, Han Sen took his bow and arrows and entered God’s Sanctuary.When he arrived where they were supposed to meet, he saw dozens of people surrounding several young men in biological armor and realized that he wasn’t the only candidate.Walking around to earn ten thousand easy dollars per day seemed to be a great deal for many. After all, a primitive creature was only worth several hundred, and it also took energy to hunt and move the dead creature around.Han Sen frowned at the crowd and was ready to turn away. He just wanted to find an easy job to earn some money. With such competition, he’d rather look for another job.When he was ready to leave, Han Hao and a few people came together. It looked like they were also coming for the young men.\"Well, well, Ass Freak himself here, looking sharp with the bow and arrows. Did you come to protect the masters as well?\" a young man next to Han Hao ridiculed him, with a tone of exaggeration.His remark got the attention of the crowd, as Ass Freak was well-known in Steel Armor Shelter. People suddenly started to heckle Han Sen.\"Ass Freak, who do you think you are?\"\"Ass Freak, can you even beat the original creatures?\"\"It’s more likely that the young masters will need to protect him.\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 35": "📕WuxiaClick🌙Home/Super God GeneCH 35Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayAss Freak was so infamous that a torrent of scornful abuse was lavished on him. The young men who were paying came to them, and one of them with harsh, angular features curiously looked at Han Sen and said, \"You are the legendary Ass Freak?\"\"Yes,\" Han Sen answered casually. He did not think it was a bad thing, because in the entire Steel Armor Shelter, he was the only one who had ever stabbed Qin Xuan in the butt. This was a kind of achievement in a sense.The young man was obviously curious about Han Sen. Suddenly he said, \"You are also here for the job?\"Han Sen nodded: \"If you don’t like the idea, I can go right now.\"\"No, if you do not have any questions, we can sign the contract right here,\" the young man quickly said.A roar went up in the crowd as they heard the young man’s decision. Even the young man’s friends looked surprised. They pulled the young man to the side and said, \"Yuan, that’s Ass Freak. What are you going to do with him?\"\"That’s right, Yuan. If we are in danger, he will probably run even faster than us. It’s just a waste of money.\"\"I’ve hired him, and you can choose the rest,\" the young man named Yuan insisted and signed the contract with Han Sen.The others didn’t say much after that and selected several more candidates who looked experienced. Han Hao showed them his mutant beast soul weapon and was chosen. The two coming with Han Hao showed some skill and got the job as well.\"Ass Freak, you got lucky thanks to your young master’s kindness and curiosity,\" Liu Feng, one of the two, said when walking past Han Sen.\"My luck has always been good,\" Han Sen said faintly.The clients had selected ten experienced men to protect them in hunting primitive creatures. With such a team, they could even hunt primitive creatures by herd.Those who had been hired were in a good mood and tried to flatter the clients all the time. They clearly understood the background of these young men who were paying them.The clients actually had very good fighting skills, and they must have graduated from posh schools. Although they had just entered God’s Sanctuary, their fitness and skills were much better than Han Sen’s when he had just arrived. They were only lacking the experience of hunting.When the clients were hunting primitive creatures, Han Sen was just practicing archery on the side. Initially he had chosen to practice archery because it was less demanding than other weapons. He was unlikely to be able to learn advanced techniques of sword or knife fighting in the public education system, while all he needed for archery was accuracy.Han Sen was still getting to know the performance and characteristics of Doomsday, so he had selected some of the trees nearby as his targets to practice on.\"Ass Freak, you are just taking up space. Why are you shooting in vain and ignoring our clients?\" Liu Feng was confused by Han Sen’s behavior and looked at his shots contemptuously. \"You can’t even shoot something within 60 feet.\"Han Sen did not look at Liu Feng or reply to him. He was just trying the arrow and did not focus on one target, and that was why his shots looked messy.\"Just let him be. It was just a charity act. Our clients didn’t expect him to help at all,\" other hired hands laughed.\"That is true. Just be grateful, Ass Freak!\" Liu Feng spit and joined the rest.\"Do not say you know me,\" Han Hao found a chance to whisper to Han Sen and went back to laugh with his friends.The clients were making incredible progress. In the beginning, they needed some assistance, while they soon became better and could hunt some rather vicious primitive creatures one-on-one. Indeed, posh schools had great teaching outcomes.Those who were in integrated compulsory education wouldn’t dare to hunt primitive creatures alone with no previous experience.It went so well that everyone lost their vigilance. When the clients were hunting three primitive spotted beasts, one of the beasts played dead and attacked a young client when he approached it.Han Hao and others didn’t expect this, and the spotted beast was too close to the client for them to rescue him. In an instant, the claws of the spotted beast were on the delicate neck of the young man.The young client was horrified, regretting that he wasn’t wearing his alloy helmet. But it was too late for that. Everyone watching screamed in horror.Whoosh!An arrow flew by the client’s face and hit the spotted beast in the left eye. The beast whimpered and fell to the ground.Han Hao and the rest swarmed to the spotted beast and cut its corpse into pieces.\"Ass Freak, why did you shoot the arrow? You almost hurt Qing!\" Liu Feng turned around and scolded Han Sen.Other people all followed him, criticizing Han Sen. They were secretly ashamed, but instead of self-reflection, they chose to blame Han Sen. In their view, Han Sen just shot the beast by pure luck, because Ass Freak could never be so good at anything.\"Get lost!\" Yuan suddenly shouted with a dark face.\"Did you hear that Ass Freak? Yuan just asked you to go,\" cried Liu Feng.\"I’m letting you go.\" Yuan stared at Liu Feng coldly. \"I paid you to protect us, and what did you do when Qing was in danger? Nothing! And you even tried to blame the only person who did his job. All of you, get lost, and I don’t want to see you again.\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 36": "📕WuxiaClick🌙Home/Super God GeneCH 36Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"Yuan, you can let us go, but according to our contract, this is a breach. You will have to pay us the rest of the money,\" sneered Liu Feng.\"Just go.\" Yuan threw a few stacks of money at them and didn’t look at them again.Liu Feng and the rest picked up the money. Although they were angry, they didn’t dare to harm the clients because they knew who these young clients were. They gazed at Han Sen and said, \"Misters, we are far from the shelter, so please be careful, as you are trusting someone unreliable.\"\"He is a hundred times more reliable than you,\" Yuan replied.The hired ones didn’t dare to express their anger in front of Yuan, so they just left.\"Ass... your arrow was so powerful...\" commended Qing after the rest were chased away. He didn’t want to call Han Sen Ass Freak but awkwardly discovered that he didn’t know his name.\"His rating must have reached 7.0 to use Doomsday. Of course it was powerful,\" said Yuan.\"7.0? But they said that he...\" Qing and the other clients looked at Han Sen and his bow, unconvinced.After all, the story of Ass Freak was so well-known that even they knew about it.\"I mean at least 7.0. He shot so many arrows in practice, and if his strength hadn’t reached 8.0, it would certainly not be so easy for him,\" Yuan said, looking at Han Sen.\"8.0!\" They were even more surprised and kept looking at Han Sen as if they hadn’t seen him before.Anyone with an 8.0 rating would be rather advanced in First God’s Sanctuary, so they couldn’t believe Ass Freak would be so strong.\"Let me try your bow?\" One client still didn’t believe Yuan’s words.Han Sen smiled and handed Doomsday to him. The young client held it with both hands and tried to pull the string, but the string didn’t even move. He tried a few times more and still failed to draw the string. Although they graduated from top schools and had practiced hyper geno arts as kids, their bodies hadn’t been modified by geno points, so their strength could reach 3.5 at best, which was far below the requirement to use Doomsday.\"You are so weak. Let me.\" Another client could not stand to watch and grabbed the bow. He too had failed after a few tries.Everyone gave it a shot except for Yuan, and none could draw the string. Only then had they felt impressed by Han Sen.Archery was practiced by very few people and required a lot of effort. So most people didn’t know much about bows and arrows, let alone how good Doomsday was. For example, Han Hao and his friends had no idea that Han Sen’s bow was worth millions, or they wouldn’t have ridiculed him like that.The clients stopped underestimating Han Sen, not least because Han Sen also had saved Qing’s life. They asked his name and called him \"Sen\" from then on.After all, God’s Sanctuary was a world where only the strong were respected, and Han Sen's archery and strength were truly impressive.\"Sen, would you show us real archery skills?\" Qing proposed. All the other clients looked at Han Sen with great anticipation.\"My archery skills are just ordinary,\" Hansen laughed.\"Don’t be modest. When one is being too modest, one is actually proud,\" Qing said.\"OK, I will try to shoot then.\" Han Sen also itched to exercise his skills. Since he received Doomsday, he hadn’t tested its limits yet.The clients were overjoyed. Han Sen looked around and walked to a hillside. He aimed at something and slowly drew a Saber arrow. As he drew the string, blue and swollen veins popped on his arms. The arrow left the string in the blink of an eye and disappeared in the woods.\"Did he miss?\" Qing and others didn’t hear any prey being hit and thought he had missed.\"It is too far away. The woods must be at least 400 yards from here. It is understandable to miss,\" said Qing.\"Come on, let's go and find out,\" Han Sen said and walked down the hill into the woods.The clients followed with suspicion. A hundred meters into the woods, they saw a spotted beast nailed on a tree with an arrow through its head.\"No wonder we did not hear a thing. The arrow directly destroyed the nerves of the spotted beast and it didn’t even have time to shriek.\" Everyone was so impressed. It was at least 400 yards from where Han Sen had been standing, and the beast was killed with just one shot. Han Sen’s archery must be among the best in First God’s Sanctuary.After that, all the clients worshiped Hansen and did everything he said. Han Sen protected them for half a month and received 150,000 in cash.The clients wanted to sign a long-term contract with Han Sen, but he declined. He was only short of money at the moment. In the long run, he still needed to focus on his own evolution.Han Sen returned to Steel Armor Shelter alone and was stopped by those who had been chased away by Yuan at the gate. These men were led by Liu Feng, and Han Hao was also among them.\"Ass Freak, you have really pissed me off. How can you make it up to me?\" asked Liu Feng, cracking his knuckles while slowly approaching Han Sen.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 37": "📕WuxiaClick🌙Home/Super God GeneCH 37Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayA crowd of spectators started to gather. They were used to seeing Han Sen getting bullied.\"How do you want me to compensate you?\" said Han Sen calmly, watching Liu Feng approaching him.\"Let me kick your ass,\" Liu Feng said, throwing a punch at Han Sen’s face.Liu Feng’s punch was fierce and fast. If Han Sen was hit, his nose would be smashed.When everyone was thinking that he would suffer, Han Sen leaned his body and dodged the punch. Meanwhile, he tripped Liu Feng with his leg and made him fall on his face.Liu Feng fell so hard that his nose was bleeding and his eyes were watering. Burning with anger, he drew his alpha alloy broadsword from the sheath and slashed it toward Han Sen. \"Little scum! How dare you resist? I’ll kill you.\"Han Hao had mixed feelings watching this. Although he despised Han Sen, Han Sen was still his cousin, and Han Hao felt terrible watching him being bullied and perhaps getting killed.But if he helped Han Sen and people knew him to be the cousin of Ass Freak, how could he stay at Steel Armor Shelter?Having hesitated for a while, Han Hao turned his face to the side, deliberately avoid seeing Han Sen. Han Hao thought that he would immediately hear Han Sen’s screams, but the screams he heard were not from Han Sen, but from Liu Feng.Han Hao quickly turned to see what had happened and couldn’t believe his own eyes. Liu Feng’s alpha alloy broadsword was now in Han Sen’s hand and Liu Feng himself was pinned to the ground with his arm twisted behind himself, screaming while too scared to struggle.Han Hao did not see how it happened, but others all saw clearly. They were so surprised that they stood there with their mouths wide open.When Liu Feng slashed his broadsword at Han Sen, everyone thought Ass Freak was doomed. But as soon as Liu Feng wielded the alpha alloy broadsword, Han Sen grabbed his hand and twisted, bringing Liu Feng to his knees. Han Sen then knocked his back with a knee and held him down to the floor.No one could believe that Ass Freak would have such fine movements and were all in a daze. There was no sound except for Liu Feng’s screams.\"What are you doing? Kill this bastard... Ouch!\" Liu Feng shouted to the onlookers while screaming.Crack!His arm was broken by Han Sen before he could even finish the sentence. Covered in cold sweat, Liu Feng was deathly pale.Liu Feng’s friends saw this and rushed to Han Sen, raising their weapons. Hen Sen was still holding Liu Feng’s alpha alloy broadsword in his hand, and used it to block the first alloy weapon swung at him. To his surprise, the weapon was cut in half by Liu Feng’s broadsword instantaneously.\"This dumbass had a really nice alpha alloy broadsword. It’s at least worth one or two million,\" Han Sen thought and decided not to give it back.In a short while, all the other weapons were cut off by Han Sen, and their owners were scared off. No one dared to attack Han Sen anymore.Han Hao was stunned, almost thinking he was in a dream. Liu Feng had a strength rating of 6.7 and a nice weapon, so he enjoyed quite a lot of attention in Steel Armor Shelter.Although Han Hao had a mutant beast soul weapon, he knew he could not match Liu Feng. All of a sudden, Liu Feng became the one lying on the floor without his weapon, while Han Sen became the winner. The change was so drastic that Han Hao couldn’t process it.\"Hadn’t he been isolated by both Qin Xuan and Son of Heaven since he entered the shelter? Didn’t he fail to hunt even a primitive creature? Didn’t he...\" Han Hao looked at Han Sen blankly, with a variety of complex emotions entangled in his mind.Han Sen did not continue the fight with the rest, but went back to take Liu Feng’s sheath away, hung the sheath on his own belt, and returned his new broadsword to his new sheath.\"The next time you want compensation, just come to me,\" said Han Sen as he strode toward the gate of Steel Armor Shelter. The onlookers all looked at him as if it was the first time they saw him.\"Stop!\" Someone approached riding a beast soul mount when Han Sen was about to enter the gate. It was Luo Tianyang, Son of Heaven’s henchman.\"Luo, Ass Freak broke my arm and seized my broadsword. You have to avenge me,\" shouted Liu Feng in delight at the sight of Luo Tianyang.\"Douchebag.\" Luo Tianyang first glanced at Liu Feng and then at Han Sen. \"I was wondering who was so daring to hurt my guy. So, it was you, scum.\"Luo Tianyang took out his alloy whip, and whacked it at Han Sen.Han Sen paused and wielded his broadsword at the whip. When the two weapons collided, Han Sen and Luo Tianyang both shuddered.Luo Tianyang suddenly shouted, \"How come you have such strength?\"Luo Tianyang's own strength rating had reached 9.6. Although with this whack he did not use all his strength, Han Sen must have had at least an 8.0 rating to be able to block his whip, which he could not believe.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 38": "📕WuxiaClick🌙Home/Super God GeneCH 38Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"This person must die.\" Luo Tianyang suddenly had an urge to kill Han Sen and was about to raise his whip again. When he looked at Han Sen, however, he stopped and his whole body became tense.Han Sen had put away the broadsword and held Doomsday in his hands. Drawing the string to the fullest, he pointed the arrowhead at Luo Tianyang.Although Luo Tianyang did not recognize Doomsday, thanks to his rich experience of fighting, he could smell danger from Han Sen and his bow and stayed completely still.The two were into a deadlock—Luo Tianyang did not dare to move, and Han Sen did not have the confidence to kill Luo Tianyang with only one shot. Even time seemed to stand still.The onlookers were completely shocked. When Han Sen beat Liu Feng and his friends, they simply couldn’t believe it, and now he was even well-matched with Luo Tianyang?Luo Tianyang was one of Son of Heaven’s henchmen, his strength rating was near 10.0, and even he didn’t dare to move with Han Sen’s arrow pointed at him.Anyone with a strength rating of more than 9.0 would be among the top 100 in Steel Armor Shelter, where there were more than 100,000 people. That someone like this could be scared by Han Sen was an overwhelming fact to all. No one knew how Han Sen could gain such strength when isolated by both Qin Xuan and Son of Heaven.\"Han Sen, put down your bow,\" said Qin Xuan, leading her gang, who were all riding beast soul mounts.Han Sen put away his bow and arrow. His strength was still weaker than Luo Tianyang, and Han Sen was not sure if he could shoot his opponent when Luo had his guard up. Keeping the posture was consuming his energy very fast, and the deadlock was not good for Han Sen.\"Miss Qin, I’ll kill this bastard for you,\" said Luo Tianyang, whipping at Han Sen, who had already disarmed himself.Han Sen seemed to be prepared for this and was about to block the whip with Doomsday. Before he acted, a beast soul bronze sword was thrown over and hit the whip. The strength of the throw was so fierce that the whip fell from Luo Tianyang’s hand.\"I will discipline my guy, and you can mind your own business.\" Qin Xuan looked at Luo Tianyang coldly and summoned back her sword before she rode into the shelter.\"Follow me,\" Qin Xuan turned back and commanded Han Sen.Han Sen quickly caught up with her and followed her gang into the shelter.The entire Steel Armor Shelter was suddenly in an uproar. Ass Freak beat Liu Feng and his friends, was well-matched against Luo Tianyang and was, most importantly, declared by Qin Xuan to be her guy. All the news had driven everyone mad.No one understood what had happened: it was all guesswork.\"Did they develop a love affair from the stab?\"\"I have to learn from Ass Freak and stab a beautiful and capable woman in the ass. Maybe I can become rich and powerful.\"\"Qin Xuan looks so serious, but she is actually a flirt.\"Rumors spread across the entire Steel Armor Shelter, and Han Sen was once again put under the spotlight.However, Han Sen's strength was not really the focus. People cared more about whether he was Qin Xuan’s boy toy. Even Qin Xuan’s gang would look at Han Sen weirdly.\"You know archery?\" asked Qin Xuan after she called Han Sen to a hall.\"I used to practice,\" Han Sen shrugged.\"You can use Doomsday, so you must’ve worked hard on it,\" said Qin Xuan matter-of-factly. \"You can join Bullseye and follow me in the future.\"\"No,\" Han Sen refused.Qin Xuan bite her lips and said snappily, \"You just offended Luo Tianyang. Without my protection, do you suppose he’d let you live?\"\"Thank you for your kindness, but I will deal with it myself,\" Han Sen said indifferently.\"You should have known who I am. My men are more or less related to the military, and Bullseye belongs to me. Follow me and you will gain great advantages when applying for military schools,\" Qin Xuan suppressed her anger and said to Han Sen.\"I never wanted to go to a military school.\" Han Sen knew that he could apply to a military school for further education after he finished integrated compulsory education. However, all military schools had high requirements of fitness. If one’s fitness index was below 10 before the first evolution, one had no chance at military schools. For Han Sen, to reach 10 in the fitness index was not hard, but he wasn’t interested in going to school at all. He’d rather put more effort into hunting.Exasperated, Qin Xuan said, \"Without education from military school and an aristocratic title, you could only be an ordinary soldier when you are of age to serve. Only through a military school can you become something in the army. At least by then you wouldn’t have been sacrificed.\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 39": "📕WuxiaClick🌙Home/Super God GeneCH 39Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"Let’s talk about this another time. I have to go now, and thank you so much for all your help. I’ll buy you dinner sometime,\" said Han Sen, ready to go back.He knew that what Qin Xuan said made sense, but he had his own plan. He wanted to get an aristocratic title before he turned 20 and went to serve, because aristocrats had certain privileges in the army and would not be sent to the front.\"Stop! Have I excused you?\" Qin Xuan stared at Han Sen fiercely.\"Stationmaster, please, that’s not my thing,\" said Han Sen bitterly.\"It’s fine if you don’t want to go.\" Qin Xuan suddenly smiled at Han Sen and said, \"If you do not go, each time you enter the teleport station, I will fight you.\"Looking at her evil smile, Han Sen’s heart sank.He knew that Qin Xuan hadn’t tried her best at all when fighting with him in the past, because he was no match for her at the moment. Judging from her expression, he knew if he declined, he would really have a hard time in the future.\"I’ll just join Bullseye then,\" Han Sen said, depressed.Qin Xuan snapped at Han Sen, \"Do you have any idea how many people in Steel Armor Shelter want to join my gang? And you just acted like I’ve asked you to take poison!\"\"Freedom is priceless, and to lose my freedom is exactly like taking poison,\" Han Sen sighed.\"Then you could die a slow death. Even if you died and became a ghost, you’d still be my ghost,\" Qin Xuan pouted and said.Han Sen knew that Qin Xuan had made up her mind, and he accepted the offer unwillingly. Feeling dejected, he left the hall.Qin Xuan watched him go and was very pleased by his upset look for some strange reason. She couldn’t help but smile.\"Stationmaster, why do you have to recruit such a person to our Steel Armor Gang? He’s not worthy of being a member of Bullseye,\" a woman of the same age as Qin Xuan came out from a side door and asked after Han Sen had left.\"Manli, trust me, although this guy can be a bastard sometimes, he does have great potential in some aspects,\" Qin Xuan told Yang Manli seriously.Qin Xuan had witnessed what a fast learner and diligent student Han Sen was. Repeatedly defeated by her, he didn’t go down but grew stronger and stronger. Now even she had to take him seriously. Such progress and mentality were truly amazing.Qin Xuan’s opinions of Han Sen had improved a great deal, or else she wouldn’t have defended him in front of everyone.Han Sen returned to his room and teleported back home before Qin Xuan had the chance to leave God’s Sanctuary.He was not the least interested in going to a military school. Before, it would have been a great option for him, because he could learn hyper geno arts there. Now, with Jadeskin, he didn’t have to waste his time in a military school at all.It would be much wiser for him to spend time hunting and increasing his geno points.As for Bullseye, Han Sen had even less interest in joining. Although as a member of Bullseye he could gain assistance from Qin Xuan’s information network to improve his chance of finding mutant and sacred-blood creatures, he would also have to share the meat hunted with the rest of her team.Han Sen decided to go hunting alone after some preparation. If Qin Xuan didn’t see him for a while, she would probably forget about the whole thing.Han Sen had wanted to buy an alpha alloy dagger with the 150 thousand he had earned, but now he had the broadsword he seized from Liu Feng,so the other was no longer necessary.The broadsword was made of a special alloy with Z-metal, which made it very stiff. Its edge could easily cut primitive creatures open. So weapons made from this kind of alloy had always been expensive.\"Nice!\" Hen Sen touched the edge and his finger was cut immediately. Looking at the shiny edge, Han Sen loved the weapon so much he couldn’t put it down. \"It’s worth the price,\" he thought to himself.The Han family had an alloy business before, and although it was a small factory, they had unique formulas. Their products might not be as good as this broadsword, but could also cut open the skin of some primitive creatures. So the business was quite profitable.If it was not for those terrible family members, their company could surely be among the top three on Planet Roca. But now the company had been bought by Starry Group.Han Sen was too young back then, and to this day he still didn’t quite understand why Starry Group had to acquire their company. He knew his father’s death must have had something to do with Starry Group, but he had no ability to find out the truth, so he had to lay low.\"Son, today I have something important at work. Can you take Yan to school?\" Luo Sulan knocked on the door and asked Han Sen.\"School has started already? I did not know that. No worries Mom, I’ll take her,\" Han Sen quickly said.\"School started a few days ago, and you were in God’s Sanctuary so I didn’t want to bother you,\" said Luo Sulan.\"Which school is it?\" asked Han Sen.\"It is Saint Paul, and I used to the money you left to pay the tuition.\" Luo Sulan felt slightly uneasy, as she had spent almost all the money on Yan’s school.\"Great! Saint Paul is the best on Planet Roca except for the posh schools.\" Han Sen was very happy. He didn’t have an aristocratic title for the moment and couldn’t send Yan to a posh school, but a good private school is still much better than integrated compulsory education.After chatting with his mother, Han Sen took Han Yan on a maglev train to school.The entrance of Saint Paul was almost blocked by private aircrafts, and some of them were deluxe. Almost all rich people without an aristocratic title would send their children to Saint Paul. And almost all students here were from affluent families.Walking his sister to school, Han Sen saw a middle-aged fat guy getting off an aircraft with a flirtatious woman on his side and an eight-year-old boy in his arms.He paused, as the middle-aged fat guy happened to be his uncle, Han Lei.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 40": "📕WuxiaClick🌙Home/Super God GeneCH 40Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"What are you doing here?\" Han Lei was surprised to see Han Sen here.\"Taking Yan to school,\" replied Han Sen.\"Yan is coming to Saint Paul?\" Han Lei looked at Han Sen and Han Yan, unconvinced.\"Since a few days ago.\" Han Sen said, ready to walk Han Yan into the school gate.Han Lei thought for a while and ran in front of Han Sen. He grabbed Han Sen’s wrist and raged, \"I knew it! My elder brother managed the company for so many years, he must have embezzled lots of money. You were just lying to me about not being able to come up with two million, while you are now spending millions to send Yan to Saint Paul. I’m telling you, this money belonged to the whole family, just like the house. We must split it, or I’ll…\"\"Or what? What can you do about it?\" Han Sen looked at Han Lei coldly. He was completely disappointed in his relatives and wouldn’t give them a cent more.\"Boy, watch it. I’m your uncle.\" Han Lei flinched with Han Sen watching him, but he didn’t plan to let Han Sen walk free.\"Uncle?\" Han Sen smiled dismissively. \"Well, please go home and review the legal documents we signed and see if you have the right to anything we own. From now on, do not think you can take a penny from us ever again.\"The reason why Han Sen gave them two million so promptly was to draw a line between his relatives and his real family. To get the two million, his relatives all signed a document prepared by Mr. Zhang which made it impossible for them to take anything from Han Sen’s family in the future.\"That is fraud! I’ll go find your Mom right away. How dare you hide money from us...\" cried Han Lei angrily.\"Uncle, don’t even think about it. I have the right to kill a trespasser.\" Han Sen looked at Han Lei gloomily.\"Little brat, how dare...\" Han Lei threw a punch at Han Sen furiously.With a blank expression, Han Sen grabbed Han Lei’s arm and threw Han Lei over his own shoulder. Han Lei shouted out in pain.\"Uncle, if you want to die, welcome to our house.\" Han Sen stared at Han Lei coldly.Han Lei opened his eyes wide, as if he didn’t know Han Sen. The look on Han Sen’s face had terrified him.Han Lei was an evolver, although just by maxing out on primitive geno points. He didn’t really do much in Second God’s Sanctuary, but he was still an evolver. It was abnormal that Han Sen, who hadn’t evolved at all, could give him a shoulder throw easily. His nephew suddenly looked like a different person.Han Sen suddenly smiled and pulled Han Lei up.\"I’m sure my aunt doesn’t know about this woman and child. I think I should talk to her,\" Han Sen whispered, while Han Lei was still shocked by his sudden change.\"You think my wife will believe you?\" Han Lei said madly.\"That doesn’t matter, as long as she believes this.\" Han Sen showed Han Lei the comlink on his wrist. He turned the video camera on the moment he saw Han Lei.\"You...\" Shocked, Han Lei reached to grab the comlink.Han Sen only moved slightly to make Han Lei fall again.\"Uncle, we can negotiate a price, and I can sell you this.\" Han Sen smiled and was about to pull him up again.Han Lei grinned and suddenly reached to twist Han Sen’s hand, ready to break it and seize his comlink.Han Sen flipped his hand and held Han Lei’s hand down, making him kneel on the floor and howl like a pig.\"Uncle, it seems that you have no intention to negotiate. I’ll have to show it to my aunt then.\" Han Sen released Han Lei's hand and turned to leave.\"Wait.\" Han Lei quickly stopped Han Sen and gritted his teeth. \"Ten thousand. I’ll give you ten thousand, and you delete it.\"Han Sen turned away. \"Two hundred thousand, or I’ll go to my aunt.\"\"Okay, okay,\" said Han Lei, limping over to take hold of Han Sen.\"Thanks then, cash or bank transfer?\" Han Sen asked with a faint smile.Han Lei unwillingly transferred two hundred thousand to Han Sen, \"Well, now can you delete it?\"\"Of course I will delete it, but only when I’m in a good mood,\" Han Sen said and walked away.\"Brat, you lied to me...\" Han Lei became furious and raised his fist. However, he froze at the sight of Han Sen, as his nephew’s movements had really left a strong impression.\"Uncle, I received your money so I will certainly delete it, but I did not say when I will do it. So you’d better keep me in a good mood.\" Han Sen patted Han Lei on the shoulder and stopped smiling. He whispered, \"Also, do not let me see you in my home again, otherwise I will kill you.\"Han Lei shuddered, and for some reason, he knew Han Sen meant it.\"S*#t! The brat has become so evil,\" Han Lei cursed as Han Sen moved away. Ashamed that he was terrified by a boy, Han Lei was still nervous deep down and changed his mind about going to Han Sen’s home.After sending Yan to school, Han Sen was in a great mood. On his way back, he saw a physical test center and went in, wanting to know his current physical fitness level.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 41": "📕WuxiaClick🌙Home/Super God GeneCH 41Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayIn the unevolved test hall of the physical test center, Zhao Boshan looked at \"A-level\" displayed on the virtual screen and was secretly feeling proud of himself.In order to get A-level in the test, an unevolved person must reach more than 10.0 in at least 100 items, including strength, speed, quickness, leaping ability, muscle toughness, bone strength and organ function.With A-level fitness, one was also very likely to be admitted into a military school, as long as one didn’t make a huge mistake during the entrance exam.In his fantasy, Zhao Boshan had already graduated from a military school with stellar scores and become a captain of an interstellar warship, directing battles in the space and receiving respect and worship after all his victories.\"I didn’t do that well in the live combat test. If I had done better, I might be assessed at AA-level. Maybe I’ll try again.\" Zhao Boshan went back, but found the test hall he had used was occupied.Zhao Boshan thought the testing process was quite short, so he decided he might as well wait there. But after he had waited for quite a while, the person inside still hadn’t come out.\"So slow! This person inside must be stupid? If I had gone to a different hall, I would’ve finished by now.\" Zhao Boshan was quite upset but not willing to give up.Zhao Boshan gave it some thought and paid to observe the test. Suddenly, the holographic image was projected in front of him.\"I wonder how dumb this person could be to take so long.\" Zhao Boshan looked to the golden figure in the holographic image. That person in the image was about to take the final test, the robot channel.The robot channel was the last part of the entire test. In the 300-foot-long one-way channel, one had to beat a combat robot with biochemical alloy shell every six feet, and the performance of combat robots was stronger and stronger toward the end.As an unevolved, being able to cross the 180-foot line was \"pass,\" 210-foot line was \"good,\" 240-foot line was \"excellent,\" 270-foot line was \"advanced,\" and going all the way was \"super.\"Zhao Boshan had earned a \"good\" score himself, but he might be able to pass the 240-foot line if he put in more effort.\"This is weird. How come it took him so long?\" Zhao Boshan felt strange, as all the tests before this one should have taken the same amount of time. What he didn’t know was that Han Sen actually took each test twice, the first time without beast souls and the second time with beast souls, so as to know his abilities under different circumstances.That’s why it took Han Sen so long. In fact, Han Sen had already been through the robot channel twice. This time, he summoned black beetle armor and bloody slayer at the same time and wanted to try the robot channel one last time under his best conditions.When Zhao Boshan saw clearly the golden figure, he was amazed by how great the bloody slayer and black beetle beast souls looked.\"S*#t! This guy wants to use beast souls to take the robot channel test. Well, even so he could hardly go all the way, unless...\" While Zhao Boshan was still thinking, the majestic golden figure had rushed toward the robot channel.Boom!What happened next rendered Zhao Boshan speechless. The golden figure ignored all combat robots trying to block him and forcefully went through with his strong body. The combat robot, which was much heavier than the man, was knocked away immediately.The golden figure was like an armored vehicle, brutally hitting his way through the combat robots. Even the robots’ biochemical alloy shells were smashed. Nothing could stop that figure.30 feet... 60 feet... 90 feet... 180 feet... 210 feet... 240 feet...Zhao Baoshan knew that the performance of the combat robots placed behind the 240-foot line was beyond the ability of average unevolved persons. But they were smashed by the golden figure as if they were a pile of clunkers.The robot channel that was viewed as a cruel test by most unevolved became an easy path for the golden figure.Unmatched strength.All combat robots in the channel, including the last one, were knocked away within seconds. Zhao Boshan opened his mouth and didn’t recover from shock for a long time. When he looked at the virtual screen, it already changed to \"SSS-level.\"\"OMG, who is this fierce fellow?\" Zhao Boshan saw the door of the test hall open and the person in the hall was gone.Zhao Boshan immediately chased him out, but the center was so crowded and he had no idea who that person was.\"The video!\" Zhao Boshan ran back to the hall, paid to play the recorded video and made a copy. Having watched the video a few times, he regretted that he didn’t see the golden figure’s performance before the last test.Zhao Boshan suddenly had an idea. He logged into his account and uploaded this copy to the official forum, and named it \"7’88’’– Robot Channel Conquered.\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 42": "📕WuxiaClick🌙Home/Super God GeneCH 42Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayIn the beginning, Zhao Boshan’s video didn’t attract much attention. After all, there were so many videos online about the robot channel test.7.88 seconds was also considered a gimmick, as those who could pass the test within ten seconds would be among the very best of the unevolved.Even stars like Tang Zhenliu could finish the test in just under ten seconds and couldn’t improve any further. If someone really finished it within 7.88 seconds, he or she would surely be a star. Therefore, it would be impossible for it to be uploaded by an unknown account.Almost everyone who saw the title would choose to skip the video, and it could soon be lost in the massive number of videos. Only a few who were bored would play the video.However, those who had seen the video were all impressed by the brutal method used to pass the test and chose to forward the link to their friends.Coincidentally, someone from Steel Armor Shelter also watched the video and recognized the man in the video as Dollar from Steel Armor Shelter. Immediately after he finished watching the video, he posted a new thread titled \"SSS-level, Dollar Conquered Robot Channel in 7’88’’ to the section of Steel Armor Shelter.\"That Dollar who robbed Son of Heaven of the beast soul?\"\"Is the title for real?\"\"Is Dollar’s real identity exposed?\"The name Dollar was so well-known in Steel Armor Shelter that the post soon got a lot of attention, and many watched the video with a skeptical attitude, which turned into admiration when they finished watching.\"Dollar is my idol.\"\"This is how real men should pass the test.\"\"Ha-ha, the combat robots were all crushed.\"\"His beast soul was stolen from Son of Heaven, and he is nothing without beast souls.\"\"Dollar is invincible.\"\"Idol!\"The video was watched so much in Steel Armor Shelter that the administrator soon noticed it and put it on the front page.At this point, this video became viral in the entire alliance, and almost all unevolved now knew about Dollar.\"It must be fake.\"\"No way! Did you not see it’s an official video?\"\"This is not possible. The robots in the beginning were not that strong, but it was so incredible that he knocked away the ones close to the end as well.\"\"No way this looks too fake. It is definitely modified. If it’s not, I’ll eat s*#t.\"\"Who is this man? One of the Chosen?\"\"This is Dollar from Steel Armor Shelter.\"\"What Dollar? I have not heard of him.\"\"That is because you are ignorant...\"Dollar brought honor to the entire Steel Armor Shelter. Many people in the shelter were telling the story all over the Skynet of Dollar robbing the beast soul from Son of Heaven.\"Zhenliu, come and look at this,\" a good-looking young man waved to Tang Zhenliu, who was training.\"Lin Feng, what is it?\" Tang Zhenliu approached the young man while wiping his face with a towel. Taking a look at the video the young man was watching, he commented, \"7.88 seconds, robot channel conquered. This is crap. It took me ten seconds. How can anyone finish it in 7.88 seconds?\" Tang Zhenliu played with his hair casually.\"Just watch this.\" Lin Feng played the video.\"No way! This can’t be… Who is this guy? Where is he from?\"\"No idea. But according to my analysis, he must have maxed out on all geno points except for sacred geno points. He also has practiced advanced hyper geno arts. His armor and shapeshifting beast souls were all sacred-blood.\" Lin Feng paused the holographic video and continued to analyze, \"His shapeshifting beast soul is fast and... \"\"Enough with the analysis. I just want to know who he is. Finally, all the top guys have gone to Second God’s Sanctuary, and I now have a chance to rank second among the Chosen. And now here’s this guy!\" Tang Zhenliu gritted his teeth. \"Find out who he is. I’ll have him killed before he can ruin my chances.\"Lin Feng rolled his eyes, \"First, this video is from the official physical test center, so there is no way you could find out his identity. Second, someone with this fitness level must be from a prominent family or even have something to do with the military. You think you dare to have someone like that killed?\"\"Ahem, I was just expressing my anger… Don’t take me seriously...\" Tang Zhenliu was embarrassed.\"Who could he be?\" Lin Feng frowned, staring at the golden figure in the video.There were many who shared Lin Feng’s question and wondered about the background of Dollar. Due to the limited information available, no one had any clue.Some people also tried to ask Zhao Boshan, the poster of the video. However, Zhao Boshan had no idea who that man was. So, all people knew was that Dollar took the test on Planet Roca.But interplanetary travel was so convenient that many people were even working on a different planet from where they lived. Hence, no one knew whether Dollar was passing by or lived there. Plus, there were a dozen billion people on Roca, so it was impossible to locate a single individual anyway.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 43": "📕WuxiaClick🌙Home/Super God GeneCH 43Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayWhile everyone was discussing who Dollar was, Han Sen was practicing archery alone in a waste factory near his home, avoiding entering God’s Sanctuary in case Qin Xuan would send him to Bullseye.\"If I had not used beast souls, my strength would only have been rated 9.1 due to the lack of mutant geno points. If I could max out on mutant geno points, my rating would reach 12,\" secretly calculated Han Sen while he was resting. The improvement in physical fitness levels got more and more difficult as he became stronger.Han Sen had checked the data. Those who had maxed out on all four types of geno points could have a rating at 15. If they were also practicing hyper geno arts, then their number might reach 17 or 18, which was the limit for the unevolved.For individual indicators such as speed, there was the same limit. An average person would be considered a genius with a rating of 15. Some indicators could be further improved to 17 or 18 with the practice of hyper geno arts.Maxing out on all four types of geno points was incredibly difficult, and there might not even be anyone who could achieve this in several years in a shelter. At that time, Qin Xuan was the only one who had any chance of maxing out on all four types of geno points.As Han Sen was thinking, suddenly his comlink rang. He took a look, and it was a strange number. Han Sen hesitated and took the call. The holographic image of Qin Xuan popped out. She looked at Han Sen coldly and said, \"If I do not see you in front of me in an hour, then you better pray I will never see you again.\"Qin Xuan hung up immediately and her holographic image also disappeared.\"How did she know my number? I have not told her.\" Han Sen helplessly got up and went to the teleport station. Qin Xuan was the stationmaster, so there was no way he could avoid her.\"I am a dignified man, and I fear nothing.\" Han Sen came to the teleport station and cheered himself up.\"Come here,\" Qin Xuan spat out as she saw him coming.\"Stationmaster, I was busy with some family business and...\" Han Sen forced a smile and tried to explain when he saw Qin Xuan’s grim face.\"Busy playing archery every day in the waste factory?\" Qin Xuan didn’t even blink.\"Stationmaster, stalking is not a good idea. I understand what you want, but our age difference is more than three years. Even if I’m willing, my Mom…\" Han Sen joked.Qin Xuan, who was walking ahead, was pissed off but didn’t turn back. Entering the combat room, she threw a combat suit and some protective gear in front of Han Sen and said sharply, \"Put it on.\"Han Sen suddenly felt something was very wrong. Qin Xuan had never given him protective gear before, and this was certainly a red flag.Han Sen wanted to run, but Qin Xuan had already anticipated his thought and locked the door of the combat room before he even moved.\"Stationmaster, don’t do this. We must talk this out. I never thought age was an issue. I’ll bring you home right... Don’t come close...\" Han Sen kept backing off while Qin Xuan gritted her teeth and approached him.\"Damn you.\" Qin Xuan raised her fist and threw a punch at Han Sen.She was really mad this time. She had finally persuaded Yang Manli to let Han Sen join Bullseye, but Han Sen had completely disappeared in recent days.Han Sen felt a lot more pressure than usual, and his arms went numb after blocking two punches from her.When Qin Xuan was ready to beat him senseless, the holographic image of Yang Manli popped up from the comlink in the combat room.\"Stationmaster, Starry Group sent someone to discuss killing the sacred-blood creature,\" Yang Manli said.\"OK, take them to the conference room and I’ll be right there.\" Qin Xuan stopped and fiercely stared at Han Sen.\"Stationmaster, we are cooperating with Starry Group?\" asked Han Sen.\"You didn’t know? Son of Heaven is the son of the CEO of Starry Group,\" replied Qin Xuan. \"Think about it. Will I do you harm by asking you to join Bullseye?\"\"No need to think. How could I ever go against your will? I’ll join Bullseye right away, and you don’t have to stalk me anymore,\" Han Sen said bitterly.\"Good to see that you’ve come to your senses. Your family is not rich. What are you going to do if you don’t go to military school?\" said Qin Xuan before leaving the combat room. She didn’t forget to arrange for a guard to accompany Han Sen to report to Yang Manli.The reason for Han Sen’s sudden change of heart was that he learned Son of Heaven was the son of Starry Group’s CEO. Since Qin Xuan was collaborating with Son of Heaven, maybe he could find out the facts of Starry Group’s acquisition of their family business as a member of Qin Xuan’s Steel Armor Gang.The guard took Han Sen to the front of an office. Han Sen knocked on the door and found that the woman who had been in the holographic image just then was sitting behind the desk, looking at him seriously.\"Stationmaster asked me to report to you,\" Han Sen said politely.\"Fill this out.\" Yang Manli showed no expression and passed a sheet to Han Sen.Han Sen took it and saw it was just a basic information form. He filled it out and gave it back.\"You can go back. Show up at the training camp of Bullseye tomorrow morning at six o'clock. Remember, I don’t like people who are not punctual. And this is your last chance.\" Yang Manli's impression of Han Sen was terrible, especially after his absence from Bullseye.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 44": "📕WuxiaClick🌙Home/Super God GeneCH 44Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen could tell that Yang Manli did not like him. When he was ready to go, Yang Manli answered a comlink call and Qin Xuan’s holographic image popped out.\"Manli, come to my office right now.\" Qin Xuan saw Han Sen there and said, \"Bring him with you.\"Han Sen followed Yang Manli to Qin Xuan’s office and saw Qin Xuan watching a video from the Skynet.\"Manli, come see this video.\" Qin Xuan replayed it.Standing on the side, Han Sen secretly thought, \"This is the video of me taking the physical test! Someone paid to record this. People must have found out that I’m Dollar.\"There were so many halls in the test center, and it cost money to watch others taking the test. He thought no one would care about a nobody like himself and did not expect this to happen.If Son of Heaven knew Dollar was Han Sen, he would be in a lot of trouble. Starry Group was powerful in the Alliance, and there was no way Han Sen could compete with them.\"Dollar? You know who he is?\" Yang Manli was somewhat surprised to see the golden figure in the video.\"No. The video only covered the robot channel, and he was wearing beast soul armor the entire time. Couldn’t tell who he is.\"Qin Xuan's words suddenly sent Han Sen from hell back to heaven. He secretly wiped the cold sweat off his forehead.\"I have to be more careful. This time I got lucky, next time there may really be a leak,\" Han Sen secretly warned himself.\"Excellent.\" Yang Manli only said one word after watching it.\"Son of Heaven told me about this video. After watching this, we can be certain that Dollar’s armor is a sacred-blood beast soul, and he must be from a prominent family because he is definitely practicing an advanced hyper geno art. Another clue was that he took the test on Planet Roca. We must find him. He can be of great value to us,\" Qin Xuan said.Yang Manli thought about it and said, \"There are no prominent families on Roca. Maybe he was just passing by and has left by now.\"\"I agree. Let’s give it a shot. He’s worth it,\" said Qin Xuan.Han Sen was frightened that Qin Xuan and Yang Manli might find out the truth. Han Sen cleared his throat and said, \"Dollar was just relying on his sacred-blood beast souls. He had no real skills. There’s no need to look for him.\"Yang Manli gave Han Sen a hard look and said, \"What do you know? The ability to get the beast souls is enough proof of his ability. Also, those beast souls can be of great use to Bullseye.\"\"What ability?\" Han Sen thought. \"It’s just pure luck.\"\"Manli is right. His armor brings amazing defense, and bloody slayer has strengthened his physical strength and speed. Coupled with his practice of advanced hyper geno arts, he must be able to contain most sacred-blood creatures, and that’s very useful to us,\" said Qin Xuan.\"If we have him in our gang, we won’t have to collaborate with Son of Heaven and Fist Guy anymore to hunt sacred-blood creatures,\" Yang Manli said with great hope.\"Wow. You just wanted me to risk my life as your tank. How vicious!\" thought Han Sen, drinking from a cup to cover up his fear.\"Agreed. So, do your best to find him,\" Qin Xuan nodded.\"But since he’s from a prominent family, even if we find him, he may not be willing to join us,\" Yang Manli sighed.Qin Xuan blinked and joked, \"I know you like a strong man like him. Try to seduce him.\"\"Ahem!\" Han Sen choked on the water he was drinking.Yang Manli gave Han Sen a fierce glare, and Han Sen quickly took another sip from his cup.\"I don’t mind seducing him. I’m only afraid he isn’t man enough.\"\"Ahem!\" This time, Han Sen choked so hard that he was almost in tears.Yang Manli looked at Han Sen with disgust, \"Fortunately, Dollar won’t be a scum like him.\"\"Hey!\" yelled Han Sen. Yang Manli shut the office door and completely ignored him.\"Stationmaster, your minion is too arrogant. I’m your guy and she shouldn’t talk to me like that,\" Han Sen said with anger. \"Transfer me to another team. I don’t want to be in Bullseye where she is the leader.\"Han Sen was a little worried that Yang Manli would see that he was Dollar if he stayed close to her for a long time.Qin Xuan patted Han Sen on the shoulder, \"You were a scum, but you can change. Follow Manli’s lead. Although you may never be like Dollar, you could stop being a scum. There is still hope.\"Sending Han Sen out, she did not give him a chance to speak again.Han Sen left the teleport station, went back home and checked out the video on the Skynet. He then found out that the video had more than a hundred million hits.Han Sen made sure that he couldn’t be identified from the video and felt relieved. Seeing the compliments under the video, he was quite pleased with himself: \"Looks great indeed.\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 45": "📕WuxiaClick🌙Home/Super God GeneCH 45Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayThe next morning, Han Sen entered God’s Sanctuary and saw the copper-toothed beast had become purple all over except for the tip of its tail. He was happy to know it was about to become a sacred-blood creature in a day or two.Watching the beast over and over again, Han Sen left for the Bullseye training camp. When Han Sen arrived, he met an acquaintance.\"Su Xiaoqiao!\" Han Sen was surprised to see Su Xiaoqiao, who was wiping the bows and arrows at the shooting range.\"Ass Freak, how do you know me?\" Su Xiaqiao was also surprised.\"How do I not know you? Everyone was calling Dollar ‘Doll’ because of you.\" Han Sen smiled while secretly hating Xiaoqiao. Thanks to him, Han Sen had such a strange nickname.Su Xiaoqiao was very proud, \"If it wasn’t for me, Dollar wouldn’t be as popular as he is now.\"\"Good job.\" Han Sen gave him a thumbs-up, while thinking, \"You little bastard.\"\"Brother, why did you choose to enter Bullseye?\" Su Xiaoqiao asked Han Sen.\"Because you can stand away from the creatures to reduce risks. Safety first,\" laughed Han Sen.\"Great minds think alike.\" Su Xiaqiao felt like he finally met someone who understood him. \"The only good thing about Bullseye is safety. I wouldn’t come here in a million years if it wasn’t for this. The team leader Manli looks great but she is a sadist. You know what we call her behind her back? Nazi...\"Su Xiaoqiao and Han Sen suddenly shuddered as they were talking. They turned back and saw Manli standing near them. She must have heard everything they said.Han Sen and Su Xiaoqiao were petrified. Su Xiaqiao quickly put on a smile, \"Manli, I was just teasing the new guy. In fact, you are so charming that...\"\"Use a 7.0 practice bow. You each have to shoot a thousand arrows. Don’t leave until you are finished,\" said Yang Manli coldly and turned away.\"My god! 7.0 practice bow, a thousand arrows? Why doesn’t she just kill me?\" Su Xiaoqiao's smile collapsed.\"She won’t be here anyway. She wouldn’t even know how many arrows we shoot,\" said Han Sen.\"Brother, you are too naive. Of course Nazi has thought of this. There are people who are in charge of counting arrows. You can’t shoot standing over the line. Nor can you miss the target,\" Su Xiaoqiao said in desperation.\"We will take our time then. She didn’t say when we have to finish.\" Han Sen patted Su Xiaoqiao on the shoulder.With a strength rating of 9.1, a thousand arrows with a 7.0 practice bow could be a difficult task, but it wasn’t the end of the world. However, for Su Xiaoqiao, who only had a strength rating of 7, it was different. If he was going to shoot continuously, a hundred arrows could kill him.The two took the practice bow and started. Standing next to Su Xiaoqiao, Han Sen was shooting at a slow pace. The other members of the Bullseye team were all gloating at them.Several Bullseye members carried a few bundles of practice arrows, and one of them said to Su Xiaoqiao, \"Xiaoqiao, keep practicing. We will hunt the sacred-blood creature tomorrow.\"\"Another sacred-blood creature found? When? Why didn’t I know?\" Su Xiaoqiao said with wide eyes.\"Son of Heaven’s gang found it. They couldn’t hunt it by themselves so they asked us to help. We will leave in the morning to hunt but you won’t be able to make it. A thousand arrows will take you at least three days,\" the team member said with a grin.\"Enough said. Xiaoqiao, go practice!\" yelled an angry young man, the deputy head of Bullseye.After the other members had left, Su Xiaoqiao begged the angry man, \"Hongtao, please ask Manli to let me go tomorrow. I will double my practice time when I come back.\"\"You think this is a farmer’s market where you can bargain? Manli said shoot a thousand arrows, so you can’t miss even one.\" Liu Hongtao gave Han Sen a hard look and said, \"And you, don’t think you can get away with anything here just because you know Qin Xuan. This is just a small lesson. Don’t let me catch you or you will regret it.\"\"Liu, you know we meant well. Please help us out.\" Su Xiaoqiao passed a pile of cash to Liu Hongtao.Liu Hongtao threw the money on the floor and rebuked Su Xiaoqiao, \"You think you can bribe me? Rules are rules. You can’t go anywhere unless you finish shooting a thousand arrows.\"Liu Hongtao turned away after his speech.Han Sen was a bit surprised and asked Su Xiaoqiao, \"Are the rules really so strict at Bullseye?\"\"Strict my ass. Liu always takes money from us,\" Su Xiaoqiao gritted his teeth and said.\"Why didn’t he this time?\" Han Sen was confused.Su Xiaoqiao looked at Han Sen and whispered, \"You better be careful now. I think Manli is very upset with you, and Liu likes Manli a lot. He must be deliberately messing with you. Or else you are supposed to still go hunting even when punished.\"Han Sen suddenly realized why Liu Hongtao had looked at him with disgust and hatred.\"This is my fault. But no worries, we can still go tomorrow.\" Han Sen patted Su Xiaoqiao on the shoulder.\"What if we can’t finish a thousand arrows?\" Su Xiaoqiao sighed and suddenly thought of something, \"Brother, are you sleeping with Qin Xuan? If it’s true, just talk to her and we can definitely go.\"Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 46": "📕WuxiaClick🌙Home/Super God GeneCH 46Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"Even if I am sleeping with Qin Xuan, I wouldn’t bother her with this. Moreover, there is really nothing going on,\" explained Han Sen.\"In our gang, Manli would only listen to Qin Xuan. So, unless she helps us, we won’t be able to go tomorrow.\" Su Xiaqiao held Han Sen’s hand, \"Brother, dignity is worthless, but the sacred-blood creature is priceless. If you really have something going on with Qin Xuan, you need to beg her and let her do whatever she wants with you. You need to focus on the big picture.\"Han Sen sighed, \"Unfortunately, there is really nothing.\"\"Then we are doomed. We will practice while others go hunting,\" Su Xiaoqiao said dejectedly.\"You don’t have to be so frustrated. Even though I am not sleeping with Qin Xuan, we can still go hunting tomorrow,\" Han Sen laughed.\"What do you have in mind?\" Su Xiaoqiao watched Han Sen helplessly.\"Just finish shooting these arrows today.\" Hansen pointed to the bundles of arrows.Su Xiaoqiao said weakly, \"Brother, we each have one thousand arrows to shoot while standing 450 feet away from the target, and those that miss the target will not be counted. We need at least three days to do that.\"\"Not necessarily.\" Han Sen tried the practice bow, which was much lighter than Doomsday. A 7.0 practice bow means that you use the bow to practice rapid shooting with a strength rating at 7.0. For Doomsday, you only draw the string with a strength rating at 7.0.He picked up an arrow and shot it toward the target. Instantly, it ended up on the bullseye.Han Sen didn’t pause but kept shooting. While he didn’t hit the bullseye each time, all his arrows were on the target.Su Xiaoqiao had thought it was impossible to finish practicing today. Yet Han Sen had shot three dozen arrows in a short while and didn’t seem to need a break.\"Brother, great job! Ten arrows in a row with a 7.0 bow,\" praised Su Xiaoqiao.Any archer knows that rapid shooting consumes a lot of energy and a normal archer can only shoot a dozen arrows in a row while those who shoot two dozen arrows in a row must be a lot stronger than what the bow requires.Han Sen just smiled and said to Su Xiaoqiao, \"Don’t just stand there. Let’s finish the two thousand arrows and go hunt the sacred-blood creature.\"Ignorant,\" Liu Hongtao who was supervising them said with contempt.Being able to shoot three dozen arrows was impressive, but a thousand arrows was not so easy. Even if Han Sen had a strength rating over 8.0 or 9.0, he couldn’t keep shooting at this pace. His arms and fingers would be wasted, so there was no way he could join the hunting tomorrow anyway.Han Sen also knew that shooting for a long time required more than just strength. However, he discovered that his muscles were incredibly tough and resilient. After shooting two dozen arrows, his muscles got slightly sore. But as he shook out his arms, he felt fine again.Even if he used his muscles for a long time, his body would stay cool and strong.Han Sen knew it wasn’t because of his geno points, but his practice of Jadeskin. A thousand arrows with the 7.0 practice bow was not hard for him. He had enough strength and endurance to do the task.Han Sen kept shooting, while the man counting arrows was thunderstruck at the sight of four dozen arrows thickly dotting the target. \"This guy is out of this world,\" he whispered.\"Who are you talking about?\" someone heard his whisper and asked.\"Ass Freak! He shot four dozen arrows and didn’t even pause,\" the man counting the arrows said.\"Ass Freak? For real?\"\"Come and see if you don’t believe me.\"Soon a few Bullseye members came to watch Han Sen shooting. After watching for a while, everyone was stunned.\"Wow, all three targets we are full. That was all him?\"\"Yeah! Xiaoqiao only shot a dozen arrows and hasn’t even filled one target.\"\"No way! That must be a 4.0 practice bow.\"\"You can’t even tell the difference between a 4.0 bow and a 7.0 practice bow? They look nothing alike.\" The man counting rolled his eyes.More and more Bullseye members came around. Liu Hongtao could not help but stand up, staring at Han Sen who was still shooting.\"More arrows.\" Han Sen hadn’t had such fun with archery in a long time. When he was practicing alone, he could only shoot the few arrows he owned and then stop to collect the arrows from the target himself. Now he could shoot as many as he wanted and as long as he wanted.\"Buddy, great job! This is the second bundle.\" Su Xiaqiao untied another bundle of practice arrows, grabbed a bunch of arrows and stuck them in Han Sen’s quiver.\"Just started warming up.\" Han Sen smiled and shot another arrow.\"Brother, if you shoot all the arrows and we can go hunting tomorrow, I will do anything for you. I’ll even do your laundry,\" cried out Su Xiaoqiao.\"Forget about laundry. How about cash?\" laughed Han Sen.\"Talking about money would hurt our friendship,\" replied Su Xiaoqiao.Han Sen paused every 50 arrows and used only his right hand to draw the string, instead of using both hands in turn.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 47": "📕WuxiaClick🌙Home/Super God GeneCH 47Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"What is the noise outside?\" Yang Manli heard it getting more and more noisy outside her office as she was reviewing the data of the sacred-blood creature sent from Son of Heaven.Yang Manli asked twice, but no one answered. She frowned and went to find out.Almost the entire Bullseye team was at the shooting range, cheering from time to time.Yang Manli took out a telescope. Most of high-tech products lost their function in God’s Sanctuary, but primary instruments like the telescope still worked.Yang Manli, starting to feel skeptical, put down the telescope and went to the shooting range.\"Ass Freak, a real man, he’s been going at this pace for so long.\"\"His endurance is invincible.\"\"I think a thousand arrows was too light a punishment for him. He can probably finish before dinner...\"The Bullseye team saw Yang Manli coming over, and quickly ran back to training. They were not afraid of Liu Hongtao, but terrified by Yang Manli.\"Those arrows were all shot by him?\" Yang Manli asked Liu Hongtao.\"Except for Target 9 and Target 10.\" Liu Hongtao felt somewhat reluctant to answer her.\"I see.\" Yang Manli did not say anything and turned back to the office.Liu Hongtao did not know what Yang Manli was thinking and quickly asked, \"Manli, the punishment is too mild and it would set a bad example. Should we add another thousand to their punishment?\"\"No.\" Yang Manli left.Back in the office, Yang Manli took out Han Sen’s profile and reviewed it. \"Great endurance, good geno point counts, strength rating is probably at 9.0. Integrated compulsory education graduate with excellent scores.\"Yang Manli carefully read the profile, pondered for a moment and muttered: \"I’ll give him a chance, even just for the stationmaster.\"Han Sen stopped after five hundred arrows and rested for two hours before he resumed shooting. Although he could continue, he was afraid to scare everyone so he took a break.By midnight, Han Sen and Su Xiaoqiao had shot two thousand arrows.Han Sen had become famous in Bullseye and all members had changed their view of him. Anyone who could shoot a thousand arrows in a day deserved respect.\"Sen, I’m not easily impressed, but you are amazing.\" Although most of the arrows were shot by Han Sen, Su Xiaoqiao was also sore and tired. He put his arm around Han Sen’s neck and gave Han Sen a thumbs-up.\"Don’t mention it. Do you know what kind of sacred-blood creature we are going to kill tomorrow?\" asked Hansen.\"I’m so handsome that Manli’s assistant couldn’t resist my charm and told me everything,\" Su Xiaoqiao said triumphantly.\"So what is it?\" Han Sen didn’t care for his bragging.\"It seems to be a flying creature. There aren’t many archers in Son of Heaven’s gang, so they want our help,\" replied Su Xiaoqiao.Hansen frowned, \"A sacred-blood creature that can fly. That’s tough.\" Sacred-blood creatures were strong enough. If they had the ability to fly, it would be even harder to hunt them. After all, the range of the best alloy bows was only about half a mile and only a few people in First God’s Sanctuary could even draw the string of those bows. If the sacred-blood creature flew too high, arrows wouldn’t do it much harm.Also, the skin of sacred-blood creature was so stiff that even the tip of Saber arrows couldn’t cut through.Han Sen knew that Bullseye must have beast soul bows and arrows. And there must be alloy arrows better than Saber arrows as well. But he didn’t think that Yang Manli would give him access to those.If he couldn’t even pierce the skin of the sacred-blood creature, even if this opportunity was heaven sent, he had no means to grasp it.\"Seems that I should buy a Z-steel arrow,\" Han Sen pondered.Z-steel was not steel, but a kind of metal humans discovered fifty years ago. Its characteristics were similar to steel, but its toughness were far beyond steel.The toughness of an alloy arrow could be greatly improved by adding just a little Z-steel. And all alpha alloy had Z-steel added.Doomsday and the broadsword Han Sen seized from Liu Feng had Z-steel in them but the content was quite low. The broadsword contained 0.3 percent Z-steel, while Doomsday contained 0.4 percent Z-steel in its body and 0.5 percent Z-steel in its string. If a weapon contained more than 10 percent Z-steel, it could cut through the bones of mutant creatures. And if a weapon contained more than 60 percent Z-steel, it would be as strong as the bones of sacred-blood creatures.However, Z-steel was extremely rare and therefore, its price was quite high. The Alliance also had strict control over its production, so any alloy with more than 1 percent Z-steel would be hard to find.Although the tip of Saber arrows contained a little Z-steel, it would not exceed 0.1 percent. Hence to hunt a sacred-blood creature with Saber arrows was next to impossible, even if he could shoot the arrows directly into a wound.Han Sen’s ideal arrow was the Z-steel arrow, which was 1 percent Z-steel. However, it was so expensive that even with all the money he had at the moment, which was around three hundred thousand dollars, he could only afford one arrow with about 0.6 percent of Z-steel.Han Sen went home at night and logged in to Polar Night Forum. If he couldn’t find the right second-hand goods, he would have to buy a new one at the store.In Polar Night Forum, there was a post that claimed to sell weapons with 1.2 percent Z-steel. Han Sen noticed that the post was from an owner whose store had no license or legal permit. On the webpage of the store there were only holographic images of the products and a comlink number.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 48": "📕WuxiaClick🌙Home/Super God GeneCH 48Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayHan Sen took a closer look and saw that there were holographic images of weapons in the making, which proved that the weapons were all handmadeAfter reviewing the images, Han Sen dialed the number on the webpage.Someone answered, but didn’t allow video chat. Han Sen could only hear his voice.\"How can I help you?\" the owner asked in a low male voice.\"I saw on the forum that you sell weapons. Do you have arrows with higher percentage of Z-steel?\" Han Sen did not expect that the content of Z-steel could really reach 1.2 percent. He’d be happy if it reached 0.8 percent.\"I have two arrows made by myself. 1.2 percent Z-steel. Three hundred thousand each,\" replied the man.\"I want one. Where can I check it out?\" asked Han Sen.\"I’ll tell you the address,\" the man gave him an address and hung up.Han Sen followed the address to a red-light district. Although it was already the middle of the night, the streets were still crowded.Han Sen waited for a while at the agreed spot and saw someone waving at him across the street. Hansen warily walked over to him.\"You want to buy an arrow?\" asked a guy in sunglasses and hoodie. Han Sen could only tell he was a middle-aged man.\"Yes,\" Han Sen nodded.The man took out a box and placed it in front of Han Sen. He opened it up and there was a black steel arrow inside.\"Can I test it?\" asked Han Sen.\"Suit yourself,\" replied the man casually.Han Sen took the arrow out and tested its balance. If an arrow wasn’t balanced, it didn’t matter what material it was made from.\"Excellent.\" Han Sen found this arrow had better balance than Saber arrows. If the bow was strong enough, this arrow would always maintain stability.The man nodded and did not say anything.Hen Sen pulled out his broadsword and asked the man, \"Can I test it with my own weapon?\" Without his permission, Han Sen didn’t dare to test it that way. But technically speaking, if the arrow contained more than 0.7 percent Z-steel, his broadsword wouldn’t even leave a mark on it.The man looked at the broadsword in Han Sen’s hands and again said, \"Suit yourself.\"With his permission, taking the arrow in one hand and the broadsword in the other, Han Sen fiercely slashed the broadsword at the arrow.Clang!Han Sen checked the arrow and was pleased to see there were no mark on the arrow, while his broadsword was chipped.Although he wasn’t sure if the Z-steel content reached 1.2 percent, he knew it was great stuff.\"Great stuff. I’ll take it.\" Hansen took out the three hundred thousand dollars he had brought with him and paid the man.\"Of course, it was made from the bearing steel of old interstellar warships, hence the Z-steel content is a standard 1.2 percent. Also the machine-made weapons are no match for my products. Let me know if you need something in the future,\" the man said and disappeared in the back lane.Han Sen returned home and tested the arrow more thoroughly. It was truly great, similar to the name-brand arrows, and only one-tenth of the price.\"I was really lucky to find a true craftsman.\" Han Sen hadn’t had high hopes because a lot of sellers of handmade weapons only produced mediocre products. For weapons like arrows that required a lot of skills to make, it was even less likely to find good ones from independent sellers.Han Sen was very satisfied with this arrow. Just the tip of the arrow showed incredible craftsmanship, as it must have been manually polished to be so sharp. Han Sen had briefly learned weapon-making at school, but his work was not the high caliber of this weapon maker.\"It is a good arrow, but unfortunately I can only afford one. If I don’t hit the target, there won’t be a second chance.\" Han Sen checked his bank account and found he had less than one hundred thousand dollars left.\"I wish I could buy something with it tomorrow.\" Han Sen slept for a while and teleported to God’s Sanctuary early in the morning.In Qin Xuan’s Steel Armor Gang, Bullseye was the smallest team. Few people among civilians were interested in archery, so most Bullseye members had military background and could enter military schools if their scores qualified.When they entered God’s Sanctuary, they would report with the military force into the shelter they were assigned. Qin Xuan's Steel Armor Gang was the military force in Steel Armor Shelter.The Alliance didn’t have much power over God’s Sanctuary, but it still maintained some control. In each shelter, the largest gang typically had military background.Qin Xuan led her people to the agreed place, and Son of Heaven’s gang was already there. Compared to Steel Armor Gang, Son of Heaven’s gang seemed rather unorganized.Luo Tianyang gave Han Sen, who was in the crowd, a cold stare and judging by his look, Han Sen knew their business was not finished.After the two sides joined, Son of Heaven’s gang led the way, marching into the mountains. Bullseye’s place was at the end of the line, and Han Sen and Su Xiaoqiao were walking behind everyone else.\"Sen, I think we should each bring a shield, to protect ourselves,\" Su Xiaoqiao said.\"You're rich. Just buy a suit of Z-steel armor,\" said Han Sen.\"Z-steel is so heavy and not as portable as beast soul armors. And even primitive beast soul armors are tougher than Z-steel armor, unless the Z-steel content exceeds 10 percent. You know we could only find weapons with at most 1 percent Z-steel. So beast soul armors are in general much better.\" Su Xiaqiao continued to say, \" How nice if I could have the same beast soul armor as Dollar’s. That’s the only sacred-blood beast soul armor I’ve seen in Steel Armor Shelter. I wonder what beast soul it was.\"\"From its look, I think it must be a fierce and mighty beast soul,\" another Bullseye member jumped in.\"That goes without saying. It must be a from phenomenal sacred-blood creature,\" others agreed.Han Sen chuckled silently and wondered what they would say had they known the armor was from the weakest creature, black beetle.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 49": "📕WuxiaClick🌙Home/Super God GeneCH 49Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayThe two gangs had marched more than half a month before they reached a mountain Han Sen had never been to.On the way, Han Sen had truly understood there was strength in numbers. No creatures could block their path with the rain of arrows from the archers and the charge of the cavalry. Of course, the scouts would inform them if there were herds of strong creatures ahead of them and they would take a detour.At the destination, Bullseye hid on a cliff and was ready to shoot the sacred-blood creature drawn out by Luo Tianyang’s team.The rest went under the cliff and was ready to chase the creature.In addition to Bullseye, Son of Heaven and his henchmen also stayed on the cliff. Han Sen knew they must also be good at archery because he had witnessed Son of God almost killing the bloody slayer with an arrow before he snatched its beast soul.Son of Heaven looked at Han Sen coldly as he had heard rumors about Han Sen being Qin Xuan’s boy toy, which annoyed him.\"Son of Heaven, where are the arrows you’ve agreed to offer?\" asked Yang Manli.It was Bullseye that Son of Heaven really needed this time. As normal arrows wouldn’t harm a sacred-blood creature at all, and Z-steel arrows were too expensive, Son of Heaven had agreed to provide Bullseye with the arrows needed this time.Son of Heaven smiled and waved his hand. His henchmen then carried a box down from the back of a mount. They opened the box and it was filled with Starlight arrows, each worth more than a million. It was made by Starry Group with 1 percent Z-steel.\"Manli, here are a hundred Starlight arrows we agreed on. Would you distribute them among your best archers?\" Son of Heaven smiled.Yang Manli turned around and started calling out names. She had good arrows herself; so did Liu Hongtao. Hence, she planned to pick five other members of Bullseye out to use the Starlight arrows.Soon she had four people picked out and with some thought, she looked at Han Sen, \"And you.\"Han Sen was slightly surprised, as he did not expect Yang Manli to choose himself. But this was a good thing, and Han Sen quickly stepped up and stood together with the other four.While Yang Manli was preparing to distribute the arrows among the five, Son of Heaven suddenly said grimly, \"Manli, are you sure about the archers?\"\"What is the problem?\" Yang Manli looked to Son of Heaven.\"How is someone like him qualified to use the Starlight arrows?\" asked Son of Heaven coldly, pointing to Han Sen.\"I chose him, and that’s why he’s qualified,\" replied Yang Manli.Son of Heaven looked at Han Sen disgustedly and said to Yang Manli, \"I am not questioning your decision, but this person just will not do. Please replace him.\"Yang Manli frowned, but she knew this campaign was dominated by Son of Heaven, since he had provided everything. Bullseye was just here to help. So, she couldn’t refuse him.\"Zhao Hua, come here.\" Yang Manli had to let Han Sen return to the team, and called out another name.Son of Heaven continued to stare at Han Sen coldly.\"Sen, you are really unlucky. You had the opportunity to get 20 Starlight arrows and kill the sacred-blood creature. Now it’s all gone,\" said Su Xiaoqiao with regret.Han Sen shrugged. Although it was a shame he didn’t get the 20 Starlight arrows, he had an even stronger arrow in his quiver. He still had a chance.The archers each took position on the cliff and prepared their bows and arrows, waiting for the sacred-blood creature to fly out from below.Han Sen and Su Xiaoqiao found a comfortable spot and Son of Heaven suddenly walked over and said, \"What are you useless scums doing here? Go away.\" Then, Son of Heaven’s henchmen shoved Han Sen and Su Xiaoqiao aside.Su Xiaoqiao fiercely stared at them with anger. Han Sen tugged on his arm and said, \"It doesn’t matter. Let’s go over there.\"\"They are pushing too far,\" said Su Xiaoqiao bitterly.\" Revenge is a dish best served cold. Just wait until you see Son of Heaven’s face when we kill the sacred-blood creature,\" smiled Han Sen while walking to the other side with Su Xiaoqiao.\"It’s not that easy. This cliff is wide and Son of Heaven’s men are waiting on the other side. If the sacred-blood creature went to their side, it would be too far from us. Even if it were only three hundred feet from us, we couldn’t even injure it without Starlight arrows. Basically, we are just a decoy, a distraction,\" Su Xiaoqiao smiled wryly.\"You have money. Why didn’t you buy a few Starlight arrows?\" Han Sen looked at Xiaoqiao puzzled. He remembered Su Xiaoqiao to be very rich. One million should be nothing for him.\"What do I need those for? It’s outrageously expensive and you may not even be able to recover it. One million each, and you probably need to shoot seven or eight before you could hit something. No guarantee of killing anything either. I’d rather spend the money purchasing mutant creature meat.\" Then Su Xiaqiao lowered his voice and said, \"Now Z-steel is extremely overvalued. As the young master of Starry Group, Son of Heaven owns mines and factories of Z-steel. So, he doesn’t need to spend much on these arrows, as the cost of each arrow is at most ten thousand.\"\"Such huge profits?\" Han Sen was surprised.\"Well, now Z-steel mines have been monopolized by a few groups. Also the manufacturing technologies are not ready for producing alpha alloy with more than 5 percent Z-steel. For some reason, the alpha alloy will become as brittle as glass if Z-steel content exceeds 5 percent.\" Su Xiaoqiao explained to the Han Sen.While the two were chatting, they suddenly heard a howling like dragon under the cliff. Grabbing their bows, they looked down from the cliff.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 50": "📕WuxiaClick🌙Home/Super God GeneCH 50Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play\"Such a gigantic lizard!\" Su Xiaoqiao saw the creature under the cliff and let out a cry.Han Sen also saw what the sacred-blood creature looked like--a huge lizard covered in purple scales, flying out from the deep valley with a pair of feathered wings.The sacred-blood creature was closer to where Han Sen was, but still about 250 feet away. With the order of Yang Manli, everyone started shooting down at the the sacred-blood creature that was trying fly up from the valley. The arrows rained on it but couldn’t even hurt the feathers on its wings, let alone the scales on its body. Even the Starlight arrows could only leave some sparks before they fell. As the tips of the arrows were turned, its features remained intact.Han Sen had already put his arrow with 1.2 percent Z-steel on the bow, but did not shoot it out. This was the only arrow he had and it would be useless if he didn’t have the best angle.\"Its feathers and scales were too tough. Our arrows are useless unless we could shoot it in the eyes.\" Su Xiaoqiao also shot a few arrows, which were completely wasted.As Su Xiaoqiao was talking, Son of Heaven had summoned his eagle beast soul bow and a beast soul arrow in the shape of a wolf tooth. Aiming at a wing of the sacred-blood creature, Son of Heaven made his shot.Han Sen saw that the beast soul arrow Son of Heaven used this time was much inferior to the sacred-blood six-winged wasp arrow he used last time, so it must either be a mutant or primitive beast soul.The beast soul arrow flew across the sky like a black lightning bolt, cut through the purple feathers and nailed on the wing of the creature, making the creature utter a roar.Yang Manli also summoned a white pigeon-like beast soul bow, along with a blue swordfish-like beast soul arrow. As she made the shot, the arrow also pierced the purple feathers and blood started to flow down the arrow.Neither Son of Heaven’s arrow nor Manli’s arrow was one-use this time. After the arrows hit the target, they summoned them back to their hands.\"This means infinite arrows! Beast soul arrows are so much better than Z-steel arrows in this sense.\" Han Sen was green with envy, wishing he could grab the beast soul arrow from Son of Heaven’s hands. It must be a mutant beast soul, or else it wouldn’t have penetrated the wing of a sacred-blood creature so easily.Son of Heaven and Yang Manli both knew the wings were the weakest part of the creature and aimed again at its wings. The creature took another two shots and flew away from the cliff.Son of Heaven’s beast soul bow was obviously stronger than Doomsday. When he made a shot 600 feet away from the creature, the arrow still went through its wing.Everyone was desperately shooting at the creature, while the injuries they made were still not fatal. The creature escaped and flew away.\"Go after it! It wings were hurt so it can’t go far.\" Son of Heaven gave the order and those who had beast soul mounts all summoned their mounts and chased after the creature.Han Sen and others who had no mounts could only follow by running and were soon left behind. After all, those with two legs could never outrun those with four.In a while, they could no longer see the mounts and suddenly heard the thud of hooves. It was Qin Xuan and others who were attacking in the valley.\"Up.\" Qin Xuan called to Han Sen when her mount passed by him, considering her mount could take a second person and Han Sen was a good archer with Doomsday.Han Sen was delighted and quickly leapt on the mount. He thought his chance had gone, but now Qin Xuan would take him so he had a second chance.Qin Xuan followed the hoof prints and went ahead. Sitting behind her, Han Sen had to put his arms around her to keep himself on the mount. She was in beast soul armor so he couldn’t really feel a thing.In addition to the hoof prints, there were also traces of blood on the ground, which must be from the sacred-blood creature’s wounds—proof that they were in the right direction.After eight hours of chasing, Qin Xuan finally saw Son of Heaven, Yang Manli and others ahead of them.Son of Heaven stopped in front of a mountain, and looked up at the top of the mountain.Qin Xuan and Han Sen approached. The mountain was like a sword plugged into the ground, standing at least half a mile high. And the sacred-blood creature was crouching on the mountain top, howling from time to time.\"This mountain is too high. Even the beast soul arrows couldn’t possibly hurt the creature,\" seeing Qin Xuan, Yang Manli said.Son of Heaven also looked to Qin Xuan and saw Han Sen sitting behind Qin Xuan with arms around her waist. Suddenly he had an urge to kill Han Sen.\"We must try to climb up to kill it as soon as possible, or we can chase it down. With the self-healing ability of a sacred-blood creature, its wounds woul heal in a few hours and we could no longer kill it by then,\" said Qin Xuan, staring at the mountain top.\"Then we will climb up and kill it.\" Son of Heaven put away his mount.\"This mountain is too steep. If we were attacked halfway, we would die,\" Yang Manli objected.\"We could send a few people up and we will watch here. If it attacked, we would shoot it dead,\" Son of Heaven said calmly.\"Who should go up?\" Qin Xuan looked at Son of heaven and frowned.Obviously, whoever going up will be in great danger and no one would not want to take the risk.\"Only Manli and I could threaten it with arrows. And we need you, Qin Xuan to stay and give orders. The rest should all go up. We’ve come too far to give up. Whoever goes up can have a bigger share of its meat, so it is fair, right?\" Son of heaven’s gaze swept across the faces of the men in front of him and turned cold when it met Han Sen.Previous Chapter<All ChaptersNext Chapter>"
}