{
    "Chapter 1": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GamePrologueNovel InfoNovel InfoAll ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayClang, boom!At the iron bars that closed without remorse, I stared blankly. Beyond the prison cell, contemptuous eyes flashed.“How dare you poison the Madam. Know this—you will never walk out of this prison alive. How despicable. You don’t even know any grace.”Albert, the guard who brought me here, gritted his teeth and pretended to spit. Fortunately, he turned around without actually spitting, but what he said was clear enough.If the findings would really turn out as me being the one responsible for the poisoning, I wouldn’t ever be able to get out of this prison alive. As an orphan from a faraway land and an ordinary servant, it wouldn’t be strange if I disappeared.“Albert! Albert! Please allow me one thing. Please let me see the Count!”I shouted with all my might as I held the prison bars tightly.“It wasn’t me! I wasn’t the one who mixed poison in the Madam’s tea! I know who the real culprit is—please let me see the Count!”“What you’re saying doesn’t make sense. It’s you who brought the poisoned tea leaves. Who else is the culprit? Who are you going to blame for your crime?”He spat and pointed a finger at me, seething in something like genuine rage.“I didn’t do it! The real culprit is…!”“The real culprit?”As soon as I was about to say the name of the real sinner, a quiet voice rang through the air. My tongue hardened reflexively, and his cold presence permeated into my skin. Ba-dump, ba-dump, ba-dump. The pounding of my heart was so loud that my eardrums were about to burst. The even sound of his footsteps over the stone floor sent shivers down my spine.He’s coming.“Goodness, Young Master. You shouldn’t be in a place like this!”Instead of towards me, as I was so frozen to the point that even my fingertips couldn’t move, the guard made a fuss over that man. The guard’s voice became smaller, and now only his approaching footsteps echoed into my ears. The moment he finally stopped in front of me, I couldn’t face him.“Young Master, if you do this, I’ll be in big trouble with the Count.”“It’s alright, Albert. I’ll explain it to my father properly.”“Goodness, Young Master… What if I really get into big trouble.”Albert just shifted his weight on one foot to the other without knowing what to do, but Adrian answered his worries leisurely. Perhaps because it was only me and Albert here with him, but the angel-like appearance he reserved for the public had long since disappeared. All I could feel from him was the pressure and fear that weighed heavily over my head…“Tell me. The real culprit that you know, who is it, hm?”He asked with a beautiful, lilting voice that everyone praised. And in turn, I was just shaking without moving from where I was standing. It was faint, but the sound of my teeth chattering could be heard. Hmm. As though contemplating, he hummed and stared at me intently.“I knew it. You’re different.”“……”“You know, hm? Who I am, what I did.”“……”“How did you know? I’m good enough at it that no one should have known.”Rather than anger, all that was in his gaze towards me was interest. My body flinched reflexively as though I’d been stabbed by a blade. The more I appeared to be frightened, the darker his smile became. I didn’t dare to look up to face him, but I could still feel his change in demeanor.Adrian Caesar von der Paltzgraff.The successor to the Paltzgraff family.The world praised him as an angel—but only I knew. The public was set abuzz by the news of the recent serial murders and attempted murders, and that all of them had been committed by a handsome young man.No, it was only me who knew.That the world I’m living in right now is a crazily ridiculous horror game.Novel InfoNovel InfoAll ChaptersNext Chapter>",
    "Chapter 2": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 1Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too. (1)Translated by YonneeEdited by —Until a few months ago, I was just a run-of-the-mill gamer who liked playing games. I would buy a game that looks fun, play it, but only until a point where I wouldn’t need to spend a lot of money. After I got a job, I had to focus on my work, so I had to give up many games, but I still tried out a few new games once in a while.But that day was different. That day was so painstaking that I bought some alcohol, even though I couldn’t hold my liquor, on my way home from work. Because I was already drunk, not even a few drinks in, I clicked on some ‘horror game’ reviews by mistake. I usually don’t play games of this genre because I’m too much of a scaredy cat.“There’s so many new horror games.”I scrolled down and looked through the game titles that filled the main page. In general, what could be seen were black and red monsters and ghosts that had an ominous atmosphere to them. If I had been sober, I would have closed the window immediately because I’d be scared, but this time, I wasn’t all that frightened. Maybe because I was drunk.Why do people play horror games anyway?Unless it was really a hobby, I couldn’t understand the appeal to such things. Even so, I did still have some curiosity about it.While clicking on a review or looking down at some posts with a lack of sincerity, I eventually stopped scrolling because I noticed a title that’s been repeated for a while now.‘The House of Paltzgraff’s Murderer.’“Hmm, isn’t this the game I saw earlier? The new A-Comms game…”Crushing a can of beer that I just downed and throwing it away somewhere, I began to read the review again more attentively. A-Comms made games that had minor sensitive themes, but the company was famous for their elaborate OSTs, plus their historical backgrounds and stories, so there was always a lot of hype from their fans every time a new game was released.They released much better work than most mass-produced games that saturated the market, so expectations were always high. Perhaps that’s also why they were hit with a ton of criticism, too.People anticipated the release for this game and bought it as soon as it came out, but apparently it wasn’t good, it’s buggy, it’s disappointing… The more bad reviews I read, the more curious I became.How bad of a flop was this game that all the reviews were saying it’s indeed a flop?No way, it might not really be a total failure. What most game communities on the internet called flops were actually masterpieces. The more cynical bashers there were, the better the game might be and the higher the sales ranking would be.It’s a strange correlation, but this was reality. Even more so for A-Comms games.“I’m curious. Should I give it a go…”Even while saying this, my hand already brought me to the A-Comms website and I’ve already finalized my check-out. It wasn’t too long until the game was fully downloaded and booted up.As soon as I clicked open, my entire screen became stained with dark red blood. Along with the sound of the classic thunder and lightning through the rain, a magnificent mansion appeared.It was just like A-Comms, since they were especially particular with artistic details, that the mansion was elegantly designed with a European architectural style that could be seen in any movie. Just this alone made me doubt if I bought this in Korean Won or another currency.I casually chewed on my leftover snacks as the menu appeared on the right side of the screen.★ New Game★ ExitAs I clicked on my selection on the simple menu, the screen turned black once again, and the magnificent yet gloomy orchestral score of the OST began to play, the deep tones of a cello taking precedence of the melody.And then—“Ah! What the hell!”With a terrible scream, a man’s face filled the monitor. I was so surprised that I almost fell out of my seat, but as the face got smaller. I managed to calm down and sit properly again.The man was so pale that even his veins were visible on his skin. No, wait, he seemed to be a little younger than an older man… The young man looked exactly into my eyes and lifted something. It didn’t take long for me to realize that it was a woman’s head, lopped right off from her body.She had bloody and tangled hair, and she had the frozen expression of fear she had right before she died, her eyes not yet closed… Because the frame was drawn so realistically, I even thought that it looked like a picture.Eventually, when he began to chew on the woman’s head, my brows became furrowed.“What the, what kind of minor sensitive themes… This is just gross.”At one point, the young man’s actions began to slow down, and words began to appear on the monitor.There was a brief explanation of the game’s worldbuilding, and the plot roughly went like this—The devils’ underworld had been reigned over by monarchs for the longest time, and the monarch’s daughter, Lilith, had been dominating the country. It’s said that there were two factions, splitting the devildom in half.The strongest being in hell, Satan, was the representative of the monarch’s faction and decided to stand against Lilith. The devildom then became divided between those who stood behind Satan and those who stood behind Lilith. And so, the two factions lead a boring war of attrition…On the day when Lilith was on the verge of becoming completely destroyed with an overwhelming power, she decided to sacrifice her life in order to cast terrible curses upon Satan.Satan, who lost all his strength, opened his eyes and found that he now had a human body. He was left with no choice but to live like a vampire, killing humans and absorbing their life force.He’d kill, and he’d kill again.Until he could regain all his power and become a complete being once more, or perhaps, until he was executed as a murderer.The game’s player was set to play as the Count household’s young master, Adrian Caesar von der Paltzgraff. If he were to be executed or if he were to violate the rules of the game before gaining his full power, it would be game over.“This worldbuilding is kinda depressing.”There was an illustration there of a body being ripped open and eaten… It’s just too grotesque.I shouldn’t have bought this. I wonder if I should get a refund now.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 3": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 2Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too. (2)Translated by YonneeEdited by —After a short consideration, I clicked on the screen and the monitor became bright.The magnificent mansion I saw in the home page of the game showed off an even more opulent splendor in the light of the sun. It had pristine white walls that had no faded parts, exquisitely sculpted marble statues in the likeness of gods, and pillars that had harmoniously blended curved lines and straight edges. There was also a large, well-landscaped garden that would make you wonder if you can see the end of it even if you walk across it the entire day.In Korea, where people couldn’t live in their own houses even if they saved up their salaries and overtime pays for their entire lives, the scale of this mansion was unimaginable to any new recruit who just got a job in a small-to-medium sized company.“Ha, I don’t want to live in a place like this…”While looking around my own studio apartment and feeling depressed, character introductions and expository lines began to appear on the screen one after another.★ Leticia: Hey, Hilda! Hilda! Hurry and wake up!Leticia. She immigrated from another country and she’s a faithful servant of the Paltzgraff household. No such word as ‘betrayal’ existed in her dictionary when it came to the Paltzgraffs.★ Leticia: Hilda! You’re going back to sleep again! Wake up and bring Young Master Adrian his medicine!★ Hilda: I’m already awake.Hilda. Abandoned on the streets and naturally becoming an orphan, she was saved by a priest and sent to the Paltzgraff family as a servant.★ Leticia: Hilda, medicine!★ Hilda: Yes, yes. Older sis Catarina already went.★ Leticia: Don’t even think about passing off your duties to Catarina and just go right now! Goodness, our Young Master Adrian… I feel so sorry for him. His disease won’t even allow him to go outside that much and he’d have to take medicine for the rest of his life. No matter how chaotic the outside world is nowadays, it’s still such a pity that he can’t be free like his peers.★ Hilda: What do you mean, chaotic?★ Leticia: Didn’t you hear what happened? There’s someone walking around with a knife so blatantly. There’s even rumors that someone was actually stabbed. But why haven’t you gone to Young Master Adrian? Hurry and get up! Can’t you just get up and go?!★ Hilda: Owww. I’ll take it to him already. I’m going, I’m going!As Hilda grumbled, the screen showed a hallway—at the end of it was a large door. It was bright, yet somewhat eerie. With two raps on the door, Hilda’s dialogue came up again.★ Hilda: Young Master, I’ve brought your medicine.★ ???: Come in.Creeeak. With a sound that did not match the elegant and expensive mansion, Adrian finally made his appearance. As the count’s successor, he was the main character of the game with the role of a weak young master and the hidden identity of Satan. He was about twenty years old.Compared to his bloody appearance in the introduction, he smiled softly now, his impression completely different.★ Hilda: How are you today, Young Master?★ Adrian: The sun is a bit too bright on my eyes.★ Hilda: I shall close the curtains for you.★ Adrian: You don’t have to. Leave the medicine on the table. Thank you.★ Hilda: No need for thanks, Young Master. Please get well soon. Miss Leticia is very worried about you. Of course, I as well.Adrian currently suffered from numerous chronic diseases apart from his asthma. It wasn’t possible to relieve his pain, let alone heal him with the undeveloped medical practices of this era.Even though she knew that his illness was something that could not be healed, Hilda sincerely wished for his recovery. At this, Adrian smiled softly.He was a character inside a game, but he looked so beautiful that you could practically see the glow of a halo over his head. He looked so pure and innocent that one would never imagine he was a murderer.★ Adrian: Thank you. You may leave now.★ Hilda: Yes, Young Master. Please rest comfortably.Creeeak. The moment Hilda left, his angel-like smile vanished. As he walked in front of the table with an expressionless face, he held the medicine pouch and glanced out the window.★ Adrian: Huu… It’s not easy to move when there’s a lot of eyes around.★ Adrian: But it’s alright. This way, I won’t be suspected of being able to kill someone with this body.He looked dissatisfied with his frail body, but he still seemed to like the benefits that it came with. Considering that the count’s estate was enormous, there were many eyes watching him. It was impossible for Adrian to kill anyone when there were so many who were focused on nursing him.“This game’s difficulty is called ‘hell’ for a reason. That’s why it was a flop.”Several people needed to be killed, but it took a long time to kill even one.Perhaps at this rate, Satan would grow old and die of age in the body of Adrian that he possessed… With that thought, I sat back on my chair and controlled Adrian’s actions in the game.After clicking around insincerely, I pulled up the scenario outline on the game’s wiki page on my other screen to read the strategy guide. Then, I looked back at the game with drowsy eyes.Returning after a failed murder attempt, Adrian stood still, deep in thought. I turned the perspective screen around and zoomed in to see his face.“Well… Aren’t you handsome.”I didn’t know if it’s because I’m just plain drunk or if it’s because of the character design, but I couldn’t help but admire his face while looking at it. And I had to admit what was obvious. He had dark, angular eyebrows, neat features, moderately reddish lips, and slanted eyes. He even looked gentle as he smiled.“I should sleep now. I have to go to work tomorrow…”I willed myself to rise to my feet so I could wash up and go to bed, but my body inadvertently felt like heavily soaked cotton, unwilling to move and stuck on the chair. And somehow, even if Adrian was drawn to look as though he was looking back straightforwardly through the screen, it felt like I was having eye contact with a real, living being.I guess… I drank too much…All of a sudden, I became dizzy as the world around me spun. Regardless of my will, my eyes drew shut like heavy iron and I fell asleep right then.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 4": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 3Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayChapter 31-1. Koreans do a lot of grinding in games, too. (3)Translated by YonneeI woke up to a massive headache. Ah, shi… I already know. I should have controlled the number of drinks I had and just went to bed early. This is why people shouldn’t do things they don’t normally do. After stretching out, I rubbed my stiff eyes.What time is it now? I have to go to work.“Phone, my phone…”I habitually reached while stuttering, but when I couldn’t find my phone anywhere, I turned over once and stretched my hands out again. But I’m sure I left my phone here on my bed, and my bed isn’t that big, so I should have normally found it by now.But my phone wasn’t anywhere here. No, it wasn’t that my phone wasn’t here. It’s just that this wasn’t my room.“Where… am I?”What did I do last night? Where did I fall asleep? Did I stay out overnight? No, I definitely bought some liquor last night and went straight home. Then I played some games.With my mind still groggy, I fumbled through my memories. But then, a white letters popped up in the air.「 Level 1. No skills available. 」「 When Level 5 is reached, the skill of ‘Perception’ can be used. 」“What the, have I gone crazy. I’m seeing things, still…”I might still be half asleep. When I shook my head and opened my eyes again, the letters had disappeared, but the room remained unfamiliar. I looked around with bleary eyes.What? Where is this? Did I sleep while playing a VR game or something last night? I need to go to work.But, at that moment— Bang, bang, bang. Someone was knocking violently at the door.“Hey, Hilda! Hilda! Aren’t you getting up yet?!”“……?”“Hilda! You slept in again! Come out and bring Young Master Adrian’s medicine!”I swear I’ve heard those words somewhere before.But I don’t remember where exactly I heard it…“Hilda, you’re just hopeless. Until when will I have to wake you up like this myself?”The door slammed open and an angry face was revealed. I looked around several times already.It’s not me she’s looking for, someone else… But there’s no one else here.“Hilda? …Me?”But she’s the maid I saw in the game I played last night. I pointed at myself perplexedly and muttered. Now that I thought about it, the woman who had opened the door and was looking at me pitifully seemed familiar. She wasn’t someone I’ve met before, but someone I’ve seen in a game.“Who else would it be if it’s not you? Stop spewing nonsense and just get up already!”“……”“Gosh, take out one functioning person and everyone’s slow like this, hmph! I can’t trust anyone! No one at all!”Leticia? She’s really Leticia. With a uniquely sharp voice, she nagged like that and left through the door once more, slamming it closed.What’s going on? I need to go to work and submit a report today. If I don’t, my section chief’s going to hound me again.Staring at the closed door, I thought blankly.“Hilda, did you sleep in again? Miss Leticia’s fuming.”The door opened once more, and someone else who had a familiar face like Leticia came in. Surprisingly, she also reminded me of the character I saw in the game I played last night. Blankly, my lips moved.“Emi… Emily?”“Why are you calling me so awkwardly? Are you sick?”“What the hell is this…?”“You’re probably not awake from your dreams yet, Hilda. Hurry up and get dressed. If Miss Leticia comes back, you might get in trouble if she sees that you still look like that.”For a moment she looked at me with a hand on her waist, then she took something out of the closet and threw it on the bed. It was a gray skirt made of moderately thick cotton. There was also an old apron meant to be worn around the waist so that the skirt wouldn’t get dirty. In the game, all the maids wore the same thing.I was gobsmacked. My mouth opened and closed several times as I set the clothes down.“Wow, this dream feels so real. It’s very realistic. You said I’m Hilda?”“Hilda, just hurry up and get changed… No, this won’t do. I’ll be the one who’ll bring Young Master Adrian’s medicine.”“I…?”Emily sighed.“You better not stand out in Miss Leticia’s eyes today. She’s really strict ‘cause she thinks the servants’ discipline has become lax these days.”She looked sincerely at me with a worried expression as she said this. Then, she added, “You shouldn’t anger Miss Leticia any more than this,” then closed the door behind her as she left.“What? What’s this?”Though I hadn’t gotten past halfway through the game, I can clearly remember that this was the first time in the game that the character ‘Hilda’ brought Adrian his medicine.“Did I go inside the game?”That, or I’d gone bonkers…While staring blankly into the air for a moment, I slapped myself.I hit the side of my face to the point that my ear rang, but I still didn’t wake up. And apart from the intense pain and the vivid touch… There was the sound of the wind whistling through the window accompanied by the chirping of birds perched on a tree.If this was really a dream, that shouldn’t be possible.“Real…? Did… Did I really go crazy?!”I went into a game—no, not just a game, but a horror game rampant with murders!Why wasn’t it an otome game that’s swarming with handsome guys!Of all things, why did I have to go into a horror game…“AH, log out! Log out!”If this was really a game, wouldn’t I be able to get out if I log out? Please, just don’t log me out of life.With a trembling hand, I pressed the small menu that I saw in the upper righthand corner of my field of view. Then, the ‘New Game’ and ‘Exit’ options emerged in the air.There was no choice to log out.Then, what if I press Exit?Nervous, I pressed the Exit button. But what appeared in front of my eyes next…「 You cannot exit the game. 」Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 5": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 4Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too. (4)Translated by Yonnee“Wow, isn’t this game a prison then?”I sank down on the bed with a plummeting pulse. When I went on my computer, I didn’t know that it’d be like this. Anyway, it didn’t seem like I could choose anything on the officially provided menu.Would I need to choose ‘New Game’? What if I wouldn’t be allowed to choose that either?I slowly raised a hand to press it, but before I could—“Hilda! Why didn’t I hear you come out?! How long do I have to tolerate you?!”The door slammed open, and once again, I saw an angry Leticia. She looked like she was about to rush in and hit me dozens of times on the back right away. Nervous, I reflexively closed the menu, but it didn’t seem like the menu was visible to the other characters.“You’re wasting time here and you’re even forgetting to bring the Young Master’s medicine. And you haven’t even changed yet? So you’re going to be like that all day long? What’s wrong with your hair?!”“Uh, ah… I’m sor—”“I can’t stand it anymore. Everyone line up! You all haven’t pulled yourselves together!”Leticia disappeared while shouting, and in the meantime, Emily returned from Adrian’s room. She urged me to come with her quickly, so I picked up my clothes and followed her. This reminded me of a time when I was still in either middle school or high school, when the entire class was called to attention. We were spun round and round to death—was that going to happen here, too?With Emily in the lead, we ran out, but I couldn’t help but be filled with awe. A huge and colorful garden reminiscent of the Palace of Versailles was right there. Wow. It’s so much more vivid compared to just seeing it in a cutscene in the game.“Why are you standing so far away?! Hurry up and come here!”“Hilda, Hilda.”Emily poked me on the side with her elbow, and I belatedly noticed the glances coming my way from all sides. I took a small step forward and stood in the back.“There’s no one to blame! I called you all out here not just because of one person, but it’s because everyone seems so relaxed these days! Today, I expect everyone to work together and straighten up the garden!”“Haa…”As though it was rehearsed, sighs broke out in unison. Garden cleaning seemed to be like spring cleaning. I mean, with such a humongous garden like this, it seemed like it would take all day to straighten it out even if there were so many people here for the job.“Quiet! You won’t settle down?!”At Leticia’s scolding, everyone quieted down. She looked ten times more livid than before. Ha, we’re screwed. I didn’t think I’d receive disciplinary punishment even once.We’d have to do well from the start the moment it’s ordered so that it’ll be easy… The more people whined about not wanting to do it, the heavier the amount of work would be.“Are you not going to pull yourselves together?! Take this opportunity to clean up the rear garden together!”Look, see. I’m right.Nevertheless, some couldn’t pull themselves together and grumbled while picking up their choice of gardening tools, but fortunately by then, Leticia had left after saying that the count had come.If she’s talking about the count, then it’s Adrian’s father. Until the part of the game that I played, the father didn’t make an appearance, so I didn’t know anything about him in detail. I think I read the detailed character introductions in the game’s wiki, but because I was so wasted, I couldn’t remember anything.“Haa, and I had a bad feeling about today.”Even Emily, who figured that this would happen, let out a sigh after being scolded first thing in the morning. I made a furtive glance at her—why does she look so much like a typical NPC?—and picked up a weeding blade used for removing weeds. I went to a place where weeds were abundant, grabbed a bunch, then cut them with the knife.As the weeds were cut off with a distinct sound, it was at that moment—「 Gained 1 EXP from removing weeds. 」As the notification flashed, I saw ‘+1’ flickering in a white, shiny font at the corner of my field of view. Oh? What’s this?「 Gained 1 EXP from removing weeds. 」Again, the moment I cut up some weeds, ‘+1’ flickered in and out. So, by removing two handfuls of weeds, I got two experience points. When I looked closely at the bottom left, I saw an experience bar right there, like the ones in an actual online game. With only those two points, the bar was a little fuller just now.Wow… It’s no different than an MMORPG. I couldn’t believe that such a realistic game existed. If this game was actually released, it would be a smash hit.What do I get from gaining experience points? Do I get any skills? I looked around and found ‘Skills’ at the upper righthand corner and pressed it.「 Level 1. No available skills 」「 Level 5. ‘Perception’ 」「 Level 10. (Locked) 」「 Level 15. (Locked) 」……Oh my god, is this real? I can’t believe I can really use skills. If it’s ‘Perception’, is it like a sensing skill? Should I gun for level 5 first? But can I really use a skill?“Gosh, Hilda! You can’t just cut weeds like that! You have to take out the roots, too!”“Huh? Ohh, you’re right.”“These are weeds so they’ll grow even if you twist them around, and just cutting them wouldn’t make them go away… But you’re really weird today, you know?”Emily snatched the weeding blade that was just vaguely in my hand, and she stuck it to the ground. Then, effortlessly, she uprooted the weeds that I had cut up poorly.So that’s how you do it… I took the weeding blade from her, feeling a little embarrassed and awkward. As I was born and raised in the city and have since only been living in apartments or studio buildings, I never had to pull out weeds with my own hands. And in the game, a character would just need to click on them to take them out.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 6": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 5Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too. (5)Translated by Yonnee“Sorry, I guess I’m still half-asleep. Here, there and ooover there, I’ll clean everything on my own, so you can just scoot over theeere.”“Really? All of this? It’s too much for just one person to clean up. Aren’t you overdoing it?”Emily asked in surprise as she looked at all the places I pointed at. But rather than a tedious work area, what I saw in my eyes was a bountiful field of EXP.All that EXP’s mine!I shooed away the worried Emily while appeasing her. Then, I gripped the weeding blade.Let’s go ahead and level up first. I’m basically a level up hustler in games anyway. If I reach the highest level in this game, I might even be able to get out of here.“How did Emily do it a while ago. Kind of like this…”Pull on the weeds, chuck the weeding blade near the roots, then heave it up. My technique looked shabby compared to how Emily easily did it. Apart from the roots getting pulled out, a chunk of soil got scooped out as well, but hey, I got rid of the weeds.I was proud to see the bar filling up again. The beauty of an RPG lies within the fruits of labor, and those fruits of labor being leveling up.Alright, let’s just do it.Rolling up my sleeves in earnest, I started pulling out those weeds that were waiting for me. My hands were slow at first, but I gradually picked up the pace—and piles upon piles of weeds stacked up next to me.With how enthusiastic I was, Emily was worried and approached my side. The other servants who happened to pass by saw me and whispered amongst themselves.「 Gained 1 EXP from removing weeds. 」「 Gained 1 EXP from removing weeds. 」「 Gained 1 EXP from removing weeds. 」「 Gained 1 EXP from removing weeds. 」「 Promoted to Level 2. (Title: Insignificant Worker) 」「 Gained 1 EXP from removing weeds. 」「 Gained 1 EXP from removing weeds. 」As I pulled out more weeds like crazy, the notification window for EXP updates popped off. At the same time, my EXP bar rose faithfully as well. Good, if I continue doing this, it wouldn’t be long until I get a skill at level 5.I curled down to the ground for more than half a day and tirelessly pulled out weeds, but I was surprisingly fine throughout it all. My mind was my own, but was it because the owner of this body was Hilda, who’s a servant and a manual laborer by nature?My own physical and muscle strength in reality were nothing compared to hers. If I personally worked this hard, everything would hurt instantly.While admiring this body of a natural hard worker, tears brimmed my eyes. I’m not going to just work like a horse here and go back, right? No, I mean, I am going back, right?While thinking about this and that, I reached level 3. As with any game, the higher the level, the more EXP would be needed to reach the next level. If the EXP needed to reach level 2 was just 100, then the experience needed to get to level 3 was 200.From the player’s perspective, an increase of 100 points wasn’t much, but with me being a mere servant right now, that very difference meant 100 more weeds to be pulled.What about level 4? And level 5?To get one skill, maybe even one week of weed whacking would be enough. I continued to pull out weeds mechanically, but the road ahead became bleak.Was there any other way to get EXP other than with weeds? A daily, weekly, monthly quest or something, or some other type of achievement…“Oh my goodness, Hilda! What did you pull out just now!”Hearing the shocked voice beside me startled me back to my senses. What I’m pulling out, well it’s an ordinary bundle of weeds.「 Gained 5 EXP from pulling out Count Pfalzgraf’s prized kalanchoe. 」The very kind and detailed notification window made me gape at it.Count Pfalzgraf’s… prized… kalanchoe…? No, but why was I given only 5 EXP for it? Wasn’t there a problem with the efficiency of this game’s quest system?“Sorry, Miss Leticia! Hilda’s feeling very sick today, so…!”She had already been frantically covering for me since this morning, but poor Emily rushed in and defended me again.“What the hell kind of sickness is it. Is something wrong with your head? The Count looks at that kalanchoe every morning, how could you even touch that!” Leticia screeched.“Fortunately Hilda pulled it from the roots, so it hasn’t wilted. We can just plant it again! Sp neatly that even the Count won’t notice!”Emily tapped my hand in a hurry as she said that it could be planted again. I pretended to be very scared, placed the kalanchoe back on the ground and gathered the surrounding soil to plant it back in.Nevertheless, the expensive-looking bright pink flower withered and drooped because its roots had been lifted to the fresh outside air.Emily immediately made an excuse again, saying that water would definitely revive it. I was just nervously looking into the air, staring at nothing in particular for another reason.It was planted back in, but that doesn’t mean my 5 EXP’s going to be taken back, right?“It’s not just the kalanchoe! You pulled out so many other plants that aren’t weeds here!”While searching through the mountains of weeds next to mee, Leticia shrieked once more. This time, Emily could only sigh deeply. It’s a lost cause now.Well, there was no notification about retracting the EXP I gained.The gamedev at least has a conscience. My small, precious 5 EXP…Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 7": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 6Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too. (6)Translated by Yonnee“Do you even know that these are all top of the line plants?!”“Miss Leticia, it was a mistake! Just this once… please forgive her!”“Hilda’s the one who wasn’t in her right mind all day and wouldn’t even apologize, so why are you the one asking for forgiveness?”Leticia turned to me as she said this, a terrifying glare directed at me. Oh, then if I ask for forgiveness, will you let it slide?“I’m s—”“Forget it! I won’t forgive you even if you prostrate on the ground! Just get rid of this mess! The rest as well!”I was about to say sorry already, but the moment I started, she quickly shut me down. Emily also glanced towards me with a sigh, but I continued to stand there without a clear sense of reality.No matter how much ‘they’ talked to me with human faces, I knew that they weren’t actually human. They were just pixels drawn by someone, and they moved according to data computed with zeroes and ones.The wind brushing against my cheeks and the warm sunlight shining down on me were all so realistic that it’s creepy. But in the end, these were just pixels.That’s why there’s no way she could exert any emotions for them. It was like not feeling sorry for an NPC even if they die.…But I did feel a little apologetic towards Emily.With the gazes of the other servants gradually fading and with Emily’s comforting words, I cleared up the piles of ruined weeds.* * *As a result of running around all day and getting some EXP, I managed to get to level 4. Meanwhile, one thing I learned was that every action I did in this world was ranked according to the level of difficulty, and the appropriate EXP would be given.I got my EXP from manual labor today, but if I’d think about it more broadly, talking and accompanying someone were tasks that could also be converted to EXP.As if I was opening a gacha prize, I got pumped up. If this was a real game, then it’s all the more reason to be excited!“Hilda, go back and get some rest.”The kind-hearted Emily must’ve been greatly disappointed in me, but she took me back to my room nevertheless. Her compassion must be a programmed trait in this character, right? The way she looked at me, too, and even the goodwill she extended to me. Everything.“Emily.”“Yeah?”Emily turned around and looked back at me. My emotions overtook me, so I belatedly thought up what to say.“I’m sorry about today.”“……”“It seems like I just caused you a lot of trouble.”Apologizing to an NPC? I scratched my forehead, feeling complicated. As Emily was still looking at me, she smiled tenderly.“It’s fine. What’s something like this between us. Sleep tight now, I’ll see you tomorrow.”After saying this, she turned around once more and walked along the corridor. She was an NPC, but she’s really nice.I watched the back of her head until she disappeared. Soon, I opened the door and went in, and I was back in the room I found myself in the moment I opened my eyes. Its size was a bit more than twenty square meters, and it was densely occupied by a small cabinet, a dresser, a bed wide enough for one person, and a desk.When I entered the room, a notification window popped up as though it was waiting.「 The daily rewards have arrived. 」「 Gold +30G 」Oh, there’s a daily reward, too? When I glanced up, I saw ‘330G’ floating above next to a gold coin icon. I guess this means I originally already had 300 gold…But at that moment—white letters twinkled in the air along with the sound of a beep.「 Losses have been incurred due to the garden being ruined. 」「 Gold -250G 」And that very instant, the floating white ‘330G’ was reduced to ‘80G’.I gaped blankly at the status window. This was the dreadful reality. I got paid chopped liver, and it was exactly the same as my bank account—everything inside would just be eaten up by credit card dues.I can’t believe it. My entire fortune vanished just because I dug up that kalanchoe and a few others. This meant that those few flowers were more expensive than the cost of my labor for an entire day.Will I need to live like this from now on? Trapped in this unfamiliar world, not getting paid properly, and without a smartphone!I don’t know how high the difficulty of the game is, and I can’t level up easily. I have no skills. Earlier, I wondered if I’ll be able to get out of here if I level up fully, but at the rate I leveled up today, I just might be able to get the max level when I’m fifty. No, maybe I can get out of here at like level 10, right?“Seriously, just please let me go home!”I tried pressing here and there on the menu with my eyes on the lookout for a way back. I saw only one ‘Exit’ button that looked kind of like a logout option.“Please! I want to go back!”Every time I pressed the button, a warning window would pop up, saying that it was an action that could not be executed. But without any care for this, I continued to press ‘Exit’ like crazy.There were some games that had a bug that would get triggered when a deactivated feature got clicked on dozens or even hundreds of times. Every game was bound to have a bug, and it had always been up to the player to discover and use these bugs.“Come one, please work, please.”As though on the verge of crying, I pressed the ‘Exit’ button, but only a warning window continued to appear. What the, it really won’t work? Then how am I gonna go back home?I still continued to press on ‘Exit’ with disappointment, but at that moment, my hand slipped.I pressed ‘New Game’ instead, and unlike before, I didn’t realize until the button shone brightly.Light was emitted from the letters, and its brilliance devoured the dark room.I opened my eyes widely. N-No way.“N… no… no…”My small murmurs diminished in volume. When the bright light shining over my eyes disappeared, the first thing I heard was the sound of bird singing first thing in the morning.Chirp, chirp, chirp.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 8": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 7Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too. (7)Translated by YonneeWith my mouth gaping wide open, I looked around me. The previously dark room was now filled with the sunny morning light. It’s exactly what I saw when I first woke up inside the game. And when I glanced down, the clothes that had gotten ruined from all the weed pulling were now clean and as good as new.No, it can’t be. No way, no way…As if I was anticipating the number of a lottery draw, I squinted at the EXP bar. It’s all gone.“No, no. My… My EXP—”All of the EXP I gained from all that hard work to get me to level 4 disappeared… I was back to level 1, without even the irrelevant title of ‘Insignificant Worker’.Frustrated and filled with indignation, the moment I heard Leticia’s voice, I collapsed.“Hey, Hilda! Hilda! Aren’t you getting up yet?!”The same words during the morning I arrived at this place, I’m hearing it, hearing it again…“Hilda! You slept in again! Come out and bring Young Master Adrian’s medicine!”“I-I’m awake.”I answered reflexively at the loud yelling. The angry steps went down the stairs. Unlike the first morning that was no different than a mirage, Leticia opened my room’s door and wasn’t angry this time. Does this mean I won’t have to pull out weeds?I looked at the status window with somewhat exhausted eyes. I don’t know if it’s because I returned to the first morning, but not only the objects were restored, but even my body was in tip-top shape without any tiredness. Though my mental fatigue still remained.I can’t believe I have to spend another day without even being able to sleep… But the good thing was that all the money I had blown off from that kalanchoe was returned.My entire fortune of 300 gold… It’s a pitiful amount, but it’s still better than nothing.“Hilda!”Thinking that Leticia would come up again if I dithered any longer, I rushed down to the kitchen. I knew my way around the mansion a little now because it wasn’t all that long ago that I was playing the game. In the spacious and clean kitchen, the count’s exclusive chefs were preparing breakfast. And Leticia was…“Hilda!”She was nagging at me like a habit. I don’t know if she practiced her vocalization or anything. As I pretended to be apologetic and to reflect on my actions, Leticia only sighed and had a look in her eyes as though I was a lost cause.Clatter. She pushed forward a tray with various bowls on it, including a medicine bowl.“Here. Bring this to the Young Master.”“Pardon?”“Why are you so surprised? This is something you always do.”Why must I be Hilda? Why must I be this Hilda who brings medicine every day to the murderer with a devil within him… It was mentioned in the game that Adrian occasionally had seizures and had a weak physical strength, to the extent that it was difficult for him to move.But I can’t let my guard down. There’s still a devil inside him. Was there anyone else here who was easier to kill than the servant who was tasked to bring him medicine every day?“Goodness, our Young Master Adrian… I feel so sorry for him. His disease won’t even allow him to go outside that much and he’d have to take medicine for the rest of his life. No matter how chaotic the outside world is nowadays, it’s still such a pity that he can’t be free like his peers.”Leticia clicked her tongue and shook her head briskly. I asked reflexively.“What do you mean, chaotic?”“Didn’t you hear what happened? There’s someone walking around with a knife so blatantly. There’s even rumors that someone was actually stabbed. But why haven’t you gone to Young Master Adrian? Hurry and go!”“Ahh, ow ow ow. I got it already. I’m going, I’m going!”If I wouldn’t go this time and just idle away, I just know she’d grab my ear. I quickly left the kitchen with the tray as though I was making a quick escape. There’s no one I could pass this onto, so I’d have to bring it anyway. If I throw the medicine away somewhere, Leticia just might strangle me to death.Feeling the tension rising within me, I headed towards the infinitely long corridor that had a spectacular hall at the end of it. Adrian’s room on the fourth floor was a large room, which had the best sunlight coming in and a great view of the south garden.Taking in a stifled breath, I took one step at a time, still thinking of how I could get out of bringing Adrian his medicine.“Hu…”My strides were short and slow, but nevertheless, I reached the fourth in an instant.Adrian’s room.I stopped in front of the large door and gulped dryly. I didn’t dare knock because I knew who it was inside.It was a room where a devil was residing, so even if this side was where the sun shone the best, it was still gloomy and chilly. The walls were white everywhere, but dark energy seemed to creep through the gaps of the door.I-I’m scared.My hands were shaking, and as the tray quivered, so did the bowls. I was just drunk that night and fell asleep like that, but I really never usually played horror games. A-Comms was known for cruel and minor sensitive themes, and at the same time they were also known for making games with great cinematic artistry. Because of this, I avoided their games even more.Some horror game enthusiasts actually pee their pants if they ever played a real escape room with horror elements, but me? Someone who couldn’t even watch horror movies? I’m in a horror game?I can’t do it. Never ever.If I see a single cutscene in the game happening right before my eyes, I just know that my heart would stop right then.“Young Master.”I called him with a very small voice. There’s no way that the person inside would answer because I spoke so quietly that even a person next to me wouldn’t be able to hear.“Young Master, are you there?”There’s no way that a voice, which was so close to the whisper of a breath, could be heard twice.“It seems like Young Master had gone out for a walk? Hmm, then there’s no choice… I’ll just leave the medicine here.”Good. No one answered, right? I asked if you’re inside. Since a servant wasn’t allowed to enter an empty room without the owner’s permission, even if Leticia were to interrogate me later, I have a good enough excuse.Checking around me again if there was anyone watching, I gently placed the tray down in front of the door and ran away.I even got a bonus—1 EXP gained from bringing Adrian’s medicine from the kitchen to his door.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 9": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 8Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too. (8)Translated by YonneeJust like that, three and then four days passed. The punishment of pulling weeds never happened because I made sure to wake up on time everyday, and I only left the medicine tray in front of Adrian’s tray, too. It was nice not having to meet him in person.Every morning after breakfast, us servants had to gather in the hall for a simple assembly (read: Leticia’s sermon), and Adrian’s schedule was also regular and had no deviations, so I was able to avoid him well enough.It didn’t seem to bother him that I was only leaving the tray in front of his door, so it was peaceful. If I had offended the young master, then Leticia would have already keeled me over long before. Nothing terrible happened so far either, nothing like someone dying and nothing like Adrian regaining his demonic power.Since I had tried playing the game myself, the difficulty really was ‘hell’, so it’s hard to kill someone without being noticed. But on the other hand, this was very good for me. While carrying out the character Hilda’s missions, I could quietly look for a way to return to the real world.Though… I’ve yet to find a clue in these past few days…I paused for a moment and sighed. A notification window for EXP came up in front of me and disappeared.「 Gained 1 EXP from peeling onions. 」Getting EXP for skills like this was so slow-going. I looked at my pitiful EXP bar with a rather gloomy expression.Back then, I rose to level 4 in just one day from pulling weeds, but after resetting the game, my progress was at a snail’s pace now, perhaps because I lost my motivation. I couldn’t collect a lot of experience points from the repetitive tasks in the dull daily life of a servant, and I quickly got tired of doing things on purpose for accolades.Getting more EXP was easier when taking on the main quest, but this game wasn’t showing me a quest window or anything.I should at least gain a skill. That way, I’d know what kind of skills they were and how they could help me return to the real world. Right now, I’m so low level that even if I look at the skill window, I wouldn’t be able to see what kind of skills were available.Since this was now my reality, I was feeling anxious even when seemingly nothing was happening in my daily life.As I bit my nails, I furtively looked to the side. Aside from voluntarily peeling onions here at the kitchen, there was another reason why I woke up early today.“Haa…”It’s Catarina, Emily’s sister.I heard that she was having a hard time peeling onions in the morning. She tried to talk to the other servants to swap tasks last time, but in the end, she had to come back here because she couldn’t find another person willing to take the job.“Sister, peeling onions is hard, isn’t it? Give it to me,” I told her.“Uh, mmh. Thanks…”“Isn’t it hard to peel onions like this everyday? I’m asking because I’m worried.”There was pity in my eyes as I looked at her runny nose.“Yeah. It’s really hard to wake up so early in the morning, too…”“I know. I feel sorry for you, Sister, and you even have to cry like this every morning. Mm, it would be nice if there’s someone who could replace you, right?”“Yeah, that’d be great. But the problem is, no one wants to do it.”Answering lifelessly, she picked up yet another onion, sniffling with her red nose all the while.“Um, then, Sister. Can I do it?”“Huh? You? You said you didn’t want to do it before though.”“Thaa… aat’s because… I just thought it over, and I think it suits me now. I think the only good time to peel onions is in the morning, isn’t it? See, just like today. I came earlier than you to peel onions. So why don’t we exchange our tasks starting tomorrow?”“Which task?”“Bringing medicine to Young Master Adrian. Why don’t we swap with that?”“Really? Is that okay with you?”Her eyes widened into saucers as she asked back. Certainly, anyone would think this was weird. It’s much easier to bring Adrian’s medicine than to peel dozens of onions every morning. At least, that would be the case for someone who didn’t know who Adrian really was.“Yeah. I really can’t go on knowing that you’re having such a hard time, Sister. I couldn’t sleep at night while thinking that I’m the only one who has it easy. I wake up early anyway and I can peel onions effortlessly, so don’t worry and leave it all to me!”There! I don’t have to be so nervous every morning! Resisting the urge to jump up in excitement, I waited for Catarina’s answer with eyes sparkling with hope.Catarina opened her lips with a bright expression as though she was about to accept it, but then she looked away and sighed.“No, we can’t do that.”“Why!”I jumped up, throwing the onion in my hand without realizing it. Catarina looked up in surprise, but I had no time to notice this.“Why not! Why can’t we do that! Isn’t it hard peeling onions like this? I already said I’ll do this difficult job for you, so why…!”“Hilda. Young Master Adrian personally ordered you to do that, so how can we trade our tasks?”“H-Huh?”“I knew it, this won’t work. Young Master Adrian will be very disappointed.”Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 10": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 9Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too. (9)Translated by YonneeCatarina sniffled, threw away the onion in her hand and then picked up another one.Meanwhile, I was just confused and flustered by this new information. Adrian personally ordered Hilda for that task? Why? Were the two of them close? I didn’t see any explanation of that in the game.“It’s time for you to bring him the medicine. Hurry up and go. If you get there late again, they’ll come looking for you.”While wiping her nose, she looked towards the exit as a signal. I stood there motionless and out of sorts, and as I always did, I left the kitchen somewhat depressed while holding a tray with a light breakfast and some medicine.I messed up. If Adrian asked for me himself, there’s going to be no way out of this for me unless he dismisses me from the job. I can’t even personally say that I won’t do it anymore.“If I run into him like this, will I die?”I trudged up the stairs with a gloomy cloud over my head. And when I reached the fourth floor and saw that the door was still tightly shut, I felt a little relieved again. If I just left the tray there and went back, I wouldn’t encounter Adrian.Nothing happened after I’d been doing this for about three or four days, so there shouldn’t be any trouble in the future.There’s no law that a person would really, absolutely die, right?“Young Master, are you there?”As I did for the past few days, I whispered with a small voice, far away from the door.“You’re not here today, too, right? Or are you still sleeping? I’ll just leave your medicine and breakfast here by the door and leave.”It was quiet inside, not one peep of an answer. The sound of the wind blowing from this side of the door was louder than my voice, so of course it couldn’t be heard.Yeah, let’s not think about this negatively. I just have to live quietly like this every day. Leaning down, I barely suppressed my heart from pounding out of my chest from all this tension.Tak. A very small sound came out when I set the tray down on the floor.But right then, a clear voice suddenly called out to me from the front.“Hilda.”“……”“Did you call me?”It was such a soft, gentle voice, as though it would melt into my ears. As I looked up reflexively, my gaze met Adrian’s eyes. My body reacted belatedly with my mouth hanging open and my heart plummeting to the ground.Atop Adrian’s appearance, the devil I had seen in the game’s intro, overlapped.“Ahh… AACK!”Clatter! CRASH!I was so taken aback that I plopped on my but and threw the tray, which was now upside down. The glass bowl that was on the tray now lay scattered in pieces on the marble floor, and the liquid inside had oozed out along with six pills that scattered on the floor and rolled away. It was a mess.“I-I apologize, Young Master. I-I was just so surprised.”“Hilda, are you alright?”“I’m sorry, I’m really sorry.”I hurried over and began to pick up the scattered pieces of glass and put them back on the tray.Adrian… It’s really Adrian. Oh my god, oh my goodness, how in the world did you know I was here…My jaw was trembling so hard that my teeth started to chatter. I was so shocked that my vision started to spin. What kind of gaze, what kind of expression did he have while looking down from above? To him, I could only look like prey, right?Unfortunately, there was no one else in the hallway right now. What he needed to regain his powers as a devil was to murder people. There was a condition to the murders he needed to commit, and that was to not be caught.In other words, right here, where there was no other witness, it was the perfect chance to kill this servant who could disappear easily without any consequences.Am I really going to die here? Seriously? Without even finding a clue about how to return to the real world?With such overwhelming fear and trepidation, I wanted to cling onto his leg and beg. I don’t care about anything else, just please don’t kill me! I’ll disappear quietly. I’m not a game character, I’m just a poor player who’s trapped here after buying an A-Comms game!“Hilda, calm down.”“I’m sor… I’m sorry. I’m…”Please. Please spare me.* * *“Hilda, it’s fine. Were you surprised to see me all of a sudden? I’m sorry.”It was such an uncannily soft, calm voice. He even went down on his knees and gave me a light pat on the back. And as we were like this, I’m sure that he could see the tremors passing through my body and hear how short of breath I was.But at that moment— familiar white letters popped up in front of me.「 Gained 1000 EXP for the first conversation with Adrian. 」My dismal EXP bar suddenly shot up before I could read all the notification windows. 3, 4, 5… As the bar filled up rapidly, it stopped just a little over level 5.「 Skill unlocked! You can now use the skill ‘Perception’. – Passive 」What the, what is this?Even amidst the chaos of meeting Adrian, who just appeared so suddenly, the fact that I shot up to level 5 just made me so terribly depressed. A simple exchange of a few words with Adrian was equivalent to 1,000 EXP, in other words, 1,000 weeds.It’s been a while since the smoke had disappeared, but the moment I recalled my hard-earned imaginary furnace that took me to level 4, I cried.All the weeds I pulled…“Hilda?”“I-It’s nothing. Please… give me a moment.”At the stinging memory of hard labor that suddenly came to mind, I pressed the inside of my eyes hard.“You’re crying?”“I’m nwot. It’s just, I peeled some onions before…”“Right. The pills smell like onions.”“I had to pick them up with my hands, I’m s-sorry.”I got so frustrated at rising 3 levels at once that I forgot, but right now, the one in front of me was an outstanding murderer. I quickly went back to picking up the pieces of glass to appear busy.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 11": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 10Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play“The medicine… I’ll get some more and bring them back for you… I apologize for having surprised you, Young Master.”“No, you were surprised because I came out of nowhere.”“……”“You’ve only been hovering in front of the door for the past few days, so I wanted to ask you about it today.”“Ah, it’s just…”“Was there something I did wrong towards you?”As I placed a shard of glass, which fell in front of the door, back on the tray, I listened to his sweet voice. Wait, sweet…? As if I was chewing on the grains of sand, there was a sense of incompatibility here.Other than being sweet, was there anything else out there that didn’t suit him? He acted harmless like this in front of others, but while he was alone, he showed his true self as a devil. Even while slashing necks—whether it would be horizontally or vertically—he would make such calculations with an angel-like face.Oh my god. Please don’t cut me up vertically. That would be so terrible. Please at least leave my face intact…“O-Of course not. It’s nothing like that. I am a mere servant, so how could the master do something wrong. That’s not possible, sir.”“Then why did you act like that?”Glass-like eyes stared at me. They were so brilliantly clear and transparent, as if those orbs contained sunlight. But once our eyes met, they looked so dangerous as if they would never let go of anything. I felt like a hyena in front of a huge, majestic lion.“Hilda?”“……”His saccharine voice was so soft that it seemed to melt, but to me especially, his voice sounded so sharp as if it could cut my ears. The eyes that looked into mine also seemed to have a distorted look.No, if I do this, I’ll look more suspicious. If he thinks I’m interfering in his business, I’m done for.I finished taking all the glass pieces, my hand a little calmer now. It wasn’t because of Adrian, but I was surprised for a moment because of the broken glass. It’s as if I finally calmed down.“Actually, it’s… it’s for your sake, Young Master.”I said this in a surprisingly clear voice.”“For me?”“It’s just, you know. As people get one year older, doesn’t that mean we lose our time in the morning that could be used for sleeping? We wake up at a fixed time every day, but suddenly, it will be one hour short, and then suddenly again, it’ll be two hours short. Little by little, you’ll find yourself opening your eyes earlier, and next thing you know, you’ll wake up even in the middle of the night!”“…So?”“I thought about it every morning. Wouldn’t people be able to sleep early at night if they just complete their work much faster in the day when they get up earlier in the morning? If I live like that, wouldn’t I no longer be a mere servant, but a person who just strives to do a better job? Even so, isn’t the most important and most prominent task of my day to bring medicine to you, Young Master? But I couldn’t move up the schedule because of my poor sleeping habits, sir. Young Master, you’re at the prime of your youth and you’re growing up a lot. So, I started leaving the tray in front of the door so that you don’t have to wake up.”“……”“…It was a pity that I couldn’t see you, Young Master.”A strong desire to live was directly proportional to how pathetic a person could look.I added that one thing in the end, but fortunately, it didn’t sound like I said that against my will. This was also a test to see how close Hilda and Adrian really were.Huuu. There was no setup like this when I was playing the game. Why are there so many more details in the worldbuilding now? Anyone could see how incomplete it all is here!Currently in a different world, I imagined grabbing the gamedev by the collar and shaking him.“Young Master, oh, how can I say this. Seeing you every morning is like hearing the sound of birds chirping in the morning. A great beginning to the day, like that!”So, please spare me.“I’ve felt so bad about it several times whenever I just left the tray behind. The conversations I had with the Young Master were like, um, how can I say this, like the brilliant light during daybreak that brightens the sky…”“That’s right, Hilda. You’re one of the few people who listens to me so well, that’s why I was sad that you just left every time. The one I was talking to just disappeared.”I just spat those words out because I thought that no matter how impersonal their relationship was, Hilda would still have at least talked to him about taking the meds.But it seems like the relationship between these two was much better than I expected? Seeing how much more disappointed Adrian was than I could have predicted, he looked strangely human.Was this really the Adrian who I thought he was?For a moment, I grew suspicious of his normal appearance as a person. But I soon shook my head and came back to my senses.Don’t fall for that look. You know the true face of that devil.“I’m a little relieved that you were as disappointed as I was, Hilda. Now, come in.”Pardon? Go in, you say?“Young master, your medicine fell on the floor. Your meal also got turned upside down. I can’t allow this to go on because I’m the one who’s in charge of your medicine. I’ll go to the kitchen and get some more and hurry back.”Adrian looked at me as I actively expressed my willingness to go this far.“It’s fine.”“Fine? Oh no, it absolutely isn’t, Young Master. You have to take your medicine on time. I’ll be back soon. I’ll go to the kitchen and…”And I don’t have any plans of coming back again.“Hilda. You’re strange these days.”“…….”“Is there something you’re hiding?”The corners of Adrian’s lips went up. Those eyes glinted with an unknown light, like hell’s inferno.I froze as I was. No matter how big it pretended to be, a hyena was just a hyena in the end. A hyena that would have its chest be pierced through as soon as the lion reveals its teeth…Step by step, he approached.W-Why are you coming closer. What, why.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 12": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 11Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too.Translated by YonneeI reflexively took a step back. Every time he drew closer, it was like thunder was raging in my heart. And when my back hit the wall, I stopped breathing.“Done, right?”Contrary to how I thought he’d surely kill me, he picked up a pill from amongst the scattered shards of glass on the tray, then he popped it into his mouth. He looked down at me calmly as he gulped it down without one sip of water. I couldn’t say anything.“Come in.”“……”“I just want to talk like we did before. Are you going to keep standing there like this?”He stirred my conscience in such a devilish way. The more pitiful and pathetic he pretended to be, the higher my fear soared.“O-Of course not. The Young Master has ordered me after all.”If I keep being like this, he might kill me just because I’m annoying…Since I couldn’t take another step back anymore, I had no choice but to close my eyes and go in. Adrian watched me walk into his room like a mole crawling into a tiger’s den.As I had seen in the game, the room was quiet and impersonal. I could appreciate how neat and tidy it was, but it gave off a more lonely and empty feeling.The warm sunlight, the refreshing wind, and the sound of the friendly birds’ chirping all died down the moment they seeped through the windows of his room. It was a place where nothing but a few withered pots of plants by the window had the warmth of life.“……”“……”Our Young Count, who was tough enough to swallow glass shards and dirtied pills at once, had begged me to come into his room, yet now that I was here, he wasn’t saying anything.Are you trying to figure out how to kill me?“Um, what did I used to talk to you about, Young Master?”“Why are you asking that?”“Um… I was wondering what kind of conversations you found to be the most fun.”Even I thought it was ridiculous to have ‘forgotten’ entire conversations with him, so I changed the wording of the question slightly. Adrian sat on the other side, on the bed.“I’m not sure, I’ve never thought of that before.”As expected, it’s clear that his mind was occupied right now with contemplating how to kill me.Even if he wasn’t thinking of that now, I’m sure he’ll kill me someday. If I’m going to be in the same room with him like this, I should at least have a weapon to protect myself.Oh, right. I leveled up earlier and got a skill.Please. God of this game world, o great gamedev. Please, give me a skill that I can fight back with when he rushes in for the kill.I prayed earnestly to myself then pressed the skill window, pretending to shake off some dust.For the first time, a sparkling skill name could be seen in a status window that’s been inactive and full of lock icons until now.‘Perception’.Hm, perception… All my hopes and expectations that swelled up like a balloon quickly popped and turned to dust. It was obvious to anyone that this was a skill that wouldn’t help me in dire situations.But it’s better than nothing. When I sighed out a little bit, I pressed the skill and familiar white letters came up.「 The skill of ‘Perception’ has been activated. It shall remain activated until manually turned off. 」I was perplexed at what this was supposed to perceive, but I quickly found the answer.The pounding of my heart suddenly began ringing behind my ears, and red emergency sirens, like a police car’s, suddenly began to light up. The skill seemed to be like a warning in advance for me to avoid something urgently.No way.“Hilda, please close the curtains. The light is blinding.”“Y-Yes. I’ll do that.”And at that exact moment, Adrian lay back down in bed and asked me to do something. To check this, I looked at the emergency sirens and moved away from Adrian—it felt like the vivid red lights were fading. The sound of my heartbeats, too, which was so loud that it felt like my eardrums would burst, also became a little softer.Sure enough, it was also a skill to sense Adrian’s presence. It seemed like it would warn me whenever I got closer to Adrian, but this was going to be a useful skill in the future too if I want to avoid him in advance. But next time I meet him, this function would only be annoying.“Thank you.”“No need to be thankful, Young Master. Please get well soon. Miss Leticia is very worried about you. Oh, um, of course, me too.”“Mm. You may leave now.”I tried to recite the lines I saw in the game from what I can remember of them, but it didn’t sound too bad. Adrian allowed me to leave right away. I, will I really live?I guess he really called me here without any meaning to it. Right, he’d need to kill someone more prominent so that he could level up. What’s the point in killing a maid? It would be the same as pulling out weeds for 1 EXP.Bowing politely, I tried to control the smile that was threatening to lift the corners of my mouth.“Yes, Young Master. Please rest comfortably.”“You have to bring me my medicine tomorrow, Hilda.”「 Adrian’s favorability has risen by 1 point. 」「 Gifts given – 5/5—You can increase a character’s favorability faster by giving gifts. 」And then at that moment, I paused as I read this unfamiliar content which appeared right before my eyes in the same white letters. I had no choice but to doubt my own eyes.Favorability…? Isn’t this something that could only be seen in otome games?“Hilda?”“Ack. Yes. Of course. Tomorrow for sure…”“Don’t disappoint me.”「 Adrian’s favorability – Lv.1 (2/400) 」I stared at the words in front of me then glanced alternately between the white letters and Adrian. Then, as I met Adrian’s gaze, his eyes curved into crescent moons.It was a smile of the eyes that could captivate anyone who’d see it, but I closed the door quickly. Chills ran down my spine.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 13": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 12Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-1. Koreans do a lot of grinding in games, too.Translated by YonneeAfter finishing all my tasks of the day and returning to my room, I looked through the game interface in earnest. I couldn’t understand everything before because I was so flustered, but in fact, the basics of any game was the most important law.In order to survive in this place, I’ll need to make the most of the game system that’s been made available to me.First, the character status window.「 HildaOccupation: MaidTitle: Insignificant WorkerLevel: 5Skills: 1 」There were no HP or MP gauges that’s like the staple in other RPG games. Floating in the air was the indication of my 300 gold and other properties. Even after working hard for three to four days, my money stayed the same.When I looked to the right, I saw the red emergency siren icon that’s for the passive skill of ‘perception’. Of course, it was turned off for now.Then, another thing on the right side was a heart shape that I had never seen before meeting Adrian.The status window that appeared near Adrian earlier clearly said ‘favorability’. And it seemed like the number of gifts that could be given was also limited.When I carefully pressed the heart icon, the same list window—like with the skills—popped up.「 Adrian Lv.1??? 」Having more question marks in this list meant that there were more characters I could raise the favorability with for a good relationship. A favorability system in a horror game? The genre doesn’t match!Then, at the bottom was the experience bar that I was more familiar with.The interface looked simple now, but the higher my level and the favorability of other characters, the more new systems could be introduced.“Haa…”Maybe I can still wake up from this dream. Would I still be able to wake up from this survival-thriller game and go back to being a normal gamer?However, it felt like this flop game wouldn’t let me go until I’ve achieved a certain goal. Unfortunately, I had a hunch like that.If a player chooses the wrong class in an RPG, they’re going to suffer all throughout the game. If the player chooses to be a warrior, they’ll need to strengthen their weapons and raise their level. If it’s an archer, another archer of a similar level could hit them with an arrow, too, and that’ll be the end. If it’s a mage, they could make ice walls all they want, but if they faint due to mana depletion, it’s also the end.That’s why players try to look through the occupation or class choices before starting a game.In that sense, even from the very beginning of this game, I’ve already failed. Regardless of how high I can level up this character, if I can’t do a class change, it would be better to throw away the character and start over.Due to the nature of this game’s genre, regardless of whether I could raise his favorability later, Adrian might still kill me because, of all things, I’m a maid whose purpose is to serve him. Though I’m a small fry, if a hungry person’s faced with just any kind of food, wouldn’t it still look appetizing to them?Still, there’s hope. I didn’t reach the end of the game, and I was drunk throughout my gameplay so my memory’s a bit woozy in the middle, but I can still remember the people he’s going to kill and what tools he’d use to do the deed.Needless to say, all the characters of this mansion were candidates for murder victims, but the tools that could be used were limited.Besides that, Adrian could hardly use his demonic power at the start of the game, so maybe I could sneakily hide the dangerous tools from the weak young master.There’s nothing to be afraid of if the evil devil can’t gain any strength, right? Rather than running away from everything recklessly, maybe it’s safer to be close to him while preventing him from getting stronger.Aight. Unexpectedly, maybe it’s not going to be that difficult to survive.While looking at the pitch-black ceiling, I took a deep breath.When I first opened my eyes in this game, I was so flustered that I ran away and just screamed all the time. But now, as I organized my thoughts one by one, I could remain calm now.「 The daily rewards have arrived. 」「 Gold +30G 」Yeah, I don’t have to think so pessimistically. I’ll be able to do anything once I collect my salary every day.After all this, I can even hire a bodyguard! Or, if I save enough, I can even get out of this mansion completely!「 Losses have been incurred from breaking the Countess’ plate. 」「 Gold -300G 」As though laughing at my hopeful thoughts, those white letters quickly popped up and disappeared. I recalled how Adrian suddenly opened the door and made me break the plate. That small thing is 300 gold?The moment my shabby 300 gold had dwindled down to 30 gold, my own inner devil woke up.“This stupid flop game! This is why no one’s playing this!”I poured all my wrath at the pillow I punched dozens of times while shouting ‘flop game’.「 Damages have been incurred from lowering the pillow’s durability. 」「 Gold -5G 」“AAAAARGH!”When my salary’s already at 30 gold per day, I first wondered why I had only 300 gold in total. But after experiencing this for a few days, I realized the reason with such despair.This balance of wealth is sh*t! This place was plastered with only disgustingly pricey things all over, so there’s more chances to lose rather than gain money.At this rate, rather than Adrian killing me, I might just starve to death first.Ha. Should I just try to find out more about class changing?t/n:Class change – a character can change jobs or raise their job position (kinda like evolving in pokemon). in hilda’s case, she could do a class change by raising her maid status to a ‘lady-in-waiting’ maybe, or if it’s a complete class change to another occupation like a seamstress or some other job, that might be possible too. (i’m basing this logic from my limited knowledge of rpgs mostly via fire emblem XD i’m not actually sure if the game system here is the same)Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 14": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 13Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayThe next morning came.In the past, my first thoughts as I woke up would be, ‘I have to go to work,’ ‘I haven’t even gone to work yet but I already want to leave,’ ‘Hell subway,’ and ‘Salary when?’But nowadays, my first thoughts would be, ‘It’s time to bring Adrian his medicine,’ ‘Which ones can I live without, my arms or my legs?’ and ‘Let’s survive today and maybe not die.’Considering how roughly aristocrats lived in the era of this game, it was natural to bring him medicine like that—but it became another story if her life was always threatened.Adrian was terrifying. Even if he didn’t act scary, his backstory and role in this game frightened me. And even if he wouldn’t kill me directly, just feeling the threat to my life would eventually shorten my lifespan.Though Adrian was, in many ways, of no help to my life at all in this game, I was jealous of the other servants who think that it’s nice bringing the medicine to him.It’s already so difficult to raise Adrian’s favorability, and even aiming for being his lover would just be like going around in circles rather than solving the problem.Adrian has had a weak body ever since he was young—he still couldn’t regain his power of the devil back then—so, let alone doing his work as the only successor of the family, he had yet to enter high society.I’ve already caught his eye. Since I started my life here as a servant, if I can’t be even the tail of a dragon, I’ll be the head of a snake. I’m just trying to think about it that way.But I’m really not underestimating my opponent. All I want is to survive, I don’t even dream of success or anything like it! This is all really unfair. I couldn’t help but feel so taken aback by this.“You’ve been bringing medicine for the Young Master these days, so it’s like you can’t see anything else, huh?”“You do know it’s isn’t true that you’re talented enough to be the Young Master’s attendant, hm?”“I can’t believe you’re being so arrogant when you’re not even qualified.”Similar to a bullying scene in a teen drama, I was dragged to the backyard as soon as I went to the kitchen for my other task, and here I was forced to listen to harsh but not really harsh words.There were about ten people surrounding me, plus their leaders. I pretended to widen my eyes as I turned to look around at them.There were three main leaders—Serena, Louise, and Delores. Their names were written in pixels beside them.“You’re not worthy!”“How dare you seduce the Young Master!”“You need to know your place!”“If you think you have any weight in the County, you should just go ahead and quit and leave this place! You don’t have any shame, you’re just sticking like a pesky tick!”Just for doing my work as the young master’s attendant who brings his medicine, they’re telling me to leave the mansion. Please, I want that for myself.They gathered the day before and became united as one to fight together. I dunno with you, but I don’t want this either! My body’s all twisted up because of the frustration I’m feeling. I’m the one who wants more than anyone here to get out of this place!“We’ve heard all these, but you’re still keeping your mouth shut?”“Get out of my way.”Finally, one of the leaders stepped forward. Delores… She has golden blond hair that seems a bit faded. She’s definitely one of Adrian’s sacrificial victims.Not just her. Everyone here would eventually be Adrian’s victims one day.I suddenly became sad. Everyone’s so full of vigor right now, but unfortunately…“Do you know what people are whispering about behind you?”“How can I know when they’re all whispering behind me?”Suddenly, Delores’ lips became distorted as if she didn’t know what to answer.“If you want to serve the Young Master’s medicine so badly, just tell me. Yesterday, I broke all the plates and bowls and dropped the medicine on the floor. Since I made such a mistake, maybe he’ll let you do it. You’re qualified enough, right? I don’t really have any skills either. You all have seen how many times I’ve been scolded by Leticia just from washing dishes.”“W-What?”I expressed my wishes sincerely, but Delores’ face just turned red, perhaps thinking that I was making fun of her. As giggles broke out around us, she yelled.“What did you just say! Are you mocking me?”“I’m not. You know I grew up in a temple when I was young, right? I prayed so hard that I’ve been imbued with the holy spirit. That’s why, sometimes, I see people’s futures.”I said this while recalling Hilda’s character backstory. She had been abandoned by her parents and was left on the streets, until a priest had found her. So, before becoming a maid of the Pfalzgraf family, she had lived in a temple for some time.As I mentioned this, everyone flinched, whether or not they knew this backstory.“God has spoken to me. In the year 473—so that’s this year—the mansion shall be besieged by demons.”“What do you mean, demons?”“Right. You still can’t understand, but this is not the time for us to fight amongst ourselves. You don’t know it, but we all have one enemy. If you don’t want to die, never go around alone. Yes, especially you.”I pointed at Delores, who was standing right in front of me. Who else?“And you, and you… Even you. No—you, too. You should be careful as well.”“What kind of nonsense are you spouting right now? Just who do you think you’re fooling here?”“Remember what I’ve said. Even if it’s not a demon, maybe a pot could still fall over your head, right?”Pointing towards the pot that was barely hanging on at the railing in a third-floor balcony, Serena quickly moved away from the wall she had been leaning against.The eyes that previously disregarded and looked down on me now suddenly regarded me as though I was a shaman. They didn’t want to believe my words, but they couldn’t just ignore me either.“Then, I need to go and bring the Young Master’s medicine soon, so if you excuse me…”“……”“If you guys are late, too, you’ll be scolded by Leticia.”As I turned around after saying this, they all looked at me in disbelief. Their murmurs followed.“What the, this girl. Besieged?”“What a cowardly excuse just to keep bringing the Young Master’s medicine.”“But wasn’t Hilda originally a timid kid?”At a time when I was being called several times a day by a promising serial killer, such a thing like bullying didn’t even faze me.Right there waiting for me was someone who’d make me want to cry even more…Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 15": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 14Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-2. Koreans do a lot of grinding in games, too.Translated by YonneeWith a dark expression, I arranged Adrian’s medicine and meal on the tray. I got used to it, so it took me less than five minutes now. I should go inside Adrian’s room today, right? If I leave the tray in front of his door again, he’d just come out and surprise me again, right? Maybe he’d even say that I went against his order and claim damages for being disrespectful.In reality and in this game as well, a worker’s salary would pass through a bank account, of which the balance would hit the ground, and then the worker would have to open up if the boss told them to. It’s a tearful, vicious cycle.“Hilda! Ah, you’re bringing the medicine to the Young Master. Good work. While you’re there, go clean up the Young Master’s room with me.”“Huh? C-Clean? But it’s already spotless.”“Don’t even try to make excuses. It’s a mess right now.”Leticia suddenly made a face as she clicked her tongue. What happened?“It’ll be difficult if it’s just the two of us. Catarina, follow me.”“Yes, I understand.”Catarina, who was peeling onions meticulously in one corner of the kitchen, quickly stood up and followed behind Leticia.“What are you doing right now? Hurry up and follow.”“Yes, yes!”It felt like I was grabbed by the collar and lifted up in the air. A companion! It’s a rule that he couldn’t get caught killing someone, so I don’t have to fear for my life today with Adrian.“Did something good happen to you in the morning? Why are you so happy?”“No, it’s nothing. It’s nice to walk together with you, Miss Leticia.”When I said this with all my heart, Leticia looked at me as though I was speaking nonsense. But really, I mean it. Thank you for saving me.“Good morning, Alvan.”“Good morning, Leticia. Are you heading towards the Young Master’s bedroom?”Leticia and Alvan, the butler I had encountered in the hallway, greeted each other. Then suddenly, Leticia glanced around and lowered her voice.“The Madam?”“The physician came and prescribed a stabilizer. She must have been extremely agitated.”“What’s the cause this time?”“It must have been a dream. About that day…”“Gracious.”“When you go up, pretend you don’t know. It’s a mess.”Seeing Leticia be intimidated, Alvan looked away and shook his head slightly. He typically had the image of a benevolent, competent but strict grandpa butler. He soon turned and spoke to me and Catarina.“You both are going to have a hard time today. You especially, Hilda. I heard that you’ve been diligently in charge of the Young Master’s medicine. Take good care of doing that task. Don’t disappoint.”“…Ye…s.”“Yes. You have to lend your strength. I’m so proud to see a child, who used to be so troubled, grow up to be such a gentle young woman. Oh, I’ve been holding you here for too long. Miss Leticia, please go upstairs. It’s time for the Young Master to take his medicine.”“Yes, then.”As Alvan politely stepped out of the way, Leticia politely bowed her head and took the lead. I looked alternately between Leticia and Catarina with a curious gaze. A dream about ‘that day’? What’s it about? What happened between the countess and her son? You’re supposed to gossip behind the scenes at times like this, right?After passing the hall, we climbed the stairs. Catarina was the first to open her lips.“So it’s that.”“Yes, it seems to be that.”“……”“Right?”As if testing the waters, I drew their attention.…What is it?“It’s… that, right?”“Seeing that you reacted like this, Hilda, it really seems to be that.”Even though there were clear question marks behind my eyes, the two just nodded to themselves and said, “As expected, right?” and “Yes, it is.” I’m sad. Why is the world so against me.“That’s why, our Hilda, you should take care of the Young Master very well.”Am I the only servant in this entire mansion? Why do you all keep telling me to take care of everything? I saw dozens of other servants just this morning clamoring to be next to Adrian.I choked up the moment I recalled my days as a newbie at the office and everyone left their tasks to me.“Even so, I guess you’re praiseworthy this time. Back then, you were such a lost cause. There was nothing you could do…”“……”“When you were told to sew something, you’d mess up the fabric. When I told you before to organize the cupboards, you just destroyed all the ceramics.”“It used to be like that, but you’re amazing now, right? To be honest, Miss Leticia cherishes you a lot, too,” Catarina added.“Cherish, what are you saying,” Leticia replied.No matter how much more I hear, this Hilda character seemed to have gotten herself in so much trouble. She caused a lot of ridiculous accidents and became a beggar just to compensate for the damages she caused.I didn’t miss this opportunity. With a slightly discouraged, gloomy face, I spoke.“Then Miss Leticia, wouldn’t it be better to have another servant with you? If I make another mistake in front of the Young Master, I won’t be able to show my face.”“No, that’s impossible.”I was speaking in such an excited tone, but I was immediately cut off.“To be honest, the other servants don’t want to work well, they just want to look good in front of the young master. But you’re not like that. I think it’s because you’re older than them, that’s why you’re not scared.”No. I’m really scared. The person in the mansion who’s the most afraid of Adrian—if you ask me who it is, I’ll tell you. It’s me.“My hands are no good, so…”But we arrived in front of Adrian’s door, so I stopped speaking. Even if I knew that I wouldn’t die here since I was with two other people, it’s still scary. It really was still so frightening that, as soon as I stood in front of the door, the emergency siren began to shine faintly, but it was the crescendo of my pounding heart that made me cower even more.“Young Master, it’s me, Leticia. I’ll be going in.”“Alright.”The moment permission was granted, Leticia held the doorknob and turned it around. I entered the room last after Catarina, and without any time to look at Adrian’s condition, I was left shocked.The silent room was a chaotic mess. Ripped curtains, smashed vases and cups, soaked carpet and ink splattered everywhere… Nothing in this place was intact. Even if you tell me that a storm had passed through, it was still so unbelievable.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 16": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 15Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayPreventing herself from bursting out in astonishment, Catarina covered her lips with both hands.“Goodness gracious… Young Master, are you alright?”“Good morning. Yes, I’m not hurt.”“That’s a relief. You must have been very shocked.”“I’m fine. As you can see, it’s a lot, so you can go ahead and clean them.”He ordered us in a gentle, yet dignified tone. It could be said that he was characteristically aristocratic. It was ingrained in him to act in this way.“Yes, of course. We’ll clean up quickly.”“Thank you.”At the formal exchange of words, Adrian smiled brilliantly—ominously. At the same time, the emergency sirens rang so loudly that my vision turned red as my heart pounded rapidly. Ah, it’s so distracting.“The medicine is here, no—here, no, here… I’ll leave it here, Young Master.”With the sirens ringing so loudly, I looked for a place to set down the tray. I usually placed it on the table, but since it was turned upside down at the moment, I tried to put it on the bedside table. But that was a wreck, too. Eventually, the only place left was the bed, so I set it down at the bottom edge.Who was it? Who’s responsible for this? I’ll have to call that person here and make them clean this with their own hands.“My mother, she did this.”“Pardon?”My heart plummeted to the ground. It wasn’t because of the perception skill—it was really my heart. When he saw my surprised face, Adrian’s eyebrows shot up. The emergency sirens were ringing like crazy, telling me to get away from him right this second.“It’s because you looked so curious. Were you very surprised?”“N…o. Not one bit.”“You didn’t leave the tray at the door today.”“Yes, yes… Of course.”“That’s great. I thought you’d continue to avoid me.”It hurts. It hurts because you keep hitting the nail right on its head…Adrian smiled brightly, then he looked back at the book he’d been reading since we came here. Perhaps listening to our conversation, Leticia sneaked up to my side and threatened me with a hushed voice. “What’s this about leaving the tray at the door. We’ll talk about this later.”I stood there, on the verge of a nervous breakdown, but suddenly, it felt like I heard a low voice laughing behind me. Doubting my own ears, I turned around, but I could only see Adrian reading with such concentration. This jerk, are you trying to screw with me?“Huu, look at the state of this curtain… Huuu. My goodness, the chair also got trampled and scratched. This one, gosh, this one has been carefully shipped from across the sea…”“If it’s to this extent, did the Madam get hurt?” Catarina asked.“I heard that the doctor stopped by, so if she was hurt, he would have already treated her. Let’s clean this room up quickly. I have to stop the others from speaking of it.”I think he could still hear everything even when they were whispering quietly, but Adrian pretended not to hear anything and relaxed alone. He didn’t seem to even care a little bit, and he might have looked the same when the room had gotten wrecked like this right in front of him.Come to think of it, it looked natural for him to read books quietly like that. He looked so much like a beautiful, precious young master that no one would ever think he was a devil. Even his long eyelashes exuded elegance. And it was so strange to see the favorability numbers floating above his head and disappearing.I’m wondering. Did he perhaps not dislike people who acted a bit distant?Originally, there was no such feature of ‘favorability’ in this game, but I could see it plain and clear in front of my eyes right now. If it all wasn’t exactly the same as the game I knew, wouldn’t Adrian’s character setting be different, too? Maybe he’s not the devil, or maybe he doesn’t get his demonic power through killing people.It was a plausible enough hypothesis.But as I was in deep thought…WEE-OONG WEE-OONG!The constant ringing of the sirens was so irritating. That’s it. I’m going to mute it.“Take the carpet and go downstairs. Ha-yah.”When I rolled up the stained carpet that looked like a drink was spilled on it, Leticia beckoned me to go out. While I was in the kitchen with the carpet, I found the setting button in the skill window and lowered the volume of the sirens appropriately. Good. This much wouldn’t be loud.“Hilda, place the carpet over there. Let’s wash it together later.”Catarina said this as she followed. Seeing that there was a crackling sound as the carpet was moved, some shards of glass seemed to have gotten stuck in it. Ah, now’s a good time to talk.After setting down the carpet on the floor, dragging it up and hanging it on the wall, I hurriedly approached Catarina. She was carefully checking whether the plates and teacups she brought with her were cracked anywhere, separately filtering out some fragments of glass.“Um, Older Sis. You know, in Young Master Adrian’s room. What happened?”“What do you mean? We talked about it before already.”“You didn’t. Apart from that…”“Ah, that. What happened fourteen years ago.”“Yeah, I’m asking about that. How is it related to what happened to the Young Master’s room?”There wasn’t a backstory like this in the game. Or maybe I just don’t know about it because I didn’t get to reach the part where the countess comes out? I shouldn’t have slept while thinking about going to work the next day. I should have just played the game until the end.“What the, Hilda, you don’t remember? The mansion was turned upside down for quite a while, but you really don’t remember?”“Mmh. Actually, it’s like that. You heard what Miss Leticia said earlier, my head’s no good. I guess I forgot about it.”“Wow, I can’t believe it…”“So what happened?”I eagerly asked Catarina, who was still at a loss for words. Biting her lower lip with a frustrated expression on her face, Catarina soon gave up and sighed. Then, she soon opened her lips with a gloomy look.“Young Master Adrian is the household’s precious son. The Madam was already weak because she had a miscarriage once, so she was so happy to be pregnant once more after such a hard time… Miss Leticia often says that she couldn’t forget the Madam’s happy expression at that time. Since Milord was so busy, the Madam was almost entirely in charge of raising the Young Master, but even so, she was so happy. That is, until she tried to hold a baptism for the Young Master.”“Bap… tism?”I hiccupped in surprise.“Yeah. It happened during the Young Master’s sixth birthday. The Madam invited a priest to baptize him as a surprise gift.”Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 17": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 16Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play“So, did he get baptized?”“Thing is, the Young Master refused, so the priest decided to go back… Still though, he left some holy water behind to wish him a happy birthday. The Madam took it and splashed some on the Young Master, and that’s where this whole mess started. The Madam said that the Young Master’s skin burned where the holy water touched, and she kept saying that it was clear that the devil was within him. But if that’s the case, there should have been someone else who also saw it.”“H-Huuuh… A devil?”“I know right? Devils don’t exist in this world. If the Young Master really was one, why are all the people in this mansion still fine? Something should have already happened. I was scared at first because the Madam shouted so loudly that the Young Master was the devil, but now everything just thinks she’s gone off her rocker. Back then only a few people stayed to work.”“What about the rest? Did they quit?”“They quit and suddenly disappeared. Well, you know. There’s a lot of workers out there who run away when things get tough. There’s no reason for us to look for such people either.”“……”“Since then, the Madam has mostly stayed in her room because of her anxiety. She keeps muttering to herself, but you know, when I listen to some of it, chills go up my spine. That’s why if there comes a time that you need to attend to the Madam, just pretend you can’t hear her and come out after you’re done with work. If you happen to mention the Young Master even a little, she’ll get agitated again.”“Then today, in the Young Master’s room…”“While no one was around her, the Madam went to the Young Master’s room. I’m sure she made a fuss there and shouted at him that he was the devil. When this happens, everyone’s shushed. There’s nothing good about leaking out the fact that the Madam isn’t in her right mind.”“Wait, so only a few people know about it now? You, Miss Leticia, me, Emily… Who else?”“Um, the Count, the Madam herself, the butler Alvan, Delores… only those people I think?”For a moment, I tried to place myself in Adrian’s shoes. Adrian—a literal devil—would have been put on the spot during that baptism, and it was common sense that his constitution wouldn’t agree with holy water. What would Adrian do if these things would be used as evidence to reveal his true identity?Wouldn’t the first people he’d kill… the ones who knew the truth?“Wait, Older Sis. Did you come out of the room alone?”“What do you mean?”“Who’s left in that room right now?”When I asked her urgently, Catarina’s eyes grew bigger.“Oh, it must be just the Young Master and Miss Leticia. No one else is going to visit the Young Master’s room.”“Oh my god!”“Why are you so shocked? Are you afraid that the Madam’s there? Even if you worry about that…”I didn’t have time to explain. I shook off Catarina’s hand and ran straight out of the kitchen. I was relieved that Catarina left with me when I left the room earlier, but as I was busy trying to figure out the story she told me, I forgot who was left with Adrian.‘You can’t be dead. Oh my god. Oh Jesus Christ.’As I climbed the stairs two or three steps at a time, I could barely catch my breath. I ran all the way up to the fourth floor without taking a breather. The emergency siren icon, which had stayed silent as I went down to the kitchen, now began to glow with a red light once more.Bang! As soon as I arrived at the door, I grabbed the knob without hesitating and threw the door open. Leticia was sitting with her back facing me now as she was folding the ripped curtains. And…Adrian was looming right behind her.“Miss Leticia!”The moment I yelled, Adrian paused for a moment. When Leticia turned around, Adrian already hid his hand behind his back. Trying not to look at him, who slowly straightened his posture, I tried to slow down my breathing.“E-Excuse, me. Miss Leticia, please, with me, come… Please come with me to the kitchen.”“Why? Did something happen in the kitchen? I need to clean up a little more here.”Leticia turned back to the thick curtains in front of her and started folding them again. Feeling restless, I bit my lips.“Urgent! It’s really urgent. We have to go. Now.”“Right now?”“Right now! Hurry!”When I stomped my feet and shouted again, Leticia sighed heavily. At this rate, trouble would befall this mansion if I let this slip even once… Leticia continued to mutter like that, but as she was about to get up, she found a shadow over her.“Oh my, Young Master. When did you get up from the bed?”“A little while ago. I was going to help you because it looks hard folding the curtains.”Adrian took a step back. While I was staring at him, my nerves shooting through the sky, Leticia seemed to be so moved to tears at what he said.“How is it possible for the Young Master to have such a lovely heart? Please don’t worry. The Madam will soon be herself again as she’s being treated by a marvelous doctor. Do you remember? The Madam cared very much about you, Young Master. It would be wonderful if there’s a chance for you to take a walk in the garden again…”“Yes, yeees. That’s right. Ahaha, I remember that, too, Miss Leticia.”As I tried to hurry along Leticia’s words, Adrian’s gaze turned to me right then. Slowly, every time he looked at me slowly like this, it felt like a fire was gradually rising. In front of a predator, I shrank back as if I was his prey being backed into a corner. All that’s on my mind at this moment was I want to get out of this room right this second.“Haha, ha. Those were the good old days, but… Miss Leticia, hurry!”“Alright, alright. Really, what’s going on that it’s gotten you so worked up?”“Come on, I’ll carry the curtains!”“Goodness, fine. You’re strong anyway. Young Master, I apologize. As you heard, there’s a commotion in the kitchen, so… I’ll take a look for a moment and I’ll come back up to continue cleaning.”“…Okay, go ahead.”“Quickly, quickly!”I picked up a bunch of curtains and pushed Leticia on her back. At this, she clicked her tongue, but she soon began to walk. Quite literally pushing her out the room, I glanced behind me.Two eyes gleamed in the darkness. Those dangerous orbs seemed to be taking everything in.As soon as our eyes met, I averted my gaze towards my front quickly, as though I’d been burned.My heart was pounding wildly. Even though there was a rule that he couldn’t kill anyone in the presence of multiple people, it felt like this tenacious, sharp killing intent could urge him to pounce at any given moment.I tried to calm myself down as I recalled what I saw when I entered the room a while ago.Leticia, sitting down. Adrian, approaching stealthily.Those two pale hands reaching out were so white that it seemed like he had no blood, and they had been slowly heading towards the woman.I gulped. My throat was exceedingly dry.He was definitely about to reach towards her neck… You were going to strangle her, weren’t you?Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 18": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 17Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-2. Koreans do a lot of grinding in games, too.Translated by YonneeI was in a hurry to save her, so I made a huge fuss and dragged Leticia away with me. But, the problem was what to do next.Naturally, the kitchen was quiet and peaceful, so no matter how much one would wipe their eyes, the problem I bugged her about so urgently couldn’t be found anywhere.In the kitchen, Catarina was relaxedly looking at the condition of the plates, then she looked up and asked, “Oh my, you’re back already?” before she turned back to her task again.“Hilda. What did you say was wrong in the kitchen.”“I-It’s, you know.”“Hm? Tell me. There must have been a reason why you dragged me out of the Young Master’s room and committed such discourtesy to him. Did a mouse scuttle by in the kitchen? Is that it?”Leticia’s voice gradually got deeper and deeper. I could almost see a dark energy rising from her entire body—it made me wonder if she was actually the real main character of this horror game.I took several steps back, but I was soon caught by the other maids. I was then sentenced to three days of weed pulling penalty. Actually, I don’t know if I’m fully being penalized because when I went down to pull those weeds, she seemed to have ordered a few other people, saying that more hands were needed for the task.It was such a relief.No, wait. What do I mean, relief? Why am I glad?I was entirely beside myself in agony. Really, if I thought about this simply, these people were all just dots and pixels, even if they died. They held no warmth within them, and they acted only according to their programming.They’re not actually alive, so even if they ‘die’, they’ll come back alive if only I press ‘New Game’. There was no need for me to be empathetic and save them. I think I’m the only one who won’t come back to life if I die in this game.Seriously, I can’t believe I saved Leticia so obviously and blatantly like that. Adrian’s eyes towards me… When I think about it now, it’s amazing that I didn’t faint in front of him.I knew it. I’m sure I got caught. What I did was practically getting a shovel, digging on the ground and tucking myself in my own grave, right?Was getting out of this game too lofty a goal? It was hard enough just to survive.“Haa, let’s stop thinking and call it a day.”The sun shall rise once again. Tomorrow’s me, I’ll leave it to you to deal with Adrian.I comforted myself as I returned to my room. Then, just as I was about to lie down and rest, the white letters I’d come to love and hate popped up before my severely tired bloodshot eyes.What, why. What now.「 The daily rewards have arrived. 」「 Gold +30G 」「 The pillow was left unrepaired, and so its durability has been reduced. 」「 Would you like to visit Anna to have it repaired? 」Come to think of it, I remember one message about the pillow I punched last night, about its durability or something. No way, I’m not going. I just know this is going to cost me money. Don’t you dare threaten my life’s savings comprised of a staggering 55 gold.I just stared at the letters, thinking that this game system might have been created after extensively researching how to get me angry and effectively squeeze me dry of my property.If this pillow would get repaired, I just know that the system’s going to charge me like 100 or 200 gold. Ridiculous, right? I already know. I’ve figured you out, game system.Without hesitation, I pressed ‘No’ and turned the pillow upside down.I don’t know if this pillow had once been beige or white, but right now, it looked yellowish and filthy… It’s uncomfortable and shabby that you couldn’t really call it a pillow anymore.But then, if this pillow’s durability would also run out, will I have to compensate for the damages again? I doubt this thing could even cost 5 gold.I can pay this much. I’m a working woman who gets paid her wages.But then, the moment I shook the pillow off with a smile on my lips—「 Damages have been incurred from lowering the pillow’s durability. 」「 Gold -5G 」「 Damages have been incurred from lowering the pillow’s durability. 」「 Gold -5G 」「 Damages have been incurred from lowering the pillow’s durability. 」「 Gold -5G 」「 Damages have been incurred from lowering the pillow’s durability. 」「 Gold -5G 」「 The pillow’s durability has reached zero. Items with zero durability are considered irreparable and thus destroyed. 」「 Damages have been incurred from the pillow’s destruction. 」「 Gold -50G 」「 Your gold is insufficient. The payment has not been processed. 」Huh… This… What is this…Even before I finished reading each sentence, I got hit with the message that popped up at the bottom, leaving me dazed. Uh, I just tapped it super lightly, but the durability reached zero like that. Then it got destroyed, and the compensation for damages got taken from me again, and all my money vanished and reached zero… What?Perhaps to make a show out of reaching zero for its durability, the pillow was now torn here and there with cotton sticking out of it.“What? Does this even make sense?”The moment I saw my assets showing a plain and clear ‘0G’, I shrieked. The white letters disappeared like smoke, but the shock that was left with me only increased over time.That shock turned to despair.That despair turned to rage and frustration.“Why the hell are you doing this to me?! It’s already such a bullshit situation that I got sucked into the game, but nothing’s going right for me the entire time I’m here! What kind of game is this! Why are you doing this to me!”t/n: i’ve also recently added some images to chapters 0, 4 and 12~Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 19": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 18Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-2. Koreans do a lot of grinding in games, too.Translated by YonneeEven if I just continued shouting into the void, my anger would not subside, so I started punching the bed. Did I commit a terrible sin? What did I ever do to deserve going through something like this? I just—!“I just played a horror game while I was drunk…!”It was so ridiculous just saying it out loud, so it was both funny and sad. My emotions had been bottled up lately, and the destroyed pillow became the trigger.Tears trickled down my cheeks, but dejected laughter slipped out my lips at the same time. And as I was smiling and crying because I couldn’t handle my emotions any longer, those detestable white letters appeared once again.「 Damages have been incurred from lowering the pillow’s durability. 」「 Your gold is insufficient. The payment has not been processed. 」My fist stopped in its tracks, merely one millimeter away from the bed. If even the wind that would blow towards the bed would count as touching, I slowly loosened my fist.That decrepit yellow pillow cost me 50 gold. I couldn’t imagine just how much I’d be charged for the bed.I was angry at the game system, but I was more overcome with the sorrow of losing my gold.Okay. Let’s sleep. Let’s just think about it tomorrow after waking up. If I just get angry at the system, I wouldn’t be able to hold back and let out my screams at the wall. Let’s calm down and just lie down…「 You cannot lie down because there is no pillow. 」“UUUUGH! THIS CRAZY LITTLE—!”I was about to lie down on the bed, but I suddenly got pushed away by an invisible hand. After stumbling a few steps away from the bed, I tried to come closer again.「 You cannot lie down because there is no pillow. 」“This is crazy! Crazy! Are you really crazy?!”「 Damages have been incurred from lowering the bed’s durability. 」「 Your gold is insufficient. The payment has not been processed. 」「 Damages have been incurred from lowering the bed’s durability. 」「 Your gold is insufficient. The payment has not been processed. 」I got robbed. I couldn’t lie down. Naturally, anger soared through the roof.What kind of rule was that? I can’t lie down because there’s no pillow? There’s so many people in the world who live without pillows!I tried to calm myself down and stop the leg that was kicking the bed recklessly. If the durability of the bed would get any lower, I might really have to pay more. All my thoughts were now dedicated to officially protesting against this shitty rule.I don’t know who I’m protesting against, but in any case, I approached the bed again and opened my lips.“I can sleep without a pillow. Let me lie down.”「 You cannot lie down because there is no pillow. 」“If you let me lie down on the bed, I’ll figure out the rest! Just let me lie down!”I kept trying to lie down, but after being pushed back about five times, I collapsed to the floor. A mistake. The system wasn’t something that could be persuaded. This is why nobody plays this game—it has absurd settings that only stress out the players…Slumping down against the cabinet, I stared blankly at the torn pillow and dilapidated bed.I should have just had it repaired when I was asked if I wanted to repair it. I had two choices: let myself get robbed, or let myself get robbed while being able to rest. I’d rather be a well-rested beggar rather than an exhausted beggar…As the night deepened to the tune of regrets and all curse words in the world being muttered under my breath, I couldn’t overcome the drowsiness that gradually rushed in.I didn’t have it in me anymore to stay annoyed, so I pulled my knees close and rested my forehead there, dozing off. When I fell into a deeper slumber, my head would hit the cabinet so I woke up. I fell asleep once more, stumbled, woke up again.I really just wanted to sleep, so I tried to use my arm as a pillow, or I rolled up a few of my clothes and tried to use them as a replacement for my pillow, but I kept being stubbornly disturbed by the system, telling me that it was, in fact, not a pillow. Whenever I would get startled awake a few times, the system notification was right there in front of my nose, shamelessly making itself known.「 Your fatigue is rapidly increasing. 」「 Your stamina is decreasing. 」「 Caution! If you fail to sleep at the right time, you will not be able to work the next day. The daily salary will not be given. 」The system nagged at me and kept telling me to sleep, all kinds of notification messages popping up one after another. As though I had gained an anger management disorder, I teared up again. Do you think I’m not sleeping because I enjoy staying awake?“You said I can’t lie down because there’s no pillow!”Tears of resentment came out. Do you want me to sleep on the floor without a blanket?!Still, the messages about me not being able to get my salary urged me to move, so I tried to get up and force my way to the bed again.But as if laughing at my efforts, that invisible hand continued to push me away  and the notification window popped up once again, telling me that I can’t lie down because I don’t have a pillow.Freaking pillow, pillow, pillow! Goddamn, goddamn it…I cried tears of sorrow and frustration at the same time, going back to crouch against the cabinet and trying to sleep. My butt soon became sore because of the cold, hard wooden floor.As I grumbled for a very long time, ‘It hurts, what kind of damn game is this,’ I soon fell asleep.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 20": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 19Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-2. Koreans do a lot of grinding in games, too.Translated by Yonnee“Oh my god! Hilda!”While I was sleeping deeply, someone suddenly started shaking me. Annoying. Go away. I pushed off those hands angrily, but the other person persistently held onto my shoulders and shook me once more. I wanted to say that I was still sleepy, but I couldn’t even open my eyes because of how drowsy I was.“Hilda, come on, wake up! Hilda!”“Uhhh…”“Hilda! Are you awake now?”Emily began to hit my arms now, perhaps thinking that I had fainted and collapsed to the floor. The pain was pulling me back a bit, but the deep swamp of slumber held me hostage. And the root cause of me not waking up was because I didn’t want to.“What the… It’s already morning?”It felt like I had just closed my eyes not that long ago and woke up again, and sadly, that really was the case. I think I slept for about two hours, minus the few times I tossed and turned, fell to the floor, cursed at life, approached the bed, bounced right off. Right here, right now, my eyelids were the heaviest things in the world. A deadly kind of drowsiness filled me entirely.“Yeah, the sun rose a long time ago.”“Adri… I mean, the Young Master’s medicine, I need to give it to him… Haaaahm.”“This fellow. You yawn as soon as you wake up. You don’t have to bring the Young Master’s medicine today. Miss Leticia already did it earlier.”“What? Why?”Starting today, the only tasks that would earn me money other than weed-whacking punishment was bringing medicine to Adrian. And I lost even that.“Young Master Adrian suddenly vomited blood at dawn. The doctor came and asked if he hadn’t been taking his medicine regularly these days. But that’s not the case, right? You’ve been delivering his medicine every morning at the same hour, right?”“O-Of course.”As I nodded my head, I felt my conscience being stabbed at. It’s true that I did give the medicine to him at the same hour. But since I only left the tray in front of his room and ran away, I wouldn’t know if he really drank it or just threw it out…“Right? I knew it. I told the doctor that that couldn’t be the case because Miss Leticia was about to come and scold you again. Hilda, are you feeling sick? Why were you sleeping on the floor?”“I… I don’t have a pillow…”As I answered her, I got choked up again. I couldn’t believe I was forced to be this exhausted just because of a stupid reason. Apart from that, no matter how much of a game character I was right now, I just couldn’t get in line with not being able to sleep just because there’s no pillow.“Goodness. So you can’t sleep without a pillow. I was like that too before.”Whether a game, whether a character in it, Emily nodded. You understand? What do you mean, you can’t sleep without a pillow either? If you have a body and if you have a place to lay that body down in, you can just go ahead and lie down and fall asleep! Why is it impossible to sleep without a pillow?!…was what I wanted to say, but I was so tired that I couldn’t even move my tongue.“Since the medicine has already been given to the Young Master, can I have an off day? Emily, let me borrow your pillow. I’ll use it for just a little while, then I’ll give it back to you.”“Poor Hilda. I know you’re tired because you couldn’t sleep last night, but you can’t. Miss Leticia will really blow up this time.”“Please, just for an hour…”“You can’t, Hilda.”Emily was nice, but she seemed to resemble Leticia in her strictness. Haa. Well. It’s not the time to idle away in my room. With my bountiful wealth of 0 gold, I didn’t deserve to rest more than I did two days ago when I still had 300 gold, or a day ago when I still had 25 gold. Then, I’d deserve to rest tomorrow more than today.Seeing my hollow cheeks as I woke up, Emily felt a little sorry for me, but she was like a sharp blade when it came to work. While handing me the weeding blade, she kindly introduced me to the workplace I’ll be in for the next few days.“It’s here. From this side to that side, I was told that you have to remove the weeds and clean up over here.”Luckily, I knew this place like the back of my hand, more than I do with my own room. The first day I entered the game, I worked my butt off right here.That is, I knew just what kind of traps there were.While clutching the weeding blade tightly, I stared intently at the hot pink flowers that were hiding like trap cards between the weeds. Just thinking about how much gold I lost because of that kalanchoe made me want to shed tears of blood.It would have been better if I could get some kind of warning message before I’d do something wrong, but because the daily rewards came after the day had ended, I wouldn’t know what I had done wrong and just continued to work hard.However, now that I have the wisdom of playing through this game system as much as I had—since I had bitten more than I could chew—I wouldn’t get caught anymore in such an obvious trap. I’m going to get all the EXP and gold that I can today!With a strong determination, I vowed not to lose anything to the game system.Like a soldier going to war to save her country, I gripped the weeding blade resolutely.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 21": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 20Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play「 Gained 1 EXP from removing weeds. 」「 Gained 1 EXP from removing weeds. 」「 Gained 1 EXP from removing weeds. 」“It’s a relief that you seemed to have recovered your energy while working. Right, let’s keep up the good work!”Emily ran back after saying such a line with such vigor, that line being something that you’d only hear in some sports anime. I looked at her for a moment before I focused right back to my weed-whacking.My goal for today was to reach a decent enough level from the EXP I’ll get! For these few days while I’m safe from Adrian, I should level up and gain some skills.But maybe because I spent last night not sleeping, I had to shut my eyes a lot whenever I found myself staring blankly into the air. I woke myself up in a hurry and shook my head.If I get caught sleeping in a place like this, I might get kicked out of this mansion and really become a beggar. Then I’ll be homeless and I’ll die in a ditch somewhere without ever knowing how I could go back to the real world… That can never happen!“But I’m so tired…”The grip I had on the weeding blade loosened slightly. If I could lie down and sleep right now, I might even sell my soul to the devil.As I yawned and hit my stiff neck and shoulders, those white letters popped out as though they’d been waiting for the chance.「 Work is not going smoothly because your fatigue is too high. 」“Huh? No. No way. Think this over again. I’m not tired though? I’m doing a good job?”I quickly pulled out more weeds, my eyes as wide as saucers. Wow, I barely slept a wink last night, but I’m not tired at all? Hilda’s a natural at manual labor, I guess. While working, my mind becomes so clear, like this much!As if shouting into the air, I quickly handled the weeding blade. Don’t ever show any openings. I don’t know how this game system’s going to screw me over again if I ever give it the chance.But no matter what I did, the system was relentless.「 The success rate for weed pulling is dropping. 」「 Weed pulling: Failed. 」I stared back at the white letters with a look of devastation. The notification windows that popped up every time I gained some EXP didn’t appear this time. You’re not going to give me even this nail sized EXP?「 The success rate for weed pulling is dropping. 」「 Weed pulling success rate: 80% 」「 Your daily wage has decreased. 」「 The amount of EXP acquired has decreased. 」「 The success rate for weed pulling is dropping. 」The more weeds I pulled, the more tired I got, and because of that, the only notifications I received were about my success rate and my salary dropping. I thought about quitting, but I pushed that notion aside. I couldn’t give up hope that if I just kept trying, my success rate would go up and I’d get more EXP again.「 The success rate for weed pulling has reached rock bottom. 」「 Your daily wage has decreased by 20%. 」I worked hard on pulling weeds until the late afternoon, and yet the only thing I got in return was… nothing. I couldn’t get any EXP and my fatigue had reached the limits.This was all caused by a single pillow. I couldn’t help but burst out laughing in despair.“Hilda! How could you make the garden like this?!”What the system kept spitting out about the success rate failure turned out to be true. Leticia came by after she was done with her work for the day and started nagging me, asking why the garden looked like this. Since I’d been causing one ruckus after another, she seemed to be thinking that I was rebelling.Out of all the crimes out there, the scariest one was the crime of disgrace.“Hilda, what’s wrong with you these days? Did you catch a disease that you’ll die from? Or is there something you’re upset about with me?”In the end, Leticia took my hand and asked me imploringly.Now that I thought about it, it didn’t seem like this game should be categorized as horror.A tragedy. The trashiest tragedy out of all trashy torture-fest tragedies.Nothing big or amazing was happening, but it wasn’t like I gained the talent to deal with something like stopping blood from flowing. I was just going through the motions of bothersome and cumbersome things to do, as if I needed to scratch an itch that I couldn’t reach.If there was some sort of determination not to make this game into a tragedy, how was it that everything somehow got wrecked anyway?“I’m sorry. I’m not doing it on purpose.”I answered honestly. I meant it. I suddenly found myself inside this game and I’m just trying to survive. I never tried to make a mess out of things. That’s why it’s all the more unfair.“Huu. Okay. I know you’re not like that. You’re not an ill-tempered kid, and… things just didn’t work out for you, I guess.”“I’m really sorry.”“…Okay. I’ll finish cleaning up here, so go up and rest. Oh, but I have a favor to ask you before you go back to your room.”Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 22": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 21Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-2. Koreans do a lot of grinding in games, too.Translated by YonneeI nodded, feeling apologetic about leaving the clean-up to her. I was a little tired, but it wasn’t to the point that I couldn’t do a simple task she’d ask me to do.“You already know about the mess that happened at dawn, right? The Young Master’s duvet got dirty and I had it washed. It must be dry by now, so go and put it back on the Young Master’s bed.”“At this late hour? He must be resting. Maybe he’s already asleep.”“The Young Master said he’d be at his study until late tonight. His room has been empty all day, and it should be like that until now.”“Alright then, I’ll do as you say.”It wasn’t so difficult as long as Adrian’s not in the room. I rolled up the dried sheets that were laid out under the sun the whole afternoon, then went up to the fourth floor with the duvet in my arms.As dinnertime approached, this was the busiest time of the day for the servants. The count, the countess and Adrian always ate separately, so the amount of food and the dishes prepared for each meal was a lot more compared to a single table setting where three people would eat together. That’s why now was the time when each servant had things to do and had no interest in each other’s business.I climbed the steps quietly as I heard the serving carts rattling and moving hastily. Adrian should be eating now, too, so I don’t think I’ll bump into him in his room. Oh, thank god. If he noticed how I wrenched away Leticia earlier in the day, I don’t want to imagine what he’d do to me while we’re alone.“Young Master?”I glanced around the room, sticking my head through the slightly opened door. Fortunately, there were three candelabras lit, and none of them moved to indicate any movement.I’ve entered this room a lot of times now, but I couldn’t get used to how dreary and gloomy it is. It’s strange how this room is supposedly the one that’s in the best spot for sunlight to come in.Before Adrian returns, I gotta finish this quickly and make my escape.Feeling a bit spooked, I glanced left and right at the corridor and turned back to look into the room. Finally, I tiptoed in. I changed the bedspread at the speed of light, pulled over the duvet I had set aside for a moment, then arranged the pieces one by one.Just as I saw in a hotel before, I layered the pillows daintily against the headboard and spread out the duvet. Will I be paid for this too during the daily rewards?“Ah, stop thinking about idle things. Just run away before Adrian comes.”If I get caught, I might really die. With this thought in mind, I carried the bedspread that I had removed earlier in my arms. As I was about to turn around, something white and fluffy caught my eye. An invisible hand grabbed my chin and made me ‘look’.“…Pillow……”The word slipped out of my lips as though I was possessed. Of all the pillows I’d ever seen, this large, fluffy pillow looked so mesmerizing that I was salivating even though it’s not something meant to be eaten.Dropping the bedspread to the floor, I approached the bed. And, slowly,  I reached out one trembling hand towards the pillow—but then I recoiled in fear.Can I touch it just once? Because it looks really soft.It’s just one touch. What’s wrong with that? Adrian must still be in the middle of his meal.The hand that was recoiled earlier finally reached out fully and touched the pillow. My expression was instantly tinged with amazement.“It’s out of this world…”It was so vastly different from my poor yellow pillow. Under my touch, it felt as gentle as an angel’s feather, soft yet durable at the same time. With this kind of durability, I don’t think it’ll ever break even after a few punches. I caressed it gently, as though it was a kitten. It was so soft that it felt like my palm would melt.I gave into temptation and leaned my head against the pillow. Then, unable to resist the heavenly sense of satisfaction, I eventually lay down on the bed and covered myself with the duvet.Oh, how comfortable, how warm. It felt like all the fatigue I had accumulated since last night vanished without a trace. If I die now, I will have no regrets…As I let out a deeply satisfied sigh, the white letters that I hadn’t seen for a while blinked in front of me.「 Your fa… tigue… has… mode… 」What the. What’re you saying?Grumbling inwardly, I squinted at the white letters that were no better than a bully. Why can’t I read the letters? I wasn’t even crying, but my vision was wavering as if there were tears over my eyes. Just to read those blurred letters, I had to really squint and make an effort to understand.Fatigue… and then what. The rest was like a watercolor painting, but with water spilled over it. What on earth was it trying to say?“Fatigue… stamina… uh… haaaahm, slee…eep, mode…”I literally read it just now, but I couldn’t understand what it meant—as if my consciousness had been completely separated from reality and had gone to a faraway place.I’m sleepy. I’m comfortable. With how sleepy I was, I yawned even in my thoughts. Like the shadow creeping across the wall as illuminated by the candles, my consciousness grew dim.Soon, I closed my eyes.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 23": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 22Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play1-2. Koreans do a lot of grinding in games, too.Translated by YonneeAdrian was bored.He’s been bored ever since he opened his eyes in this world.Perhaps it’s even something he’s been feeling since he had been in hell, where he lived countless years before.Adrian Caesar von der Pfalzgraf.Before being reborn into this body, which seemed like it would die with just one measly touch, his name was Satan.The most faithful vassal of the netherworld’s monarch, the sharpest sword, the demonic army’s commander-in-chief.He was the epitome of what a devil should be as he lived in honor. There was no devil out there who would not bow at the mere mention of Satan’s name. Tens upon thousands of demons looked up to him as they bowed at his feet.The monarch he served had a daughter. Born with the blood of royalty, Lilith was born to be a devil. She was the very picture of pure evil, and Satan was quite pleased with her.He loved her as he would his child, cared for her as a disciple, and served her loyally as his future liege.Known as the night itself, as a curse—Lilith, the devil of lust.Perhaps due to her lineage, but everything for her was natural. Her growth was fast, more so her ability to learn and her adeptness with gaining her subordinates’ trust. As she grew up as a devil day by day, her desire to take the throne, too, came early for her.“Daughter, you do not have to start a way. When the time comes, you will take this place naturally instead of being branded as a traitor.”“I shall take the throne that I deserve, old king.”Since then, the netherworld had been thrown into a war that would last for hundreds of years.Those who had something and someone to protect, against those who wanted to win. It was a war between a firm hold over the throne and those who wanted change.Lilith wanted Satan to be on her side, but Satan instead raised his sword in the name of the monarch and swore to punish all those who dared to revolt. Every time they faced each other on the battlefield, Lilith would cry out with resentment against his betrayal.The war did not end easily. Each and every battle that was waged, whether small or large, left a great wound on both sides.As time went by, Lilith grew more resentful of Satan, and every time she faced him, she would spin a curse on him. And finally, when Lilith’s blood had been spilt, the curse came to its completion.【 My teacher and my friend, traitor and the one who leads the enemy. Just as I had lost everything because of you, so too will you lose everything because of me. 】Already on death’s door, her lips uttered out a terrible voice. The blood that trickled down to the floor transformed into the devil’s language and spread out.【 You shall be born into a human’s body, considered to be the most inferior, and you will not be able survive lest you eat away their vitality. 】【 Endure eternity with those parasites and suck the blood of those pigs. The moment the herd’s watchman finds you, they shall tear you to pieces. 】【 At last, you shall meet a natural enemy that you will not be able to kill with your own two hands. 】【 And if you are killed, so too will your world come to its end. 】The curse crawled over his skin, seeping in like poison, and soon became engraved into his blood.It was a curse made by a devil that had inherited the blood of monarchs, completed with the last of her vitality. Even Satan, who was considered to be one of the strongest of all devils, could not completely nullify the curse. And so, as his body received this curse, he became exiled from the netherworld.Exactly as Lilith had pronounced, Satan lost all his strength and opened his eyes to the body of a human.As he had lived with the strength and body that was incomparable to any devil out there, the frailty of man came to him as a shock.Devils could walk around as soon as they opened their eyes and could also already naturally use their powers, but humans needed to lie down for such a long time even after their birth.He couldn’t speak, he couldn’t stand up, he couldn’t even eat without the help of another human being. When he could finally get up on his own, each step he took was slow and complicated to do. And even if he barely endured that time, it still wasn’t enough.But he persevered. He figured that just as devils would grow up perfectly after six, so too would humans.However no matter how long he waited, this human body never grew stronger. This human skin was so fragile that it was so easy to penetrate, this body was so vulnerable to numerous diseases, and he was prone to falling sick.Rather than getting stronger over the years, rather, he grew even weaker.There was also the matter of a weak mentality. The woman who gave birth to him was so weak that she had gone mad the moment she realized that her son could not be baptized.“That’s why they’re more interesting, right? Isn’t it fun that they have weak bodies yet such arrogant souls.”Lilith used to be interested in humans. She said that they were interesting and that they were worth observing.As her teacher, Satan took the curiosity of his young student for granted and thought that her interest would soon fade. It was something along the lines of living in the moment. This was because she tended not to be interested in the same thing for a long time.However, Lilith’s curiosity lasted for much longer, to his surprise. Besides that, she spent more time observing the humans rather than the devils. That’s probably why she had cursed him to the body of a human body. Just to make him feel how weak and insignificant he was now.Moreover, Adrian’s body was much weaker than that of a normal human being. If he didn’t take his medicine on time every day, he would vomit blood. If he walked for a long time, he would often lose consciousness.So to speak, if he was a devil and this was his condition, the other devils would have already eaten him as food. But human society wasn’t like that, and thanks to the high peerage of his birth parents, he could even control other humans at will.The humans of this mansion were so deferential that he could recognize the tops of their heads more than their faces.Then, at seven years old.He inadvertently killed one human.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 24": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 23Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayAn unlucky servant tripped and fell down the stairs below. He came across the servant belatedly because no one usually passed by this place, but that servant’s neck had already been twisted. He killed the servant with the book in his hand because the servant was dying too slowly.If there was no hope of living after this anyway, it was another form of mercy to kill someone right away.Then after this, he felt that some of his power from being Satan returned slightly. In particular, it was the power of hypnosis, which he often used against other devils. As this returned, he was able to project his will and commands into the minds of other humans.He finally understood Lilith’s curse to some extent. She meant that he should kill humans to regain his strength, but not to be caught. As a noble who was constantly surrounded by servants, there would not be any other more demanding condition to curse him with.When the corpse was discovered, the house quickly fell into chaos and unease. They were certain that the servant had fallen down the stairs, but they whispered amongst themselves about the suspicious marks on the corpse’s neck.Because the household had a high peerage with the status of a count, rumors soon subsided as though water had been poured over the embers. But still, there were still signs of vigilance. No one wanted to be left alone, and they would always move in groups.Adrian decided to take his time with regard to regaining his strength for the time being. It was necessary for him to lay low so that he wouldn’t be caught by the countess’ occasional accusations. And if anyone would come forward to spray him with holy water, it would be troublesome for him.He then proceeded with his work in a leisurely manner. As a devil, he would have already committed genocide, but he just restrained himself when there were many people around him, and then he would search for prey when their vigilance would come loose.The most appropriate targets were the servants who had come into the mansion not too long ago, so the others wouldn’t find them even if they disappeared, dismissing their behavior as poor work ethic.His strategy was centered on waiting for easy prey, but he would bite down without any hesitation the moment they appeared.Slowly but steadily, he regained his strength. Thus far, five people had ‘disappeared’ from the mansion, but no one else but he knew that they had died.The reason he could defeat Lilith before was not because of his overwhelming power or resourcefulness—it’s because of the temperance and patience that he had accumulated over the years he had lived. This was his weapon that ordinary devils did not have.Apart from this, his identity as a count household’s young master and his body being this frail was quite advantageous to him. Rather than suspecting him as a cruel murderer, everyone who met him would only feel sorry for him due to his health.The more strength he regained, the more convenient his life became. It was still necessary for him to search for prey and create traps in order to avoid the prying eyes of other humans. If he would ever come into an unavoidable situation, he could at least cover it up through his power of hypnosis.Still, when persuading humans, their sense of survival was beyond his reach. Survival was a human instinct, and his hypnosis could not permeate through this.‘What if I just kill these people inside the mansion all at once?’He thought about it many times, but he still needed to interpret Lilith’s curse, and he couldn’t move hastily. He had yet to find any clues leading to who the watchman and the natural enemy were.“The end of my world, she said.”It was an interesting notion to consider one more time. He and Lilith used to exchange riddles and ask the other to give the right answer, and Lilith’s final curse was also a similar mystery. It was the dead Lilith’s final gamble. He should at least enjoy it enough.“Hm? You must be done, Young Master. Are you not feeling well?”Leticia was the most loyal and the most boisterous human in this mansion. Alvan usually was a man of few words, but he paid close attention to Adrian.Instead of answering, he picked up a piece of meat with his fork and brought it to his mouth.As a matter of fact, as Satan, he had been a great connoisseur. He would mercilessly slay the enemies in front of him, but it was also true that he’d delay entire wars when there was food on the table made by excellent chefs.The only food he ate were the ones that tasted good, but with his condition now, he had to eat to survive. This human body was still, as ever, useless and inadequate.“Young Master, is something the matter? You don’t look so well. Shall I ask them to cook it again?”“……”“Or are you perchance feeling uncomfortable? Would you like me to get you some medicine?”Leticia was quite easy to use, but there were times when she just wouldn’t keep her mouth shut and had to be reprimanded. This was his favorite meal. She was getting in the way.Adrian slowly chewed the meat in his mouth, lowered his fork and knife, then glanced at Leticia.‘Get out. Quietly.’Then as though she had lost her will, Leticia stopped all her ministrations, turned around and left the room.Now he’s resorted to hypnotizing someone for such a trivial matter. Having a servant at his beck and call made his life more convenient, but some troublesome things still sprouted here and there.Leticia left the room in a bit of an unnatural manner, but Alvan still filled the wine glass as though nothing had happened.This butler was a very useful human. He wouldn’t open his lips until his master spoke first, and he wouldn’t dare question his master’s actions. There wasn’t yet a time when Alvan needed to be hypnotized.With this in mind, and if he had to consider the future, it might not be a good plan to kill everyone in this mansion.If he’d kill them all, who would cook delicious food for him?When Leticia disappeared, he could enjoy his quiet evening again. Adrian sliced another piece of meat and brought it to his lips. As he did so, he recalled what happened with Leticia a few days ago.Now that he thought about it, there was one maid who was acting strangely.A woman with pale brown hair who came running back to his room just to find Leticia.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 25": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 24Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayA few days ago—“Miss Leticia!”When she saw him approaching Leticia from behind her, the maid had gone as white as a sheet as though she’d seen a ghost.Before this, she had disappeared with all sorts of excuses spilling out of her lips, but she suddenly came back. It’s as if she had belatedly realized that she left Leticia alone with him.“E-Excuse, me. Miss Leticia, please, with me, come… Please come with me to the kitchen.”“Why? Did something happen in the kitchen? I need to clean up a little more here.”“Urgent! It’s really urgent. We have to go. Now.”“Right now?”“Right now! Hurry!”Frantic, Hilda had stomped her feet as though she was standing over fire. Whenever she felt Adrian’s gaze on her, she would only sneak back a glance at him and tried not to make any eye contact.He could still hypnotize someone without having to look into their eyes anyway. So, Adrian stared at her wordlessly and used his power of hypnosis, just as he usually did.‘Look at me.’“Miss Leticia, hurry!”He hypnotized her just as he did with other humans, but there was no change. If the hypnosis worked properly, then she should have paused and stared back at him with an empty look as if she’s entranced.‘Say that you’ll stay in the room.’“Come on, I’ll carry the curtains!”Even when he tried to hypnotize her again, it didn’t work. It’s like all of his suggestions were being warded off by an invisible wall. The maid’s frantic steps grew faster and faster, so it was getting noisy.…Look here.“Goodness, fine. You’re strong anyway. Young Master, I apologize. As you heard, there’s a commotion in the kitchen, so… I’ll take a look for a moment and I’ll come back up to continue cleaning.”“…Okay, go ahead.”“Quickly, quickly!”As if she was being chased by death, she dragged Leticia out the room, and until the very end, she never made any eye contact with Adrian at all. He tried to hypnotize her one more time before she left, but she didn’t even take one glance behind her.“…Now isn’t this unusual.”Adrian stared at the closed door. What’s unusual wasn’t limited to just his hypnosis not working on her.It was the way she was treating him. Her attitude towards him had become extremely different, so it was inevitable that he’d notice it.If this maid was someone who had just started working at the mansion, he would have taken this in stride and just brushed it off. In a way, he’s someone who could control his own life, and it was warranted that humans would be scared of him.But Hilda was different. This had never happened before for as long as she had been working in the mansion, and it was easy enough for her to do her task of bringing his medicine.Yet right now, she was avoiding him, and any chance that she failed to avoid him, she would flinch and jump frantically as though a devil had appeared from the netherworld.This right here, didn’t it seem like she’d become a completely different person?Did she notice that some of the people who had disappeared from the mansion had died in his hands? No, that couldn’t be the case. He hid his actions very well so that no one could know, but suddenly he’s been caught?That’s ridiculous.On top of that, why wasn’t his hypnosis working on her?She was easy enough to handle in the past, so he never found the need to hypnotize her before this—that’s why it’s also difficult for him to compare since there’s no point of reference.As he thought back to this unsolved puzzle, his appetite gradually declined. Today, the steak that had been so tenderly cooked felt quite tough. Adrian set down his fork, but at this, Alvan was at his side right away.“Have you finished your meal, Young Master?”“Mmh.”“You didn’t eat much.”“Clean this up.”Adrian rose from his seat and went straight to his room.He wondered if his hypnotic powers had weakened, but when he used it on a servant who was passing by, it worked without a hitch. Like a puppet hanging from strings, he made the servant walk at will, make a face, and even stand on the windowsill. He couldn’t make the servant jump out the window however.That wouldn’t be fun.He ordered the wobbly servant to go down from the windowsill and made him go on his way again. On a normal day, he would walk along the mansion’s tranquil darkness, head back to his room and listen to an opera record. But because his thoughts were all tangled up, he couldn’t unfurrow his brows either.Did she notice his past murders? Or was she the ‘natural enemy’ that Lilith referred to in the curse? It was only a guess, but there’s a good chance that this really was the case. The line ‘will not be able to kill’ could be interpreted as him not being able to use his powers on her.What to do. If she’s his natural enemy, then rather than killing her, he should let her stay by his side. The wisest move here was to end his ‘world’.But then all Hilda did was to run away from him and flinch at any given time. She didn’t even try to talk to him or stay longer in his room.How could he make such a woman stay still and talk to him?As he reached his door, he was still lost in thought, but it was at this moment that he paused because he suddenly felt someone else’s presence inside. The servants would usually clean the room or change his bedding while he was away, but they always left before it was time for him to return.This had never happened before, but he could clearly feel someone else inside the room that he had previously left empty. It could be surmised that the one staying inside had a different purpose.Had Lilith’s remnants come to him?Heightening his senses, he grabbed the doorknob and twisted it. This situation was something he was displeased with, but if this was a slim chance of regaining his original strength again, it would be possible to drag it out. His hypnosis would also be a great help.Creeeaaak.At last, as soon as the door opened, a loud, unimaginable sound broke out.Zzzzzz.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 26": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 25Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play2-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by YonneeHow comfy. Is this what it feels like when they say your body melts into your bed? I was fast asleep, and I never wanted to wake up. It’s like all the fatigue that had accumulated was gone in an instant because I had a good night’s sleep, without even any dreams.Just how long had it been since I last slept so soundly? Dunno, but it’s clear I never had such a restful slumber ever since I got dragged into this game.“Haaa…”I snuggled into the silky soft duvet around me. There was a crisp scent to it, reminding me of how well it had dried under the sun.I was so happy at this moment that I even let out a languid sigh.Oh how I wish I could sleep in this bed every night. But I can’t, no I can’t.Whose bed was this again? I don’t know how long I’ve been here, but I really should never because…Mmh? Whose bed?As I was talking to myself, I opened my eyes to this strange train of thought.Whose bed was this?Though I was still in a daze and unable to come up with the right answer, one thing’s clear—that antique ceiling wasn’t the one I was meant to see every morning.What the, where the heck am…“Huk!”I almost had a heart attack right then and there. The moment I turned to the side, my eyes grew wide open.None other than Adrian was sitting right there.His armchair was near the bed, and with his chin propped up on the back of his hand, staring quietly at me. I quickly wiped the drool trickling out of my lips and asked calmly.“W-What brings you here, Young Master…”Sir, are you filming some horror movie or something?The devil, whose face was only dimly visible in the darkness of the room, made reality feel like a horror movie.“Hilda, what brings you here?”At first, his voice sounded so gentle, but his cold, emotionless tone made me freeze up. I’m in Adrian’s room right now. I went ahead and fell asleep in his bed…Crazy, crazy. All this time, I was in Adrian’s bed?“I’m truly, utterly sorry for this. I’m so ashamed of what I’ve done. I’m… I don’t know if this would explain the transgression I’ve committed, but I couldn’t sleep last night because I didn’t have a pillow. Working in the garden while I didn’t have a wink of sleep made my fatigue accumulate, so… I only came to change the sheets, but I fell asleep.”Come to think of it, I wrestled with weeds and desperately struggled against the game system throughout the day. I couldn’t see it now, but I’m definitely filthy with mud. If I slept in this bed while covered in dirt, then, don’t tell me…“Huk…”Because it’s dark, I couldn’t see clearly. But the spotless sheets and blankets I had prepared earlier were now definitely covered in mud just as I thought.My already bleak future completely turned as dark as the abyss. No. Wrong. There’s not even a chance of recovery here. I’ll die, but even if the medics come in with defibrillators—chief, there’s no hope left for this girl. I wouldn’t even be able to say anything if Adrian decides to kick me out of the mansion on the spot.If he was an ordinary aristocrat, he would have already hit me with the lines of, ‘A commoner like you,’ ‘How dare you,’ and ‘Do you know who I am?’ But rather than that, Adrian just continued staring at me with a penetrating gaze.Some people might think that he’s hypnotizing me with his superpowers or something, but I guess he’s just so angry that he was at a loss for words. Yes. Totally understandable. His pillow was now soaking wet with drool that there was even a mark left… Oh my gosh. This is humiliating. I’ll turn it upside down while he’s not looking.“I’ve, um, unintentionally made the sheets dirty again, shall I wash the sheets and the pillowcases for you? When do you think you’ll sleep, sir…”“Stay still right there, Hilda.”“I-If you don’t want that, w-would you like to switch beds with me? I don’t have a pillow, though… But it’s at least cleaner than this bed. If the Young Master rests for just a little while, I’ll hurry and clean up here and then fetch you again.”“…It really isn’t working?”“Okay, so you also don’t want that. U-Ummm. What should I do? Should I hit my head?”I could hit my own head for as many times as you want as long as you spare my life. My pride’s a little hurt, but pride won’t keep me alive.I was ready for my punishment any time, but for some reason, Adrian just kept staring at me without saying a word. It seemed like he’ll just continue looking at me like that until there’s a hole in the middle of my forehead.Rather than violently bashing my head against the headboard or something, this reaction was much more burdensome and terrifying. It’s like he’s thinking about how to cook me after killing me!“…Really, it doesn’t work.”Half disappointed, he turned his head to the side and finally averted his gaze. Was he really trying to drive a hole into my forehead?“Never mind. Leave.”“Uh, but the bed…”“I’ll take care of it myself, so just leave.”It was a voice rather filled with exhaustion. Even when the heavens had crumbled, there was still a light at the end of the road. Was he really sparing my life here?Instead of jumping for joy, I blinked in surprise. Being a mere maid that I was, I tucked myself into the bed of the young master of a high-ranking noble house, and even slept there, but you’re letting me go?I was going to ask him ‘Why?’ but you know what, let’s not do that. If he finds the reason for it, he might change his mind and really kill me.I’ll be good and leave when you tell me to leave.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 27": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 26Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play“Then, I’ll just…”Afraid that I might tick him off, I went on my tiptoes and walked away as soundlessly as possible.I survived!With this exaltation going through my mind, I left through the door—then white letters flashed before me.The game system computed everything for me, added and subtracted my money mercilessly like a knife. It already plummeted my fatigue, and now it was cutting down my daily wage, too.How much would the young master’s bedspread, duvet and pillow cost me? I have no idea, but I think it’s going to be higher than the 300 gold I had in the beginning.Still, even if the system was going to subtract the compensation for the damages to the expensive bedding, my total balance wouldn’t be able to cover it. I wouldn’t even be able to file for bankruptcy in this place.I had three choices here: to go homeless, starve to death, or become the devil’s meal…My hand rushed to reach for the doorknob just now, but I soon felt miserable.This was how you’d be able to change the mind of a person who’s constantly broke.“I can’t leave just like this, Young Master. Please give me my punishment for making your bed like that.”“…Punishment?”With a puzzled look, Adrian asked.“But not any kind of punishment, please. Especially money. I can’t pay a fine. Please also not a cut from my daily wage. Anything but that.”“……”“You must be wondering why I’m asking for a punishment like this and why I’m talking so much here, Young Master. That I forgot my place, I know that very well. Even as I’m saying this, I couldn’t believe how preposterous I am being. But, Young Master, if you ever witness someone being driven to the edge of a cliff, they might be similar to how I am now. I sincerely hope that you will punish me for making your bed dirty.”“Hilda, who is driving you to the edge of a cliff?”“There is a bully. I am only striving to work hard every single day, sir, but there’s this bully who keeps taking my money for the smallest of reasons.”A damn bully that’s next to me 24/7.“Do you mean that there’s a person like that who comes by often? Here?”“Yes. It is a bully that has no conscience by nature, and I can’t get rid of this bully by myself. In any case, Young Master, I will pay for my sins fair and square. If we settle this between us, maybe the bully wouldn’t be particularly stingy today. Probably. Oh, and please keep this a secret from Miss Leticia. I think she’s been having migraines lately, so I heard it’s best to be careful around her.”“……”“Every one of us in the manor wouldn’t be able to live without the head maid, of course.”Being at the end of those piercing eyes, my hands trembled, chills ran down my spine and my lips moved on their own as if I’m not on the verge of dying right here, right now.Even a worn out, fatigued beggar could still muster some bravery and still be so determined in the face of death itself.It was at this moment that I noticed something new.“Huu…”Besides Leticia, it seemed like Adrian also had a migraine, seeing that he was leaning back against his seat as he touched his forehead. In full view were his angular jawline, high nose bridge and sparkling eyes… In terms of looks alone, there was no other visual that could compare.“You said you can’t give me any money.”“Yes, that’s right. Even if you point a knife to my neck, I still can’t. I’ll give you some if I have it, but I really, truly do not have any money.”“It’s not a sin that could justify bashing your head in either.”“That… That’s a bit too much, isn’t it.”I was miffed and I wanted to complain, but I extended my big heart and instead said only this.“Then, just answer me one question.”“Pardon? Is that going to be alright with you? The bed, the sheets, and the pillows all look expensive.”“It’s an answer that I’ll be able to hear only from you. Instead of that, just answer honestly.”“W-What is it?”“The reason why you won’t look at me. What is it?”He knows everything.Well, I mean, it would be even more strange if he didn’t know anything when I’d been avoiding him so blatantly.But why was he curious about that? In the first place, it’s rude for a servant to look into the eyes of a noble, right?It was a cheap price to pay for dirtying his bed, but at the same time, it was also something that’s difficult to answer.Here’s the reason—I knew that Adrian’s a devil who grew stronger for every human being he killed, that’s why I was terrified and frightened out of my mind each moment I was in front of him and wished to run away. But I couldn’t very well say that, huh.“I want an honest answer.”Perhaps because of a wind coming from somewhere, the candlelight flickered and cast a deeper shadow over his face. Pale double eyelids, elegant long lashes… The very moment I glanced at his face once more, I suddenly thought of something.Though it wasn’t the truth, it’s an honest reason.“It’s just, um, because you’re handsome.”Adrian was the main character of this game, and he must have been drawn by the best artist in A-Comms, so I had to admit that his visuals were top tier. Though for someone like me, who knew the truth, it was just uncanny.“I’ve been working here for quite a long time now, but I’ve only recently realized that the Young Master is really handsome. And my taste in men is the weak but beautiful type. At some point, whenever I saw you, my heart started pounding and my hands and legs kept trembling so much that I couldn’t even look straight at you, Young Master.”“……”“Really, don’t you think about it sometimes when you look in the mirror, too? ‘I’m handsome today as well.’ ‘How could I be this good-looking?’ ‘I wonder how it was possible for my parents to give me this face. I’ll have to thank them for the rest of my life,’ like that.”Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 28": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 27Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play2-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by YonneeAs if I was reading a script that was prepared for me, I recited these lines with a blank face. Perhaps he didn’t expect my answer to be like this, Adrian’s eyes widened a little. Then, with one hand, he swept his fringe to the side slightly.“Well, that happens sometimes.”“R-Right? You understand, right? After all, the Young Master looks like a national treasure…”What the, I didn’t think he’d be like this, but he’s being a total prince-like snob. He didn’t have this kind of setting when I was playing the game…“So that’s it?”“Yes, that’s all.”“…You avoided me because your heart started to pound every time you looked at me?”“Yes. My heart starts pounding so loudly that it feels like even my ears would burst from hearing it every time I’m close to you. That’s why I wanted to be as far away as possible. See, I don’t want to die of a heart attack while I’m still so young.”It wasn’t a lie that my heart was racing. Because of the perception skill, whenever I caught sight of Adrian, my heart would start beating like crazy.This was the only answer I could come up with, so will it work? Will this be enough to change the mind of a serial killer?This answer might just put my life in danger though. Having second thoughts, I closed my eyes for a moment then opened them again.Then, the bully that’s next to me 24/7 suddenly popped up at that moment.「 Adrian’s favorability has risen by 1 point. 」「 Adrian’s favorability : Lv.1 (3/400) 」No, wait, what?The unexpected result made me stare blankly for a moment, then I glanced up at Adrian.It was so dark that I couldn’t see him well, and his face was turned to the side a bit, so I couldn’t be too sure. But it looked like there was a small smile on his lips.So, such obvious flattery and buttering up works, too.Goodness me, he’s a devil who likes flattery. Should I take this as a good sign, or should I fall into despair…“Never mind. This time, you can really go now.”Now that Adrian confirmed that he really wouldn’t touch a strand of hair on my head, and in an exchange that validated our mutual recognition of each other, all that’s left for me now was to go back to my room.I should just take a step back now, but in my head, I just know…“But, Young Master, I have one last thing to say, if you please. It’s about that pillow.”“Pillow?”I couldn’t leave it behind.That plump, absolutely lovely pillow that gave me the most heavenly sleep I’ve ever had.“That pillow with my drool on it, if you’re going to throw it away, would it be alright if you can give it to me instead? You must feel uncomfortable just thinking of sleeping on it.”“But you said you don’t have any money.”“Yes, I’m completely broke. If you search through me and find even 1 gold, you can beat me black and blue.”“But if I give it to you, you’ll owe me, right?”“……”“What can you give me in return, Hilda?”“What will you be requesting?”If a conversation was heading in this direction, usually I would have already just run away because of the fright.But my obsession with that pillow was what’s keeping me here.Maybe this answer was something he didn’t expect again, so Adrian raised one corner of his lips.“I can’t sleep without six pillows.”When I looked back towards the bed, indeed, there were six white, plump, lovely pillows right there. My eyebrows became knitted automatically.There’s someone here who literally can’t sleep at night without even one!“Um, well… No, yes. I see, so that’s the case.”“Hilda, can you take the place of that one pillow instead?”He said so in such a sweet, saccharine voice as the corners of his eyes were curved. It was an eye smile that seemed to have the ability to melt anyone’s heart, but instead, I got goosebumps all over from head to toe.What do you mean, take the place of that pillow?You’ll peel off my skin and turn it into a pillow, is that what you mean?“Oh my goodness, Young Master. Something like that surely wouldn’t be comfortable for you when you sleep. It might be better to just cut off the part where my drool spilled.”Such a terrible thing…“Who knows, I think you could be very warm and soft.”“I truly, whole-heartedly apologize, Young Master. I’ll quietly make myself scarce now.”I was a fool to even try to strike a deal with the devil. He’s nothing but a good-looking psycho, huh?Right, he’s also killed a few people already. I need to pull myself together.Widening the distance between us, I stepped back slowly, quickly opened the door and hurriedly rushed out.I thought I heard a faint chuckle behind me, but I must have imagined it. Just a feeling.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 29": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 28Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayChapter 282-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by YonneeCrazy, seriously. No matter how tired I was, how could I fall asleep there? I caught the serial killer’s eye even more.On my way back to my room, I beat myself up and tore my hair out of the roots. My plan was to find clues as quietly as possible so that I could get out of this game, but looking back on my actions in the past few days, there’s not one thing that I did covertly.I belatedly realized that the way I spoke and acted in front of Adrian just now would have been far from how Hilda characteristically was. The instinctive grit not to lose anymore money overcame the fear and terror that I should have felt.But the good thing about this all was that, as I returned to my room, I wasn’t charged for the damages to Adrian’s bedding. My remaining 6 gold—which was what’s left from my 80% salary cut for today’s wages—never looked more precious and shiny.If I was also charged for Adrian’s bed, sheets and pillows, even if I worked my entire life with this tiny salary, I’m never gonna financially recover from this.In a different sense, my main goal of getting out of this game as soon as possible was with the mindset of a debtor being chased by loan sharks.Still, what a relief. I talked to the other concerned party and resolved the case.Answering the question of ‘why won’t you look at me’ was a price all too worth it to pay.Rather, it’s surprising that Adrian was conscious of the fact that I’d been deliberately avoiding his gaze. To Adrian, I should just be something like ‘Passerby Servant #58’. He had so many people working under him that I was just one of those ordinary servants.“Whatever. I’m beat. Let’s just sleep and wake up the next morning and think about it then.”I had some immaculate sleep in Adrian’s room, but even that wasn’t enough to get rid of all the fatigue that had accumulated. I first took off my mud-laden work clothes and washed them, then I went towards my bed—in a religious and reverential manner—and tried to lie down.But, as if it was waiting for the chance, an invisible hand pushed my back once again.「 You cannot lie down because there is no pillow. 」Ah, right. I forgot about this.These damn white letters were the main culprit of everything that happened.If the letters hadn’t made me angry in the first place, I wouldn’t have punched the pillow and lowered its durability until it broke apart.If it wasn’t for that measly durability, then I wouldn’t have racked up all that fatigue.If it hadn’t been for the fatigue, then I wouldn’t have fallen asleep in Adrian’s room.If I didn’t fall asleep in Adrian’s room, then I wouldn’t have caught his attention.If it wasn’t for catching his attention, then my survival rate wouldn’t have plummeted like this to the point that I’m better off dead by now.If my life ends with ‘Adrian’s demonic power has recovered by 1 point,’ then this game system was half to blame for it.“You hear that? If I die here, you’re to blame for more than half the causes!”The system remained silent and didn’t even bother to reply. I knew it was inanimate, but I cursed at it so much that I might just feel guilty. ‘It’s all because of you.’ ‘Do you not have any conscience in you.’ ‘Are you really saying that I can’t lie down without a pillow when all this is your fault?’ ‘Slave driver, miscreant employer, swindler, gangster.’ Etcetera, etcetera.Despite feeling a twinge in my conscience, I felt a whole lot better after letting out everything I thought of. Somehow, the system even looked like it calmed down a little, too.“So can I sleep on the bed now?”After all this, you won’t say that I can’t lie down without a pillow again, will you?「 You cannot lie down because there is no pillow. 」This system really has no conscience. When I played CCGs¹ before, I used to spend 500,000 won just to get 5-star characters. But here, it’s even more unfair since I couldn’t pick anything at all.“Where can I even get a pillow this late in the night?!”But if I can’t sleep without a pillow tonight, then my fatigue would just increase again, and when working tomorrow, I don’t know what kind of damages I’ll be charged with—I might just lose my precious 6 gold.Then I wouldn’t be able to buy a pillow because I don’t have money, and I can’t make money because I’m too tired without a pillow…To break this vicious cycle, I’m gonna have to do something about it. Immediately.I woke up the already sleeping Emily and asked where Anna was.“Hilda… You really don’t know?”“Y-Yeah. I can’t remember clearly. These days, I’ve been having some trouble remembering.”“You’re just really… huaaahm.”After trying to wake her up for a while now, Emily finally rose from bed, but didn’t seem to have any intention of arguing.“But why Anna?”“I was wondering if I could buy a pillow from her.”When the pillow’s durability dropped the first time, the white letters said, ‘Would you like to visit Anna to have it repaired?’ So, since she knew how to fix pillows, can’t I buy one from her?“What are you talking about, Hilda? Anna doesn’t sell any pillows. Though if your pillow’s seams burst, you can take it to her and get it patched up.”“What? Then where can I buy one?”“You should go to the village and buy it there, of course.”Village…“Thanks for letting me know, Emily. Sorry for waking you up.”“This is nothing between us.”Emily smiled so brightly that the side of my chest where my heart ached. Emily clearly cared for Hilda very much. Even if it’s left unsaid, I could feel it just by observing her behavior, actions and the gentle look she gave me.But I felt sorry about taking the place of her friend like this… I mean, I know I didn’t do it on purpose, but…“Good night and sweet dreams, Hilda. I’ll see you again tomorrow.”“Yeah, sleep tight.”As I bid Emily good night and turned around, I felt strangely uncomfortable. It’s not that I wished to be in this position, but it felt to me like I was taking advantage of the goodwill around Hilda, even if it was unintentional.“…Don’t think too much about it and just get ahold of a pillow first.”At this very moment, there’s nothing more important to me.I left the dark manor and headed towards the front gates. The front yard was so wide that I couldn’t see ahead, and I hadn’t even the slightest clue how long I’d have to walk to get to the village, but I marched out straight away without any hesitation.Whether the cause was the fact that I didn’t have a pillow or the fact that I’m out to get one now, I wouldn’t be able to sleep either way. At the very least, going out to get one seemed to be less hopeless, so let’s try that.¹ CCG – ‘collectible card game’ is the term I settled on, but what Hilda was referring to here was a videogame (not a card game) where the main focus was collecting characters. CCG is just a better-known term, afaik.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 30": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 29Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayWith sweat soaking my back, I trudged forward and arrived at the entrance of the mansion. The huge iron bars standing tall in front of me felt even more majestic compared to seeing them from a distance. The pointed, well-made bars rose arrogantly high as though they were about to pierce the sky.「 You cannot leave the manor. 」I tiptoed towards the gate to see if I could get away with it, but the system popped up and blocked my path. Ha, I knew it. I knew you’d stop me. There’s no way this game would ever let me do what I wanted to do.I’m sure this system’s going to tell me to give up on this and just tell me to go out tomorrow, but now. I had no plans of letting it do whatever it wants.I can’t live like this anymore!I walked back to the maids’ quarters much faster than I had walked out.The best thing about being a servant in this mansion was that, despite the large number of employees here, each person was given a solo room. If you’re unlucky, you’d be assigned to a double room, but since there were still many vacant rooms, there were only a few cases like that.However, just as our privacy was well protected, there were still some things that happened around here that shouldn’t happen…While I was still up during the wee hours of the night, I heard a shameful sound through the window, which I usually wouldn’t have heard had I been asleep.“Ah, ahngh, AH!”Blatant moans, the wet clapping of flesh, the passionate sound of lips meeting each other…H-Hot damn. I was told this was a horror game. I know it’s R-rated because of the game’s brutal scenes, so it shouldn’t be for this, right?I fanned my bright red face and quietly closed the window that I mistakenly left open earlier.Yeah, well. It’s not like this was the Joseon Dynasty, so there shouldn’t be a ban on love. If you keep interacting with the same people inside this mansion, it’s possible to get on each other’s nerves, but it’s also possible to meet secretly at dawn and make love. I do hope Leticia doesn’t find out.This was what I thought and just tried to go back to sleep, but right now, this brief memory was a huge clue for me. While everyone had gone to bed early, there must be some people who’d leave their rooms at night.I left the window open and waited for the right time, like a predator trying to let her prey’s guards down.Tick, tock. Tick, tock. Tick, tock…As time went by, the sound of a passing wind echoed throughout the silence, and gradually, the rendezvous of passion began. Starting with only a little movement, aroused moans leaked through the window.“Nngh, ah… If you touch me like that…”When the heated entanglement began, I crept towards my room’s door and stuck my head out to peek out the hallway. It was dark, but I could clearly see that the door of the room at the end was slightly ajar.Over there!Swallowing my hoorays inwardly, I tiptoed across the hallway as if I was walking on thin ice. After all, once they’ve started, the act was rarely finished right away, so I don’t think I’ll get caught. However, as I headed towards the end, I was still careful in case another door might open so suddenly.This room’s owner was so excited to see a certain someone that they even forgot to close the door. I slipped through the opening so as not to make a sound, then—I found the target.It wasn’t as good as Adrian’s, but it was luscious and plump enough that I’d be able to spend a luxurious night tonight.I picked it up quietly and came back to my room, looking out to see if anyone spotted me.As if to prove my perfect crime, the moans from outside the room still went on right now. As much satisfaction as they were probably feeling, I looked down at the object in my hands.“Oh, pillow, it’s been such a long time…”Feeling emotional, my lips trembled. I was so happy to be reunited with a pillow that I buried my face in it, nuzzled my cheeks over it and kissed it a few times. I no longer have to suffer from a lack of pillows! I no longer have to be bullied by this stupid game system!I felt apologetic towards the original owner of this pilot, but when things get rough while playing games, it’s often the right move to talk to NPCs¹ for hints, right? Because the existence of an NPC was for the player’s sake, the player should get their help as much as they want to. Even if it was against the NPC’s will.“Now, shall we go to bed?”I couldn’t control my excitement. I swear, my heart hasn’t pounded this much even whenever I caught sight of my first love before.I placed my pillow on the bed reverently and sacredly as if I was serving my god, then, I slowly lied down. There was no invisible hand pushing me away and no white letters saying that I had no pillow. I lay entirely on my back on the bed.“I can’t believe I’m lying in bed…!”While I was moved to the point of tears, white letters suddenly appeared and flickered in front of my eyes.「 You have done an evil act. 」「 For having no conscience, your title has changed to ‘Unscrupulous Insignificant Worker’. 」This system had been nagging me to get some sleep, but it seemed to be pointing a finger at me for having no conscience, like saying ‘How could you steal another person’s pillow?’“Wow. Now you’re saying I’m unscrupulous? When you’re the one who told me I can’t lie down when I don’t have a pillow and bothered me with all kinds of excuses?”「 Your conscience has vanished without a trace. 」“Sure, sure. Swear at me all night long. All I need is a good night’s sleep here in my bed.”If I don’t have a conscience, then so be it. It’s not like anyone’s going to haul me off to the authorities, huh?I grabbed the edge of the pillow and turned it around. The white letters followed me persistently, but I just snorted at it and shut my eyes tightly. I took only a pillow, but it felt like I had the entire world in my hands.Rubbing and burying my face against it, I fully enjoyed the pillow until the last moments I finally slipped into slumber.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 31": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 30Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play2-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by YonneeThis morning, for the first time ever since I was dragged into this game, I woke up refreshed. Oh, how the sun was shining brightly, how the birds were singing wonderfully.The world is so beautiful! I’m so happy! Not even my meager savings of six gold and that conscious-less system would be able to ruin my good mood.“Well, aren’t you in a good mood, Hilda?”“Emily! Good morning! Did you sleep well?”I also greeted the terribly hardworking Emily happily for the first time this morning. Emily wrinkled her nose and smiled in a lovely way.“Yup. And I feel much better already just seeing your bright smile in the morning.”“It’s been a long time since I slept so comfortably with my legs stretched out. I guess that’s why.”Though my situation hasn’t improved much—no, well, it’s only getting worse—but I can’t believe I’m feeling so refreshed. I dare to think that my life in this game could be divided into two eras: B.S.P. and A.S.P. Before Stealing a Pillow, and After Stealing a Pillow.With a smile on her lips, Emily added, ‘I’m glad to hear that,’ then she went on her way.As she descended the stairs, she braided her hair skillfully. When she carried herself in that manner, even the plain gray uniform she had on seemed to look so good on her. Despite her modest clothing, Emily was shining beautifully.“Then, Hilda, let’s do our best today, too!”“Yeah, you also…”Take care. Especially around Adrian. He’s actually a devil. All he thinks about is killing people. I, myself, almost died one too many times. But I survived!“…See you at lunch.”I forced myself to gulp down these words that threatened to burst out of my lips and instead waved goodbye. A clear laugh rang out.“Come on, you were acting like you’re gonna say something big just now, but what’s with the flat goodbye. I’ll come help you later after this morning’s tasks, so don’t overwork yourself!”Emily’s really nice. She’s the only one who worried about me and took care of me like this in the game. I know she’s only acting according to her programming, but I’m still hoping that her life won’t end in pain. Wouldn’t it be fairer if a good person could get a happy ending?Looking at her retreating figure as she went into the mansion, I turned around and looked at the garden. Yesterday, this workplace of mine was like the devil’s garden itself, but right now, I could see only a treasure trove of EXP.It’s only 1 EXP per weed pulled, but if it’s all piled up, then it’s not such an insignificant amount. From the EXP I’ll gain here, I plan to raise my level and become the last player standing in this world.「 Gained 1 EXP from removing weeds. 」「 Gained 1 EXP from removing weeds. 」「 Work is going smoothly because your fatigue is low. 」「 Work is going extremely smoothly because your fatigue is low. 」「 The success rate for weed pulling has risen significantly. 」「 Your daily wage has increased. 」「 The amount of EXP acquired has increased significantly. 」「 Gained 5 EXP from removing weeds. 」Wow, one weed became 5 EXP, you say? When I thought about what happened yesterday, when the system wouldn’t give me even 1 EXP, this was an unprecedented increase.I can’t believe that my experience points and daily wage are influenced by my physical condition. This was one more reason why, from now on, I must go as far as to risk my life for the sake of protecting my dear pillow.Surprisingly, this game’s essential item was a pillow? It would be good if I could buy some more in case the one I have now suddenly lowered in durability again.「 Gained 5 EXP from removing weeds. 」「 Gained 5 EXP from removing weeds. 」「 Critical Hit! Gained 10 EXP from removing weeds. 」I was mechanically pulling weeds with my hands when these white letters suddenly popped up.What ‘critical hit’ are you talking about now, it’s not like this is a rhythm game.Well, this was what I thought, but it’s still rather fun so I continued moving my hands in earnest.「 Gained 5 EXP from removing weeds. 」「 Critical Hit! Gained 10 EXP from removing weeds. 」「 Critical Hit! Gained 10 EXP from removing weeds. 」What the hell, this is really fun. When the EXP bar, which was previously filled with as little as ant piss, rose evidently, my heart was also filled with this strange pride.Did you know that I like RPGs, that’s why you came up with this kind of system? And perhaps because the weed pulling was either ‘success’ or ‘great success,’ all the areas where my hands swept through became noticeably neat. It’s not just a matter of weed whacking—it’s like a brand new garden was being created.It’s not like I’m just praising myself or being narcissistic. When Emily came around by noon, her admiration was proof enough that I really was doing a good job.“Wow, Hilda… Did you really clean up everything here? Oh my gosh, it’s perfect.”“Perfect, psh. You’re making me blush.”“You made a complete mess yesterday, but how did you make everything so neat this time? Mister Ancier didn’t come and secretly help you, right? No, he should be busy tending to the Madam’s garden and planting flowers right about now. Miss Leticia’s seriously going to faint from shock after seeing this.”“Oh you, to go that far…”“Hilda, I’m so proud of you.”Emily looked at me with her eyes shining brightly, glistening with tears. She was the proudest and most supportive friend there ever could be when it came to the great endeavor of weed pulling. It sounded ridiculous even to me, but the corners of my lips went up for no reason.Wasn’t there a saying that compliments made whales dance? As if to show off, I pulled the last weed there was and— another critical hit!Emily burst out in tears of admiration, praising me again about how perfectly I pulled out the weed. Then, we went together to the dining hall for lunch.As we walked side by side while talking about what we did this morning, the sudden sound of shattering plates could be heard from a distance. It wasn’t just a single plate—it sounded like dozens upon dozens of plates were getting shattered all at once.“Let’s hurry.”Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 32": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 31Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayI hurriedly followed right behind Emily as she rushed forward first. Then, Leticia’s sharp voice could be heard through one slightly opened kitchen window.“Delores! What on earth have you been doing all morning! Augh, look at all the plates. Everything’s just… haa.”“I-I’m sorry, Miss Leticia…”“Just how many plates do you think you broke! It’s not enough that you were dozing off, but you’ve actually lost your mind! I saw you doze off while standing several times and I just pretended not to know, but then you do this?!”She pretended not to notice that one of her employees was dozing off? Leticia’s actually a pretty kind boss, huh.If a department head were to see a team member dozing off at the desk, lunch break would be plagued with the passive-aggressive attacks of, ‘I guess you’re not getting a lot of work these days, huh, Miss/Mister this or that? Or did you finish early because of your amazing skills? Wow, you can go ahead and start a business for yourself. Huh? Oh, no no, you have to eat a lot—hurry now, go ahead and eat. Eat comfortably.’Anyone caught dozing off would immediately get chewed up, and you’d inevitably go back upstairs with a stomach ache.“I’m sorry Miss Leticia. I-It’s because, because I didn’t sleep well…”“Why couldn’t you sleep! You’re given proper accommodation and you finish work on time anyway, so what reason is there for you not to sleep?!”Emily had already entered the kitchen and started to help clean up the broken plates. I was wondering who Delores was, then I remembered that she was one of the people who called me out to the backyard before—one of the bullies with a pixelated name.Hands on her waist, Leticia was practically fuming with her face all blue. Delores just had her hands clasped together, wondering what she should do. After a while, she spoke in a sobbing voice.“Because my pillow, hiic, suddenly disappeared…”So. Delores was the owner of my new pillow and the female lead of those evening trysts outside my window.I crouched down to help Emily get all the shards. Even though it was just the simple task of picking up the pieces, there were several times that Critical Hit! popped out, and I steadily accumulated EXP. Emily watched me with a slight look of admiration. Aha, this game is starting to grow on me.“What? Your pillow’s gone, that’s why you couldn’t sleep?! Where did you leave your pillow, huh? You can’t even keep it properly!”“I really don’t know. I went out of my room for a little while last night, and when I came back, it was already gone. That’s why I couldn’t sleep at all, and I was really tired…”Apart from the set-up of not being able to sleep without a pillow, it seemed like the fatigue system was also being applied to the other characters in the game. Seriously. Was the developer of this game a ghost who died in their sleep because they didn’t have a pillow? Why else would there be so much riding on a mere pillow?Leticia let out a long-drawn sigh and shook her head. In other words, this was practically saying to Delores, ‘What’s the point?’“Um, Miss Leticia. Someone must have stolen my pillow. They’re sabotaging me! If you can just help me find who it is—!”“Shut up! You couldn’t even do your work properly and now you’re kicking up a fuss! Why are you trying to shift the blame when it’s you who didn’t take care of your belongings!”“Miss Leticia!”“I said shut it! Are you expecting me to clean up the plates you broke, too?!”Delores couldn’t win Leticia over at all as the older woman was quite literally fuming as she stomped away. Delores could only shed a few tears as if she was feeling unfair, then with a huff, she soon turned around.To be exact, she looked in this direction, so when our eyes met, I felt a little guilty.“You did it!”Delores shouted with such resentment that it felt like she was going to beat me to death. This time, I was the one who got flustered.How did you know I did it?“What are you talking about, Delores! How can you suspect someone so suddenly, and without any evidence, too! Our Hilda isn’t like that!”Um, it really was me though, Emily.“You’ll see.”Crunch, crunch. With the clearly audible gritting of her teeth, Delores ran straight out of the kitchen. You’re leaving without even cleaning up these plates?“Don’t mind what Delores is saying, Hilda. She’s just doing that because her conscience is getting prickled.”“Huh? Conscience?”“That girl, she used to take your pillow and hide it whenever she found the chance.”What? What did you just say?“Hilda… You, seriously. How can you forget when you were so angry about it?”“No. I recalled what happened before and I felt my anger shooting up, but I’m trying to keep calm.”“Really? Sorry. Well, don’t mind her. She’s just getting her karma.”Emily patted me on the back and gently soothed me. Maybe she’s wondering if I’d really get upset.Pretending to hold in my anger, I let out a long exhale and went back to picking up the shards.Indeed, it made sense now why Leticia said that I used to make a lot of mistakes at work before. Hilda had strong attributes and she didn’t seem like she was easily fatigued, so I was wondering why she made so many mistakes in the past.I know what the cause had been now—and this meant that Hilda had, many a time, gone through what Delores was experiencing right now.I guess you could say we swapped places for the day. However, if it was just based on that, the look in Delores’ eyes was much too fiery.This game was already difficult enough. I couldn’t even gain allies that much, and there’s no need to raise the difficulty by gaining enemies here.What should I do.“Hilda, let’s go get our lunch.”Aight. Let’s eat first, and then let’s think about it later.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 33": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 32Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play“Hilda, sorry, I know we just ate, but do you mind bringing the Madam her tea? I have my hands full today, so I’m asking you.”Everything was going so smoothly today that even lunch was bursting with critical hits, but then suddenly, things went to a stop. With a grimace, I thought, ‘Why me?’ but Emily already rose from her seat as though she was waiting for the chance. Soon, the sound of teacups and tea leaves being skillfully placed on the tray rang in the air.“I knew it, our Hilda is amazing. If I were you, I’d say I wouldn’t go because it’s terrifying.”While she was busy arranging the things on the tray, I just relaxed around the kitchen. I’ve somewhat adjusted to the game now, and with a full stomach, I secretly fantasized about coffee. Back when I worked part-time in a café during college, I used to drink coffee all the time.Ah, come to think of it.I looked around the spacious kitchen. Fellow servants were busy with their own tasks because the count, the countess and Adrian had separately just finished their lunch. This meant that no one would care if I just so happened to swipe something for myself.Since this was a well-to-do count household, it wasn’t lacking anything. From coffee that could be espresso shots, milk, and then white sugar. ‘Kay then, let’s see here. If I mix this and that, then I can make something similar.I brought a tall glass and added sugar and milk into it, pounding into the mixture with a spoon so that foam would rise. If there was a French press around here, then I would have been able to make frothed milk quickly, but alas. I had to make do with manually doing it, and somehow the foam rose up.“Hilda, what are you doing? What’s with the bubbles?”“Mmh, I’ll put it in my coffee. Do you have a tall glass? I’ll give you some so you can taste it.”“O-Okay.”Emily set down the tray and brought a glass of her own. As each cube of ice rattled as I poured the drink over them, the fragrant aroma of coffee lingered around the tip of my nose. Then, after I filled the other half of the glass with foamed milk, I poured in the espresso shot and made an artistic marbling over the surface.Since Emily had never seen anything like this, she looked at me with a bewildered expression.“Hilda! Where did you learn how to do something like this?”“When I used to work part-time at a café… Uh, just drink it first.”I let out a careless answer mistakenly, but I quickly covered it up by pushing the glass into her hands. Not expecting this, Emily took it and looked at it intently first, then she cautiously took a sip. Then, she covered her lips.“Oh my word, how delicious!”“Really? That’s great. Go ahead and drink all of that. I’ll make some for myself later.”I could only make a clumsy cold brew latte with the ingredients I had on hand, but the espresso here wasn’t so bad. In the end, the latte still tasted good enough.Emily praised the coffee nonstop and downed the rest of it while I made more. It’s always a nice feeling whenever someone genuinely enjoys the coffee I made.“Right, Hilda. This is the tea that you’ll be bringing to the Madam. I put the tea leaves in it already, so all you have to do is go up, take out the strainer, let it cool for a sec, and then pour some for her. You’ll have to wait for her until she’s done drinking, you know that right? You can come back with the tray after that.”Actually, I didn’t know about any of that, but I still nodded towards Emily, who kindly gave me instructions. There was a white milk foam beard on her lips, but Emily continued sipping without knowing this.“I’ll come back soon, Emily.”“Okay. What you have there is scalding boiled water, so be careful with your hands! It’s the room at the end of the hallway on the second floor, you know that right? Knock on the door and then tell the Madam that you’ve brought her tea. Even if there’s no answer, you can go in.”“I’ll make you another glass of coffee, so you don’t have to save it. I’ll be back.”I gave a wide grin to the also smiling Emily, and then I proceeded to head for the countess’ room with the tray in my hands. The room at the end of the hallway on the second floor, the room at the end of the hallway on the second fl…While recalling Emily’s words, it suddenly struck me—she also said, ‘If I were you, I’d say I wouldn’t go because it’s terrifying.’ When she said that, she shook her head as she shuddered.The countess was a normal human being though, not a devil. So why? What’s so scary about her?“I’ve come to bring your tea, Madam.”I knocked on the door, but there was no answer coming from inside, just as Emily told me. I waited for a moment before I opened the door. But when I stepped in, I was shocked even more than when I first saw Adrian.Gasp…What kind of room… While a rotten stench wafted in the air, there was blood all over the place. It smelled exactly as if that red fluid had been hand-smeared throughout the wallpaper. Old, rotten, but the unmistakable metallic stench of blood.I looked away, but the moment I did, I thought I was going to faint.Right there, the body of a blood-soaked goat was hanging on the wall.Oh my god, all those red streaks on the wall were from that goat’s blood? But where did its head go? Why was only its body hanging there?Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 34": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 33Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayNot one of the servants would dare do something like this to the countess’ room, so there was only one suspect.Trying to move my neck, which wasn’t working well, as I looked to the side, I stared at the countess as she was sitting in that rocking chair in front of the wide window. With a low voice, she hummed the melody of a lullaby, singing to the thing she was cradling in her arms. It was wrapped in a blanket.Oh my god… I forgot about it because of that shitty system, but this game’s genre was horror. But it was supposed to be because of Adrian, not the countess!“Rock a bye… rock a bye… baby… sleep… sleep now… my baby…”Creeeak, creeeack.Whenever the chair rocked back and forth, the creaking sound mixed together with the humming voice, and it created an even more terrifying atmosphere. My heart shrank and my heartbeat raced. My hands were trembling uncontrollably, and the teacup on the tray clattered endlessly.I-It’s fine. Let’s calm down. She’s just a bit coocoo. Let’s just give her the tea right away and book it…I calmly placed the tray down on the table and poured the pot of tea that Emily prepared over the cup. The rich, thick scent of Early Grey wafted through the air as the tea flowed down, but when it became mixed with the metallic smell of the room, it stabbed harder at my nose. My eyes were already burning with tears.“……”What was she thinking. The countess was watching me as my hands quivered while pouring tea. Usually in a horror movie, if someone like the countess appeared on the screen, there would be a jumpscare as she’d suddenly come running at me with a loud sound effect.Just imagining it… made me feel even more terrified.Let’s just hurry and finish what to do here.“P-Please drink, Madam.”“……”“I’ll leave the tea here on the table. I’ll wait until you’re done drinking, so dri… drink slowly. Uu…urk.”Trying to control the tremors passing through my hands as much as I could, I placed the cup on the table—but then I finally saw what the countess was holding.With flies hovering over it, what’s in her arms was the severed goat head. It’s unknown when exactly that head was chopped off.Why the hell are you holding such a…“Sleep now, sleep now… my… baby…”She did not even look at the teacup I had set down for her to drink. She only stared back at me with eyes that were so black that her pupils couldn’t be identified.Ten seconds passed by as slowly as ten years. No, did time even pass by? How would I possibly be able to wait until she’s all done drinking the tea?I’d rather be killed.“Sleep now, sleep now…”“Um, Madam. Perhaps, is there something that you’d like me to do for you?”I asked, barely pressing down on the urge to scream. What I meant to say is that please, please don’t look at me if there’s nothing you want me to do—but it didn’t work. Oh, you don’t have a task for me. Haha.Even when I walked away with an awkward smile, her eyes were persistently on me. It’s so terrible. In terms of atmosphere, Adrian was much better than the countess.As my fear shot through the roof, I recalled one resentful person at a time.Why did Leticia send me here as a substitute? Hilda’s a natural worker, but she’s not fearless!And Emily. Why did she let me come here anyway when she knew that I was gonna be scared? She even went as far as telling me to wait until the countess was done drinking her tea. Why couldn’t she repay my kindness when I even made her that coffee…“……”But wait a sec. Was the countess staring at me… or maybe…?I paused and looked alternately at the coffee on the tray in my hands, then to the countess. Come to think of it, her eyes were fixed at around my chest, not at my face. Was she looking at the coffee? I made this for myself so I could drink it later though.“Um, perhaps, Madam. Do you like coffee? I made this myself, but would you like to have a taste?”“……”“Oh, um, I’ll pour some for you. I don’t know if you’d like the taste of it though.”After pouring out the tea inside the cup, I replaced it with the coffee and frothed milk together. Then, the countess slowly raised her hand and took the cup.Seeing her sip it quickly, she must have wanted the coffee instead of the tea.You should have just told me then… You looked at me with those terrifying eyes. I thought you were gonna come running at me…「 You gifted Priscilla some ‘Rare Coffee’. 」「 Priscilla is immensely delighted. 」「 Priscilla’s favorability has risen by 300 points. 」「 Priscilla’s favorability : Lvl.4 (0/200) 」Just like when I had my first conversation with Adrian and when my level went up by five, the bar over Priscilla’s head was suddenly filled as her favorability points shot up.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 35": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 34Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayI got so overwhelmed with how the room looked that I didn’t see it at first, but the favorability gauge floated over her head for a moment before it disappeared again.So the countess’ name is Priscilla. But what’s the point in raising the countess’ favorability? She’s already gone bonkers.“…Did you say your name was Hilda?”“Y-Yes.”I was a little surprised to hear the countess’ voice. As I heard her speak normally for the first time, her voice was as soft and sweet as whipped cream. As I watched her set down the empty cup with a gentle gaze on it, I also found her to have a very caring atmosphere.The lurching urge to vomit from seeing the goat’s head in her arms had yet to recede, but as I saw the warmth in her eyes, I did start to feel some sympathy for her.The original countess wouldn’t have ended up like this. Since she was a soft and gentle person, her mind was susceptible to collapsing all together like this.“Go downtown.”“Pardon?”“There’s a lot to see in the town. Mister Andrew, the teahouse owner—he said that he brought in some orange-flavored Rooibos tea from a faraway place, but I haven’t checked just yet. I don’t know if the shop is doing well now.”「 Map, open! You can now go to the village of Ida. 」「 You can now go outside the manor. 」At the unexpected development, the white text made me pause. I was blocked from leaving the manor yesterday because it said I couldn’t go out. I didn’t know that the countess was the key for this.My heart almost stopped because of how terrifying this room was, but if Leticia hadn’t sent me here as a replacement, then I wouldn’t have been able to open the map and I would have just been stuck inside the manor all the time.In addition to gaining more skills as my EXP rose, I didn’t know that it was important to increase the favorability of the major characters by interacting with them. If I knew it was going to be like this, then I should have picked up some other things and gave them all to Adrian.Since he’s the main character, wouldn’t there be even better benefits if I raise his favorability?“Rock a bye, rock a bye… my… baby…”It was only for a moment that the countess came back to her senses. She bowed her head again and continued humming the lullaby. As if this was a meandering dream, the hazy voice and the red room were both a whole lot creepy when combined together.Even so, as I recalled the countess’ expression earlier, I now felt pity rather than fear.It’s weird, too.Probably because I knew her backstory about being aware that Adrian was a devil.All the people in this world who didn’t know the truth about Adrian were just pointing their fingers at the countess and calling her crazy. She was someone who finally broke down after shouting the truth to everyone, yet no one believed her.This woman who was trapped in an empty room as she shouted into the void became empty herself…“I’ll come back to visit you, Madam.”“Sleep now, sleep now…”“I’ll buy more ingredients from the village and bring you more delicious coffee.”Before leaving through the door with the tray in my hands, I bowed to the countess. She still didn’t look back, but her drooping shoulders looked immensely lonely.I was already about to close the door silently, but the dreary voice sank lower than before, and I heard a new line of the lullaby through the small gap in the door.“Rest now, die now, sleep, sleep now… my… Adrian…”My hand paused on the doorknob.Without realizing it, my eyes widened as I pulled the door open again, but I could no longer hear the song. Seeing as how the countess’ head was leaning forward, her neck bending over like a drooping branch, it seemed like she had already fallen asleep.Did I… hear it wrong? I thought I heard Adrian’s name.I didn’t know where this sudden sense of creepiness was coming from, but I looked around the hallway in fear. I was the only one here in this long corridor, and all I could hear was the sound of empty wind.It’s weird. I couldn’t breathe. It’s not the same feeling I had when I was in front of Adrian. The breaths I took in were cold, and as I exhaled, my throat stung. The tip of my nose ached as my breaths became rougher.I reached for the knob again so that I could close the door with my trembling hand. I couldn’t help but look through the gap in the door, and I saw the countess’ thin neck.She slowly turned her head halfway—and our eyes met.I slammed the door closed to the point that my nose almost got caught, and at the same time, my heart started racing in my chest.I started feeling dizzy. There was a ringing sound in my ears that it felt like one of the flies hovering over the goat’s head was buzzing near me.“The wind—I must have misheard the sound of the wind…”I left out a long exhale so that I could calm myself down. The countess loves Adrian. As much as she loved him, she was in shock. Despite the tragedy that happened, it would have happened earlier if not for that.Rushing down to the first floor, I inhaled the cold air. The ringing in my ears subsided a little when I heard the other servants talking as they passed by.It felt like I’ve just emerged from a murky quagmire.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 36": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 35Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayChapter 352-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by YonneeI saw something terrible in the countess’ room, so I felt so much relief the moment I saw Emily and Catarina’s faces when I returned to the kitchen.Emily took the tray from me and looked at me with worried eyes. She seemed to know exactly why my face had become as white as a sheet.Wiping off the cold sweat that was trickling down my forehead, I opened my lips to speak belatedly.“Emily, have you seen how it is? Inside the… the Madam’s room.”“Yeah… I’m sorry I couldn’t come with you, Hilda. I actually fainted back then, even before I entered the room. Right at the door.”“And Emily was bedridden for days. Every time she closed her eyes, she screamed while thinking of that red room. But… It took you a while to get better, right, Emily?”“I was just so terrified. It’s scary just thinking about how it looks.”Her downcast eyes trembled uneasily. Indeed. Even someone like me, who knew that this place wasn’t real, trembled just after seeing it. But how much more frightening and terrifying would it be for someone who thought that this was all real?“Has the… Has the Madam been like that ever since she lost her senses?”“Yeah. She’s been like that ever since. But where do you think she got that goat from? Even when someone takes the goat’s corpse from the room, it’ll soon come back after a while. It hasn’t been long since the Madam moved rooms, but then all the wallpaper has gone red with blood already, and there are crosses everywhere, too…”“She moved rooms?”“Yeah. Once she’s made her room that way, we’ll have to clean it up of course, so we’ll move her things to the next room while cleaning up. But even in the next room, she’d bring a dead goat and paint the entire room with blood. Her room right now is the last one on the left wing of the second floor. All the other rooms are just like that…”“We can’t help but talk about it even though we keep it at a hush.”Catarina sighed deeply.“I went to the village a few days ago and the boutique owner auntie said something to me. There’s a terrible rumor going around about the Madam.”“What should we do?”Emily asked with anxious eyes.“I hinted at it with Miss Leticia about it little by little. The Count also seems to know about it to a certain extent. There’s no way he wouldn’t know when that kind of rumor is being spread like that… I guess that’s why the Madam is being moved to a different residence soon.”“What? The Madam’s being sent somewhere else?”“Yeah. The Madam isn’t in her right mind, so they’re trying to focus on her treatment in a much quieter place. But if this story gets spread, then there’s going to be a lot of malicious talk. So, let’s just be quiet. Pretend you don’t know.”Catarina whispered, lowering her voice to the quietest she could speak.Indeed, if the count were to remain in the manor while only the countess was going to move to a different residence, then rumors saying that they had a bad relationship would naturally follow. Since there were already some rumors saying that the countess wasn’t of her right mind, then the other story would easily gain traction.“Anyway, Hilda, you must have been very surprised. Miss Leticia told me to tell you that you can go and get some fresh air at the village.”“Can I go to the village now?”My eyes widened, wondering why it was as easy as pie now. Even if the town map was opened, I thought it would be hard to go out unless I got a holiday or something.“Mm-hmm. She said that it must have been hard because you had to see the Madam. Besides, let’s just say that she was also pleasantly surprised to see the work you did in the garden this morning. She complimented you a lot and said that you can take some time off for the rest of the day. Ah! It’s awkward to say this now, but it would be really great if you could also run a few errands.”“Isn’t that great, Hilda?”Emily clasped her hands together as she looked at me with a very proud expression… Somehow, I felt shy, and so I laughed awkwardly.I took note of Catarina’s errand, then, it didn’t take long until I then went to the village. Since this was a magnificent count’s residence, there were also many magnificent carriages available for use. The countess apparently gave me special permission to use one of them.Was this the power of favorability points? I relaxed as I watched the scenery pass by quickly through the carriage’s window.Yesterday, it felt exactly like I was hanging by a cliff, but today, I was sitting in a gold-gilded carriage with a dedicated driver as I was going leisurely to the village.I can’t believe all this was from the power of a pillow.As I watched the shining blue scenery pass by while listening to the sound of the horses’ hooves, both the tension inside me and my body’s posture gradually loosened.I don’t know if it’s because I’d adjusted too well to my small lodgings in the last few days, but I stuck to one corner because it felt awkward being in this expansive carriage interior that could possibly just be as wide as a room.However, as time went by, I eventually sat down while sitting back relaxedly. My legs weren’t feeling cramped, and I had my arms behind my head.Going to the village inside a carriage like this with a dedicated coachman, it very much felt like I was riding an expensive luxury car just to go to the supermarket. Besides that, even if the road we were passing through was an unpaved road, the carriage didn’t shake as much as it passed over jagged stones several times, so my butt didn’t hurt at all.The ride was ever so smooth. This was the feeling of being a successful servant.“Hilda! We’re here! Come out now!”Feeling a bit proud of myself, I got off the carriage and entered the village.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 37": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 36Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play2-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by YonneeFrom the entrance, it didn’t seem like a big village, but it felt pleasant and refreshing for me. Especially since I was seeing another place that’s outside the manor for the first time.It’s like I’m wearing a VR headset and walking around in a game that has a medieval setting. Still though, it was such a vivid sight that I wouldn’t be able to see something like this in any VR game.“This evening gown had been worn by a princess from the neighboring country, and it’s only 30 gold. As low as 30 gold! Try it on before you go, hm?”“A trip to Ghaliba, over the high seas and indeed difficult to obtain tickets to, only 5 gold now!”“One last fountain pen left, one last highly rare fountain pen that even royal scribes can’t easily get their hands on!”The marketplace here reminded me exactly of how it was in some traditional Korean street markets I’ve been to before. Merchants were out in front of their stores and shouted loudly about their products so that they could entice some customers, who would look at their goods and hopefully buy some. The only difference was the era and western setting.“Hear, hear! This bastard sword¹ is made from mithril of the highest grade. There’s only five of ‘em left, so get ‘em while ya still can!”Wow. He went on to list more weapons—swords, crossbows and iron clubs. My goodness, there’s even some wooden training swords here? I can’t believe I can see all the weapons that I’ve only seen in games. Those are all real. Wow, just look at that sharp blade…I admired the sword that looked like it came straight out of a fantasy movie. I was really into RPG games some time ago, and I actually tried to remake a legendary weapon that I wanted for myself.As it was only wrapped with tinfoil and was made so shabbily, that thing wouldn’t even compare to this sword right here.I want one, that bastard sword. If I hold it real tight while I’m on my way back to the real world, won’t it come with me? I’d like to have one as a souvenir at least…Drooling in front of the bastard sword, the arms dealer glanced at me with a strange look, but I remained stuck on that glass case for a long time still. Suddenly, for the first time, it didn’t feel so bad to be in this game.“Ah, right, right, Catarina asked me to do some errands.”I recalled it only after looking around the village for quite a while. I took out the memo that was crumpled in my pocket and read one item at a time from the top. Sewing needles, cotton cloth, thread, salt, pepper… Good thing these weren’t heavy things.“Okay, let’s see. General store first then!”Every game traditionally had a general store that carried some stuff like HP potions, MP² potions, archer’s arrows, and more. Even broke beginners who had low levels should visit the general store just to buy HP potions.When it comes to dealing with items, there’s no gameplayer who wouldn’t head to the general store if they were told, ‘general store, go go’. It’s like the game version of a rendezvous point.“Welcome! Oh, it’s you! You’re that child from the Pfalzgraf household, right?”A middle-aged woman who seemed to be the general store’s owner welcomed me first. There were some other people looking around inside the store, too. I nodded and took out the note that Catarina wrote for me.“Yes, uh, first of all, I need a sewing needle please, about five pieces for each length. And some cotton cloth.”“Yes, yes. And you need some thread, right?”“Yes. One spool, please. And…”“A leather thimble, a metal thimble, yes?”The store owner kept taking things out from under the counter and listed off the things I needed before I could even say them. She’s got real good business chops, I must say.“Yes, and also two wrist pincushions…”“We’ve got all different sizes. Take them all.”“Huh? All of them? But there’s so many.”I was still in the middle of reading through the list, but then the cash register was all ringed up with the items. They’re all obviously what’s on the list, but the quantity was too much.There was a set of 60 needles that went beyond five lengths, and a large bag was filled with cotton cloth. There were also ten pieces each for each pincushion size. Catarina didn’t ask me to buy this much of everything though.“Five needles are plenty, Ma’am. And I just need about half of the cloth here. I didn’t even bring enough money to pay for all this.”“It’s fine. Don’t pay for it and just take it.”“Pardon? You’re giving me all this for free?”Just one glance at the items told me that they must cost around 50,000 won³, but the store owner was giving me all this for free?Sus.Since everything went much too smoothly today, was this supposed to be some kind of trap that the game system made? If I take this all with me without paying a single penny, that system would surely point fingers at me and tell me again that I have zero conscience—then it would rob me in broad daylight again as a reimbursement for stealing.With a wary look, I waited to see if the white letters would suddenly pop up. All the while, the general store owner just smiled at me pleasantly.“It’s not a lie, and it’s not a scam either, so you don’t have to worry. You can just take it all. You’re a precious customer from the Pfalzgraf household, so I’d like to just give you all these. We owe the household a lot.”“Owe?”“Oh my, oh my, of course we do. It’s not just me, but all the villagers owe a debt of gratitude towards the Count. When our village was attacked by the bandits who were from the mountains, the Count sent knights to help us several times. And when the river overflowed because of the heavy rain not too long ago and many houses in the village were about to collapse, he helped us again. Not only the Count, but even the Young Master is also such a good person. He’s so kind and gentle, oh he’s really like an angel.”“Ha, haha. Oh yes, of course…”¹ bastard sword – a variation of a longsword which could be used with either one or two hands; it was given the name ‘bastard’ due to its ambiguous categorization, irregular traits and misleading appearance.² HP – health points; MP – mana points³ 50,000 won = around 40 usdPrevious Chapter<All ChaptersNext Chapter>",
    "Chapter 38": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 37Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayChapter 372-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by YonneeTo call Adrian an angel… I wondered if there was ever any other combination out there that was so out of sync. Still though, I was surprised by the good deeds he had supposedly done. Of course, I still doubted what he was up to.“It’s not just that. They built a new orphanage to gather and take care of all the children who lost their parents in the slums. Children who grow up in the slums inevitably learn to steal as soon as they can start running. We all have felt such a huge relief from this. So, whenever someone from the Pfalzgraf household comes, we give them everything. So, please don’t feel pressured and just take it all.”“No, but, it’s really too much…”“Don’t be shy! Take it all!”Before I could even decline, the general store owner packed everything at the speed of light and pushed them to me. The bag wasn’t bulky because the items were packed in there one by one with practiced ease, but somehow, it felt like she put her raw feelings in there as well.It’s not polite of me to keep refusing someone’s sincerity when they continue to offer like this. Besides, it’s a sign of gratitude towards the House Pfalzgraf, not me.“Alright, thank you. May I ask where I can buy the rest of the items listed here?”“If you go out through the door and turn right, you’ll find the grocery store.”Even though another customer had come to pay at the cashier, the general store owner came out with me to the street and tried to guide me there.She already showed me the way, so I tried to steer her back to her store since there was another customer waiting there, but she just proceeded to guide me all the way to the grocery store and said to the grocery store owner, “This customer— she works at the Pfalzgraf manor!”“Oho, so you’re from the Pfalzgraf manor, are you?”The grocery store owner’s eyes twinkled.“Yes. So then, what I need is salt, pepper…”I was trying to recite the list’s contents, but the grocery store owner snatched it out of my hands like an eagle. I thought he would take care of it, but he read a note with a sour expression and soon walked towards the shelves.“What’s written here is this, this… and this, too. Aha, you’re gonna need this as well.”It was a similar scene to what happened in the general store.“Come to think of it, it’s been a while since the Count’s residence has bought basil. But if there’s basil, you’re going to need rosemary, too. And then also bread spread… We’ve got good quality condensed milk and butter this time, so I’ll give you some samples.”“……”“By the way, I’ve also got some savory milk from the sheep ranch. Let me see here…”“Um, excuse me, I think this is too much though.”“Not at all. Here, take all of this.”All kinds of sauces, spices and seasonings were taken from the shelves and placed on the counter. Obviously, Catarina had listed down a variety of spices, but it wasn’t this much.I had the same thought in the general store, but can I really take all this with me without paying for them?That system. It’s not going to rob me of my money again for this reason, is it? After telling me that I had no conscience, it just might play a joke and change my title again.With suspicion lacing my eyes, I stared out in the air and waited for it. But then, I suddenly felt sorry for myself. I feel like a gameplayer who’s being harassed by the game’s goods and system…“Just take it all, don’t worry about it. Whenever someone from the Count’s residence comes, they always take this much. With how much we owe the Count, what’s one or two things for that.”“Really? Has our Count helped you that much?”“Of course! Do you know just how many people he has saved when they were about to die? The children who were lying lifelessly on the side of the road were all given a place to live in. And when they grow up, they’re sent to cities far away so that they can study.”Seeing how he said exactly what the general store owner said, the good deeds done by the count’s family seemed to be all real. They established an orphanage, saved people from poverty, and Adrian was even being touted as an angel by the villagers… It was a backstory that I didn’t know about at all while I was just playing the game.Because the game didn’t show this village or anything, I couldn’t go to this place at that time. It’s interesting because it’s like I’m being given a peek into the behind-the-scenes story of the game. Like a director’s cut of sorts.Still, I somehow felt goosebumps rising up my skin since it felt so realistic—as though this was a real world with real people. The NPCs also have their own circumstances and backstories.So then, what’s the difference between them and real people?I glanced at the grocery store owner’s hand on the counter. His skin was pale and dry, and the veins that protruded bulged noticeably. They were thick, and this alone showed just how hard he was working to maintain this store.I wondered if there was real blood pulsing in that vein. Or if I held it, would it feel warm?Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 39": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 38Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play2-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by Yonnee“Other noble lords are much harsher. Our village is blessed. We thank God every day that we serve such a great man.”In the meantime, the grocery store owner kept praising Count Pfalzgraf to death.I forced myself to look away from his hand. Even if it really had warmth in it, that’s something programmed into his character, too. It wouldn’t mean anything.“Of course, yes, you’re always grateful… But what of Young Master Adrian? Does he also stop by this village?”“I heard that he drops by from time to time, but I haven’t gotten the chance to see him at all. Even if he came, he wouldn’t come meet us merchants. But you know, the Countess is very devout, so won’t she come by the parish sometime? I heard that she’s very ill. Is she doing alright these days?”Leaning his torso forward slightly with the body language that made it apparent that he was listening intently, he seemed to want to hear some gossip about the countess. The rumors were already out that her condition wasn’t good, but they seemed to be keeping it a hush amongst themselves.“Yes, she’s gotten a lot better. But it’s difficult for a servant like me to meet her directly.”“Really? No, I just… That, um, it’s just, someone who’s always coming to the parish so often over the years suddenly isn’t coming anymore. I was just worried!”“I understand. Thank you for your concern.”After that cursory answer, I prepared to leave the store. I was carrying so many bags with me now that I had to try and squeeze some others in a bigger bag because it was so uncomfortable to carry all of them as is. But then the white letters, which I seldom wished to see, appeared as though they were dancing in front of my eyes.「 The bag has exceeded the weight limit. You cannot put more items in. 」The items slipped out of the bag as if they were pushed out by an invisible hand, just like the time when I tried to lie down in bed without a pillow.「 Would you like to purchase an item that can temporarily increase the weight limit of your bag? (Price : 40G) 」“Wow, and I thought things were going well already, but now everything’s…”40 gold? Which punk said 40 gold? There’s no such thing as death’s embrace. I can’t believe it’s selling products to me now…“Huh? What did you say?”The grocery store owner looked up as he was organizing the groceries so that they could be placed in the bag properly.“No, it’s nothing.”「 Would you like to purchase an item that can temporarily increase the weight limit of your bag? (Price : 40G) 」I picked up another item, and at the same time, the white text popped up in front of me again. I can’t believe it’s selling me something that gets temporarily applied to a bag—to me when I had only 6 gold.This system was like a thief who’d come every night to rob me blind, and then proceeded to come back during the day to sell me the same things. I’m not buying it! Not at all!“Ah, I guess you don’t have enough space in the bag to hold all of this. There’s no extra bags left over either.”「 Would you like to purchase a bag? (Price : 50G) 」As soon as the store owner expressed his concern, the white letters of the system popped up at just the right timing as though it was waiting for the chance. I wondered if there was an NPC hiding behind the system, making a living out of my money.“It’s no problem. You can take out some of the items out of the bag to free up some space. I’m sorry, but I’ll come back for the rest of them the next time I visit. I don’t have enough hands, you see…”“Right, of course. That’s too bad. When you return, please say hi to Miss Leticia for me.”It was better to throw away things that weren’t mine in the first place than to spend my own money to keep them. Sifting through the things that the grocery store owner had put into the bag, I nonchalantly took out the things that weren’t in Catarina’s list and left only what I needed to bring back, that being salt and pepper.As if it didn’t expect my response, the white letters popped up again. Urgently this time.「 Would you like to purchase a bag? (Special price : 30G) 」It knew that I wouldn’t buy it, so just look at how that price is going down. I still won’t buy it even if it’s 10 gold.I snorted loudly as I saw the system’s reaction, then sauntered out to the street. The village wasn’t big, so I could just walk around for ten minutes and I’d have already seen the entire place. However, amongst the various shops here, there was one shop that caught my eye.“Welcome.”It was the bedding store. There was a bed being displayed near the entrance, and there were more items at the back, too. Pillows that were the hot item these days, wooden pillows that helped support the neck, white pillows made out of goose feathers, and lamps that were arranged side by side—everything caught my eye. I was already drooling over the display case by the time the shop owner approached.“I see that you’re interested in our pillows. A lot of new products have come in this time. I’ll open the display case for you so you can try touching them.”When the shop owner opened one side of the display case, helpful descriptions appeared in small status windows next to the various pillows.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 40": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 39Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play2-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by Yonnee「 Regular Pillow – 1G, a pillow filled with cotton. Its soft texture is nice, but your neck might hurt when you wake up.High Quality Pillow – 5G, a comfortable pillow filled with cotton. You will be able to wake up refreshed.Rare Pillow – 50G, a fluffy and comfortable pillow filled with feathers. It is the secret to a good night’s sleep.Hero Pillow – 200G, a pillow that’s like a drug. Be careful not to allow your head to use another pillow after using this. It is characteristically both hard and soft to support the neck and head respectively.Legendary Pillow – 1,000G, a pillow that can be used for a lifetime as it would break the bank. Its durability is infinite and the seams would never pop open. You need not doubt the texture and material of this pillow, and you can also believe in its functional abilities. Even people with severe insomnia fall asleep in a minute with this pillow alone.Mythic Pillow – 10,000G, the ultimate pillow that will take you to heaven as you sleep. It is the only pillow in the entire continent that has been magically enchanted by Archmage Zenith. 」As I went down the line, the more my eyes seemed to pop out of their sockets because of the prices. Still though, I wanted to sleep on these pillows at least once because they’re that great.The pillow I currently have was just a low-level pillow, yet my fatigue was relieved that much and my work efficiency was so good that I got critical hits often. What would happen if I had that mythic pillow?But as I looked at the prices, I recalled that the pillow I broke before must have been a high quality pillow. It shocked me quite a bit to find out that it wasn’t just an ordinary pillow. Then wasn’t Adrian’s pillow a legendary one? As soon as I put my head on it back then, I fell into slumber right away.1,000 gold… If I save for 34 days without using any of my daily wage, I’ll have 20 gold left over even if I buy a pillow. But this system concocts all sorts of ways to steal my money, so I don’t think I’ll be able to save up, maybe.“Would you like to buy a pillow?”With my face stuck to the display case as if I’m an octopus arm’s suction cup, the shop owner asked. I know it—I really know it for myself that I wouldn’t be able to afford it, but my eyes kept gravitating towards that legendary pillow. Can I at least rest my head on that pillow before I die?“One Regular… No, one High Quality Pillow please.”“Yes, right this way, dear customer.”After I went to the cash register and paid 5 gold for the pillow, I had only 1 gold left in my assets.Tada, 1 gold… I’ve been stuck in this world all this time and had such a hard time. I can’t believe I’ve reached the point where I have only 1 gold.I stood there, waiting for the shop assistant to pack the pillow and give it to me, but then I overheard the voices of other customers who came in to look at some beds.“…Anyway, did you hear the rumor? You know Jake, he just disappeared one day and then his body was found by the river a few days ago, with, well, his wrist severed.”“Really? And with how long has Emma been looking for him now? So then, what’s the cause of death? What did the inspector say? Oh my god, how dreadful…”“There’s been a few disappearances before, too. I think the most recent incident was about two years ago? It’s the same this time. He was stabbed to death. The work was so neat that it’s said to be the handiwork of an expert. Inspector Harrison had a few suspects in mind and he locked up all of them, but now it’s all useless. He was so confident that the murders wouldn’t ever happen again. Even if he had a mouth, what could he say?”“Oh goodness, this is so scary. Every time we start to forget, it all happens again… We should stop going out at night.”The two of them huddled together and whispered to themselves, but their voices were clear to both me and the shop owner a short distance away. Murders in this area, they said. Every few years.“Do you think it’s the same culprit? Or maybe it’s a different one this time. Maybe imitating the method.”“Don’t say such terrible things. If you think that there are not just one but multiple people like that in this small village… I’m getting goosebumps. I don’t think I’ll be able to go out at all with any peace of mind.”“I hope the police can catch the guy somehow and… Excuse me, what are you doing?”Whoops. While I was trying to listen in on their conversation more closely, I found myself right next to them already. I stood up awkwardly and leaned away from their pointed gazes.“Ha, haha. I, um, wanted to talk to you.”“Are you a resident of this village? I’ve never seen your face around these parts before though…”With eyes full of vigilance, maybe they saw something odd about me so they looked at me more suspiciously. It wasn’t long ago that a terrible incident had taken place, so they seemed more wary around outsiders.Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 41": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 40Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️Play“Don’t worry! She works at the Pfalzgraf household.”“The Pfalzgraf household? Ahh, you should have told me. Gosh, I’m sorry.”“Just excuses wouldn’t do much, I know. But it’s also because we’re scared of the rumors going around.”When the bedding store owner approached and spoke up about where I was from, the two others relaxed their expressions surprisingly quickly. They seemed to be more relieved to hear that I was someone who worked for Count Pfalzgraf’s family.“How is it in the Pfalzgraf manor these days? His Lordship is so kind-hearted that it must be easy to work for him. By the way, my daughter is turning thirteen years old this year and she’s got skilled hands and good ears. It would be so great if she could go to the Count’s manor and work there, too.”“What? Didn’t you tell me last week that your daughter ruined all your clothes while doing the laundry? You can’t make her work there. Miss, why don’t you meet my child instead? My child is really good at working. And I’m not joking here—”“Oh, so are you saying that complimenting my daughter is a joke, huh?”Up until now, they were talking leisurely while sitting on that bed, but the two people started fighting now. As they said, ‘What did you say about my daughter?’ and ‘What did you say about my daughter?’ in increasingly louder tones, I looked at them with a strange sense of wonder.It’s the first time in my life that I’m being asked to be a person of reference. I’m just a mere worker in the Pfalzgraf manor and I’m already hearing something like this. It’s a testament to just how great the status of the count was.As soon as I entered this village, the entire world seemed to be screaming at me that House Pfalzgraf was a prestigious and well-respected family. And since it was like that, it would be absurd for anyone to suspect that the successor to such a household was a devil and a serial killer.“Um, do you know more details about the murders they were talking about earlier?”I turned to the bedding store owner and asked her instead because it seemed impossible to ask the other two now. She smiled then answered.“I don’t know the details, but I do know some things since it’s in my job description to meet people. What are you curious about?”“Was there anything unusual about the incident? Maybe the victims have something in common with each other? That is, do they work in the same area, do they frequent the same places…”Since it seemed like the rest of the world wasn’t suspecting anyone from Pfalzgraf, there was no other choice for me but to doubt everything. Even if this was for the purpose of letting Adrian kill other people more easily, it felt as if I was being an accomplice so that he wouldn’t get suspected.The welcoming atmosphere for any and all things related to House Pfalzgraf made me strangely uncomfortable.I might be being too sensitive here, but this was because I still felt chills running down my spine every time I saw Adrian. It felt like his eyes were seeing right through me, like he could clearly see what’s going on in my head, and this instinctive fear was like a thorn that I just couldn’t remove.“Umm, no. The inspector said that the victims had nothing in common. That’s why everyone’s thinking that they’re random cases of murder.”“Really?”“What was it again? I think he said that he wasn’t sure if the killer’s a resident of this village. Some of the other victims are from the next village over, so he mentioned something about having to expand the scope of his investigation sooner or later. Gosh, it’s so scary.”As the bedding store owner shuddered in fright, I probed again.“Where can I meet the inspector you mentioned?”“Are you going to meet him yourself?”“No! I mean, not right away, I just want to know in case something might happen. I do work at the Pfalzgraf manor, but you never know if something would happen out there. Uuugh, I’m also so scared.”I shuddered in an exaggerated manner, and as the bedding store owner saw this, she nodded as if she understood my sentiments exactly.“Yes, it’s a scary world, so it’s important to be prepared at all times. But you’ll definitely be safe in the Pfalzgraf manor. Probably a lot more than this village. Inspector Harrison’s the one in charge of this case, but he’s not technically a member of this village’s neighborhood watch—ah, that’s the team that supports the police officers in crime prevention. The team’s headquarters is located at the third alley next to my store. From faraway at the Lukebell Village, Inspector Harrison comes by here every few days and stays there.”“I see. Thank you so much for letting me know.”“It’s nothing to be thankful about. Do you know how much our village owes His Lordship?”The bedding store owner gave me one last smile, then she turned to stop the other two people who were still fighting on that bed over there. I then left them behind and exited the store, following the bedding store owner’s directions.I have to wonder though. As far as I’ve seen, the game had given Adrian the characterization of a sickly constitution. He battled a lot of minor illnesses ever since he was young, and he constantly had to take medicine. Drinking medicine a little late would make him cough up blood, even as far as having to lie sick in bed for a few days after that.But you’re telling me that he’s running out to some other villages to kill people? No way.If this was the handiwork of someone else besides Adrian, then who was it?Who’s the guy messing with Adrian’s food in this game?Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 42": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 41Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayChapter 412-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by Yonnee“Huh? What’s that…”As I walked around the village, I realized that if I looked at the shelves of the stores from where I was on the street—just like in the bedding store—descriptions would appear over the items. While passing by, I unconsciously walked closer to the writing equipment store because I saw some weird description for a pencil.「 Ordinary pencil – 1G, a common pencil made from graphite rammed into wood. It serves its purpose well enough, but if you use it for a long time, it’s too hard, so it’ll hurt your hand. 」Until this part, the item description was just normal, but what’s unique about it was the explanation that was floating right underneath it.「 Adrian likes this item. 」I wonder why this kind of description didn’t show up for the cold brew latte that I made myself. This one was openly telling me that it’s a good gift item to raise someone’s favorability points.What a shock though. Adrian likes pencils? A knife, maybe. Or a gun, perhaps a hammer… I kinda thought he’d like items that could be used as a weapon to kill someone.I thought, Huh, so there’s a function like this, too, and I was just about to pass like that. But something suddenly popped up in my mind, making me stop in my tracks—the gift-giving counter floating on top of Adrian’s and the countess’ heads.The reason why I was given the chance to visit this village was, after all, because I coincidentally managed to raise the countess’ favorability points with the coffee I made.Adrian was the main character of this game, and compared to other people, more points were required to raise his favorability level. I think the system will unlock something bigger if that’s raised. Apart from that, the way the countess looked at me also changed when her favorability got higher.If I worked hard to raise Adrian’s favorability level, wouldn’t that save me if I ever run into a desperate moment? I don’t think he’d even get 5,000 EXP from killing me, but if his favorability points are high, wouldn’t he at least reconsider killing me?Two favorability points compared to one, three compared to two. Wouldn’t there be a greater chance that he’d spare me if it’s higher? That just might give me enough time to survive and find a way to get out of this game somehow…I walked into that store. In front of the store owner who welcomed me so enthusiastically, I couldn’t really open my mouth.In my head, I knew that I’d have to work hard to raise those favorability points, but I don’t exactly have much money now because I bought that high quality pillow.There’s only one gold left in my wallet. I can’t believe I have to spend the last of my money on an ordinary pencil…When I return to my room later, I’m pretty sure the daily wage I’ll be getting is high enough, but I have no idea when exactly that system is going to play a sick prank on me again. And I can’t exactly leave my money in a bank…“Miss, which item would you like to buy?”“O-O-O-One…”“Are you feeling cold, Miss? You’re shivering quite a lot.”“One…. o-or, or…dina…ry… pencil… please…”As my jaw shook while my teeth chattered together, the store owner leaned forward and raised a hand to his ear.“One or…dinary pencil.”Just to say those three words, I had to muster up all the patience that should be beyond human standards. Only then did the store owner’s face brighten because he finally understood words that sounded like human language.“Aha, so you mean one ordinary pencil. Please wait a moment. Would you like to have it gift wrapped?”“Um… Yes please. Maybe it’ll get me more favorability points…”“The gift-wrapping service will cost 10 gold.”“No, no! Cancel the gift-wrapping please. I’ll do it myself!”“Is that so? Then, here you go.”After hastily waving my hands to dissuade him, the subsequent misery poured in. My pitiful 1 gold, the number floating at the upper part of my field of view, then turned into a more pitiful 0 gold. Our dear lordship mister count, sir, please, help not the orphans and those stricken by poverty— I beg of you, please help those who are a little closer to you.I wasn’t even in my right mind to know if it was still in the display cabinet or if I already bought it, but I left that store with one pencil in my hand. It’s a pencil, but it’s both a familiar and an unfamiliar item. I rarely ever used one since elementary school…I rolled the pencil a few times on my palm, then unnecessarily gripped it tight.Staring at the 0 gold shining above my head, I felt wronged yet again. No, I mean, I don’t have much money in the first place, but why should I get something for Adrian? He’s a rich young nobleman while I’m just a tenant living in his property!Besides, I worked like a dog just to earn that money, but didn’t buying him a gift mean that he’s just stealing my hard-earned salary back?“Just what kind of payback…”“Pay, what?”“Payback, payback! What kind of question even is—”While throwing back a question to that question, I was about to turn around in one quick motion, but then I stopped right there because of the familiar eyes that stared back at me.It felt like my tongue had been chopped off.I noticed too late that the siren indicating my perception skill, which was activated all this time, had gone bright red.“What’s wrong, Hilda?”“A…AHHH!”Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 43": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 42Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayChapter 422-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by YonneeThe moment I saw those eyes, beautifully curved into two crescent moons, I literally shrieked and stumbled a few steps back. Hiiiek, hiieeek… Loud gasps, almost to the point of suffocation, leaked through my open lips.When I desperately stepped back and tried to get away, my face probably entirely pale as though I had seen a ghost, the smile on Adrian’s face was wiped off.His expression now was left with only a formal smile. He looked like a statue carved from wax—handsome, but hard.“Surprised?”“H-How come, here…”“I startled you a lot. I didn’t mean to.”“B-B-B-Because you suddenly appeared like that…”This jerk really is a devil, just popping out of thin air…“I’m sorry for surprising you.”“Huh? N-No, it’s alright. You don’t have to apologize, Young Master.”I got so flustered that I stammered again, not expecting that he would apologize. After cursing at him inwardly, I felt like I was too mean to him now. And really though, in this world, Adrian didn’t need to apologize at all, even if I tripped and fell after he surprised me like that.「 You met Adrian for the first time out in a village. You gained 2,000 EXP. 」The EXP bar filled up a lot today because of the critical hits, and now it reached level 9, around the middle of the bar, filling up until past the second half. I’m so, so close to level 10 now.This reminded me of the time I managed to raise myself to level 4 with just the pure labor of weed pulling. Admiring my growth, tears welled up in my eyes.It’s so difficult to raise my level like this, but there’s not even any reward for every level in this garbage, flop game…“Hilda?”Slightly tilting his head to the side, Adrian stared at me. The sun’s bright, golden rays streamed down over him and made him shine all glittery like a jewel.If I didn’t know who he was, maybe green fields or even the innocent springtime would have flashed before my eyes. When looking at him like this, I couldn’t help but somehow smell fragrant flowers from him.But that was just Adrian’s shell. And it was all very poisonous.There’s a snake within him. A snake that would flit out its forked tongue, biding its time while waiting for a chance to strike.“Why are you looking at me like that again?”“It’s just like I told you before, sir. It’s because you’re handsome. You’re the same today as well.”“Handsome?”“Absolutely. Seriously, Young Master, with that kind of face, you shouldn’t even be smiling at anyone. Whenever you look at me, Young Master, it feels like all the light in the entire world is blinding my eyes.”When I automatically complimented him again, the white letters appeared right on time.「 Adrian’s favorability has risen by 1 point. 」「 Adrian’s favorability : Lvl.1 (4/400) 」“Really? I think so, too. But still, thank you.”Still as ever, looks like you know exactly how handsome you are, huh. It’s obvious that flattery was still also effective towards a boss. I wonder though. If I compliment him 100 times a day and wouldn’t buy him any gifts, would this work smoothly enough and raise his favorability?“Hilda, you really show everything you’re thinking of on your face, you know.”“Hu…uuuh? What do you mean…”“No, it’s just. I’m saying this because you really do look so innocent.”He’s the one smiling so innocently like this, but he didn’t look innocent at all.What the, so you know what I’m thinking because it’s all being shown on my face? I have no idea just how much this devil knew, or if he really meant what he said.I’m someone who knows the game’s backstories and scenarios, but I’m getting all confused like this. It must be a piece of cake for him to fool the NPCs.But at the end of the day, the truth was harsh only towards those who knew.“By the way, what are you doing here in town, Hilda? You originally don’t come all the way out here very often.”“I’m here to do some errands for the kitchen. But I wasn’t actually asked to get this much.”“Yeah, that looks heavy.”“I stopped by only a couple of stores, but it became like this in no time. People kept saying that it’s because I’m working at the Pfalzgraf household, that’s why they gave me so much. All the people in this village just open up their store at the first mention of the Pfalzgraf family.”“Of course, since my father takes good care of this village since it’s near the manor. House Pfalzgraf is famous for its charity for many generations.”“The villagers didn’t just praise His Lordship, but also you, Young Master. Everyone kept saying that you’re like an angel who came down from the heavens…”“An angel, huh.”When I mentioned that word, I tried to look closely at his expression, watching for any change at all. But frighteningly enough, nothing changed. It’s like telling a dog’s owner, ‘Oh, what a cute cat you have there.’Even so, it’s only natural that he wouldn’t let anything show. Because whatever people thought of him, he would still, in the end, kill.Uh, uuugh. I’m getting scared again just thinking about it. I tried to step back inch by inch, but then something from the shadows came partly into view.Come to think of it, his hands were behind his back. What do you have there? Something that looks sharp…?Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 44": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 43Previous Chapter<All ChaptersNext Chapter>A+A-📚Mark Read⚙️PlayChapter 432-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by Yonnee“Are you looking at this?”“AACK!”When I craned my neck to see what was hidden behind his back, Adrian suddenly brought it forward and pushed it to me. I immediately turned pale and stumbled back again.“W-W-What are you going to d-do with such a dangerous thing?”“This? They’re just ordinary garden shears though.”“That’s why they’re dangerous. Those are such big scissors, so just one wrong move and you can cut your hand and bleed out and maybe bleed out to death or there’s even the risk of infection and—”“Are you worried about me?”No, not you. Me.“O-Of course. Young Master, you must not be used to holding a tool like that, so I’m just worried that you’ll get hurt if you use it wrong… But may I ask, what are you going to use that for? Please, you can give it to me instead. I’ll hold it for you.”I was thinking about taking his weapon away from him before he’d decide to stab me to death, but fwick— he somehow dodged my hand.“No need. It’s quite heavy, Hilda. I can’t make you carry something heavy.”This jerk. I’m sure he knows I’m trying to steal his weapon. How could he even tell such a despicable lie with a gentle-looking face like that?“No, Young Master. It doesn’t look heavy at all. Don’t you see the shopping bag I’m carrying now? I can carry it like this. It’s really heavy, you know, but I’m holding it really well. This body of mine is strong, so… Please hand it over!”“No, Hilda. It’s very heavy…”“Please give it to me. Hurry.”“But it’s heavy…”“Ugh, then carry this bag instead and just gimme!”“Wait, you’ll get hurt…”I absolutely can’t die in a game like this!With single-minded determination, I practically flung the shopping bag at him and took the garden shears, which he tried to hide behind his back again. But the moment I got them off his hands, I almost jumped up and down in triumph.I got it! I got the murderer’s weapon!“Hilda… Are you really so happy just to get those shears?”“Of course…! Ack, Y-Young Master. I’m so sorry. Are you alright?”Belatedly realizing just what I had done, I almost stopped breathing. Crazy. As if it’s not enough that I threw the bag straight at his chest, but I also dropped honorifics when I shouted! No matter how much I went out of my mind, I just went ahead and shortened my lifespan all on my own. Look at that begrudging look on his face! I’m dead. Was he boiling in so much rage now that he’d come running at me?“I apologize immensely. I was just so worried that you’d get hurt, Young Master, that I…”“I knew it. Hilda, you really are the only one who thinks of me.”When Adrian said that, his expression was not good. Gulping once, I cowered. I have no idea how many peaks and valleys this day has given me.Was he really going to kill me this time? But even if he’s decided to kill me, it’ll be back in the manor, right?As expected, it was a good decision to take away the garden shears from him. The blades were so sharp that they’d easily pierce through someone’s stomach and even break their ribs. If he tries to kill me now, I can at least defend myself with this and escape somehow.“I’m really, really sorry. Please give me the shopping bag again. I’ll carry everything.”“No, it’s alright. It’s really heavy, so I’ll carry it.”“Please just give it to me, your body’s condition also isn’t good…”This, at least, was something I meant. No matter how cold-blooded of a devil he was inside, the shell he had was still the weak and sickly Adrian. If this much was already heavy for someone who had a firm, strong body that’s like an experienced farmer’s, then it would be that much heavier for him.I worried about him like that, but Adrian flatly refused.“No, Hilda. I’ll carry this, so you just hold onto the garden shears. But once you take it safely back to the manor, you’ll give it back to me then, right?”“Yes, of course. Once I return to the manor, I’ll return it and even deliver it to you in your room, Young Master.”Return? No way. I’m going to bring this back to the manor and bury it somewhere deep in the garden.If he’s really going to use this to kill people, then it would be trouble no matter who he’d decide to target.I heard that the act of murder was addicting. Would closing the windows like this stop the flood? He’s only killing people out of necessity to regain his strength, but if he starts killing in earnest, then I’m pretty sure it’ll be my turn soon enough.If I don’t want to die, maybe the path to survival is to make sure that other people stay alive, too.This was the conclusion I ended up with.Still, if it’s really inevitable, at least let my turn be the last…“But Young Master, why do you need this? They’re garden shears, but…”“My Mother’s condition seems to be worse off these days, so I was going to trim the garden that she often goes to. We planted citrus trees together there when I was young. I thought it would comfort her a little if I planted something small and tidy up the garden a bit.”When asked the question, a surprisingly human answer came back. The story was so detailed and intricate, and his expression looked kinda affectionate too, so it almost felt real.Are you just… acting? You’re not being for real, are you?Previous Chapter<All ChaptersNext Chapter>",
    "Chapter 45": "📕WuxiaClick🌙Home/Surviving as a Maid in a Horror GameCH 44Previous Chapter<All ChaptersNovel InfoNovel InfoA+A-📚Mark Read⚙️PlayChapter 442-1. Sure, you have skills now, but nobody ever said you can use them as you please.Translated by Yonnee“Then please feel free to let me or Miss Leticia know. Young Master, you don’t have to come out yourself just to trim the garden. All you have to do is tell us how to trim and decorate the garden, and we’ll take it from there. Why do this when you can just sit back comfortably, sir?”“So.”“Huh?”“So you’ll do everything I ask you to? But then I won’t have anything left to do for Mother.”“F-For real?”What the. My lips answered automatically because I didn’t expect his answer. He’s Satan, but did he still love the countess because she was the person who gave birth to him? But that doesn’t add up.In the game, even the count and the countess were Adrian’s kill targets. Or maybe… Was he planning to lure the countess to the garden, by the citrus tree, then brutally kill her there?Yeah, that sounds more believable. This devil right here couldn’t possibly feel any human affection.“But Hilda, are you going somewhere else? I don’t think there are any more shops on this street.”I was about to go see the neighborhood patrol of this town and ask them about the recent murders, dear young master. I don’t think you’re the one who did it, but if they were looking for evidence or witnesses, I thought I’d join the witness protection program, ‘s’all.I couldn’t say all this honestly, now could I, so I turned around with my back to the neighborhood patrol headquarters and pointed at some other random place.“Um, there… No, over there?”“That place… is a dead end, Hilda.”Gosh. Looks like he knows this village well enough.I looked elsewhere and tried to make a rough guess, but time passed and I still couldn’t find anything. Somehow, his gaze was persistent on me, so I let out a deep sigh, acting as if I had no other choice but to say this.“Yes, I lied, actually. I wasn’t really going that direction, but it’s because I stopped by the stationary store for a bit. Because of you, Young Master.”“Because of me?”“Yes. Young Master, if you were to receive a gift, what kind of gift would you like the most?”Rather than just looking around, waiting for the notification that would say, 「 Adrian likes this item 」 it’d be much better to just ask the guy directly. As long as it’s an item he actually likes, if I throw something like that at him, then I’m sure that his favorability points would go up, too.“Will you buy it for me?”“Um, well, it depends on the, um, budget, so I guess… maybe… or maybe not…”“If it’s from Hilda, I’ll be happy to receive anything.”When Adrian said this, he gave much emphasis on the name ‘Hilda’. I guess he really wants to receive something, huh. Maybe this is also how the count’s household maintains its riches.I heard that the richer you are, the more… well…“Here, I thought you’d like this, so I bought it.”With a trembling hand, I took the pencil out of my pocket. It’s quite literally something I bought with my entire fortune, but what was I doing, giving it away without getting anything in return.No matter what kind of game it was, I used to play until the maximum level without having to shell out any cash. But why do I keep getting ripped off here? It felt like I was in a constant losing battle against the game system.I don’t want to give it to him. I want to take it back to the store and ask for a refund. I want to safeguard my money, even if it’s just 1 gold…When I said that it’s for him, I felt my face twitch, starting from my lips.“You’re giving this to me?”“Yes…”To be more exact, I’m only giving it to you to raise your favorability. If that shoots up, then so do my chances of surviving and living a cushy life.“This pencil looks like it’s easy and convenient to use. Thank you very much, Hilda. I’ll use it a lot.”But what if the points don’t go up that much? Then I’ll just have to abandon the plan to raise his favorability. If it’s not going to be very efficient…「 You gifted Adrian an ‘ordinary pencil’. 」「 Adrian is delighted. 」「 Adrian’s favorability has risen by 30 points. 」「 Adrian’s favorability : Lvl.1 (34/400) 」Hm. 30 points for 1 gold is quite the bargain. If I just flatter him a few times a day while throwing a pencil at him at the same time, I might be able to raise his favorability pretty fast.He only received a shabby pencil, but Adrian smiled so brightly that even the person looking at him became delighted.But for some reason, there was a certain image overlapping his figure right now. The one I saw at the game’s title screen—the one that seemed like Diablo’s fiery pit.I managed to raise your favorability points, but why does it look like your smile became even more menacing…?The moment I saw that expression, I was thrown into agony once more. Is it really a good idea to get the devil to like me?Of course, indifference was surely the best, but I had to exclude that route because I messed that one up early on. In the first place, didn’t I ruin everything from the very beginning while I was supposed to be the maid who’s in charge of Adrian’s meds?“Then, are you finished with your errands here?”“Yes, Young Master. I bought everything already, so I was on my way back.”I looked around again and tried to memorize the way to the neighborhood patrol headquarters that was not too far away from here. I’m gonna need to go there later. I need to pay a visit and talk to Inspector Harrison.Previous Chapter<All ChaptersNovel InfoNovel Info",
    "Chapter 46": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 47": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 48": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 49": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 50": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 51": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 52": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 53": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 54": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 55": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 56": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 57": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 58": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 59": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 60": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 61": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 62": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 63": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 64": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 65": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 66": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 67": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 68": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 69": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 70": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 71": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 72": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 73": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 74": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 75": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 76": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 77": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 78": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 79": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 80": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 81": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 82": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 83": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 84": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 85": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 86": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 87": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 88": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 89": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 90": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 91": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 92": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 93": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 94": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 95": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 96": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 97": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 98": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 99": "📕WuxiaClick🌙HomeA+A-⚙️Play",
    "Chapter 100": "📕WuxiaClick🌙HomeA+A-⚙️Play"
}